[
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao khi đun nước, ta không nên đổ nước thật đầy ấm?",
    "a": "Vì tốn nhiên liệu đun nóng.",
    "b": "Vì nước khi sôi sẽ chuyển động hỗn loạn làm hỏng ấm.",
    "c": "Vì sự giãn nở vì nhiệt của chất lỏng (nước) lớn hơn sự giãn nở của chất rắn (ấm), nước sẽ tràn ra ngoài gây nguy hiểm.",
    "d": "Vì nước cần không gian để hòa tan khí Oxy.",
    "correct": "Vì sự giãn nở vì nhiệt của chất lỏng (nước) lớn hơn sự giãn nở của chất rắn (ấm), nước sẽ tràn ra ngoài gây nguy hiểm.",
    "explain": "Chất lỏng giãn nở vì nhiệt nhiều hơn chất rắn. Khi đun sôi, thể tích nước tăng lên nhiều hơn thể tích ấm, gây tràn."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao cá thường phải ngoi lên mặt nước để thở vào những ngày trời nắng nóng oi bức, trước khi có mưa dông?",
    "a": "Vì cá thích tắm nắng.",
    "b": "Vì nhiệt độ nước tăng cao làm giảm độ tan của khí Oxygen trong nước, đồng thời quá trình phân hủy chất hữu cơ tăng mạnh tiêu tốn Oxygen.",
    "c": "Vì áp suất khí quyển giảm làm cá bị nén ép.",
    "d": "Vì nước mưa sắp rơi xuống mang theo nhiều Oxygen.",
    "correct": "Vì nhiệt độ nước tăng cao làm giảm độ tan của khí Oxygen trong nước, đồng thời quá trình phân hủy chất hữu cơ tăng mạnh tiêu tốn Oxygen.",
    "explain": "Độ tan của chất khí tỉ lệ nghịch với nhiệt độ. Nước nóng chứa ít Oxy hơn, buộc cá phải ngoi lên để lấy Oxy từ lớp nước mặt tiếp xúc không khí."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Để tách riêng một hỗn hợp gồm: Bột sắt, Cát, Muối ăn và Mùn cưa. Trình tự thực hiện nào sau đây là tối ưu nhất?",
    "a": "Hòa vào nước -> Lọc -> Cô cạn -> Dùng nam châm.",
    "b": "Dùng nam châm -> Hòa vào nước -> Vớt mùn cưa -> Lọc cát -> Cô cạn nước lọc.",
    "c": "Hòa vào nước -> Vớt mùn cưa -> Dùng nam châm trong nước -> Cô cạn.",
    "d": "Dùng rây (sàng) -> Hòa vào nước -> Lọc -> Cô cạn.",
    "correct": "Dùng nam châm -> Hòa vào nước -> Vớt mùn cưa -> Lọc cát -> Cô cạn nước lọc.",
    "explain": "Bước 1: Nam châm tách sắt (tính từ). Bước 2: Hòa nước (muối tan, cát chìm, mùn cưa nổi). Bước 3: Vớt mùn cưa. Bước 4: Lọc lấy cát. Bước 5: Cô cạn thu muối."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao đám cháy do xăng dầu KHÔNG được dùng nước để dập tắt?",
    "a": "Vì nước phản ứng với xăng sinh ra chất nổ.",
    "b": "Vì nước làm giảm nhiệt độ đám cháy quá nhanh gây sốc nhiệt.",
    "c": "Vì xăng dầu nhẹ hơn nước và không tan trong nước, nên sẽ nổi lên trên mặt nước và tiếp tục cháy lan rộng hơn.",
    "d": "Vì nước chứa Oxy cung cấp cho sự cháy.",
    "correct": "Vì xăng dầu nhẹ hơn nước và không tan trong nước, nên sẽ nổi lên trên mặt nước và tiếp tục cháy lan rộng hơn.",
    "explain": "Nguyên tắc chữa cháy là cách ly chất cháy. Nước chìm xuống dưới làm xăng nổi lên và loang ra, khiến diện tích tiếp xúc với Oxy tăng lên."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Nước đá (thể rắn) có đặc điểm gì đặc biệt so với hầu hết các chất rắn khác, giúp sinh vật dưới nước sống sót qua mùa đông giá rét?",
    "a": "Nước đá dẫn nhiệt tốt hơn nước lỏng.",
    "b": "Nước đá có khối lượng riêng nhỏ hơn nước lỏng (khoảng 4°C), nên nó nổi lên trên, tạo lớp cách nhiệt bảo vệ nước lỏng bên dưới.",
    "c": "Nước đá tan chảy ở nhiệt độ cao hơn 0°C.",
    "d": "Nước đá trong suốt cho ánh sáng đi qua.",
    "correct": "Nước đá có khối lượng riêng nhỏ hơn nước lỏng (khoảng 4°C), nên nó nổi lên trên, tạo lớp cách nhiệt bảo vệ nước lỏng bên dưới.",
    "explain": "Sự nở bất thường của nước: Nước nhẹ nhất ở trạng thái băng (rắn) nên nổi lên trên, ngăn cản sự mất nhiệt của lớp nước phía dưới."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Trong các đám cháy kín (nhà kho đóng kín cửa), tại sao không nên mở đột ngột cửa sổ hay cửa ra vào?",
    "a": "Vì gió sẽ thổi tắt lửa.",
    "b": "Vì lượng khí Oxygen bên ngoài tràn vào ồ ạt kết hợp với khí CO tích tụ bên trong gây ra hiện tượng nổ (Backdraft) và bùng cháy dữ dội.",
    "c": "Vì sẽ làm thoát khí độc ra môi trường.",
    "d": "Vì làm giảm nhiệt độ phòng đột ngột.",
    "correct": "Vì lượng khí Oxygen bên ngoài tràn vào ồ ạt kết hợp với khí CO tích tụ bên trong gây ra hiện tượng nổ (Backdraft) và bùng cháy dữ dội.",
    "explain": "Đám cháy kín đang thiếu Oxy và sinh ra nhiều khí cháy dở (CO). Cung cấp Oxy đột ngột sẽ gây phản ứng cháy nổ tức thì."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Để phân biệt hai chất lỏng không màu là Nước cất và Nước muối bão hòa mà KHÔNG được nếm, phương pháp vật lý nào sau đây là chính xác nhất?",
    "a": "Đun sôi và đo nhiệt độ sôi.",
    "b": "Ngửi mùi.",
    "c": "Quan sát độ trong suốt.",
    "d": "Lọc qua giấy lọc.",
    "correct": "Đun sôi và đo nhiệt độ sôi.",
    "explain": "Nước cất sôi ở 100°C. Nước muối là dung dịch nên có nhiệt độ sôi cao hơn 100°C. Hoặc có thể cô cạn để xem cặn muối."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao khi pha loãng Acid Sulfuric (H₂SO₄) đậm đặc, ta BẮT BUỘC phải rót từ từ acid vào nước mà không được làm ngược lại?",
    "a": "Vì nước nhẹ hơn acid, nếu rót nước vào acid, nước sẽ nổi lên, sôi đột ngột và bắn tung tóe acid ra ngoài gây bỏng.",
    "b": "Vì acid sẽ không tan trong nước nếu làm ngược lại.",
    "c": "Vì làm ngược lại sẽ tạo ra khí độc.",
    "d": "Vì rót acid vào nước giúp acid bay hơi nhanh hơn.",
    "correct": "Vì nước nhẹ hơn acid, nếu rót nước vào acid, nước sẽ nổi lên, sôi đột ngột và bắn tung tóe acid ra ngoài gây bỏng.",
    "explain": "Quá trình hòa tan acid tỏa rất nhiều nhiệt. Nước nhẹ hơn nên nếu rót vào acid, nó sẽ nổi và sôi ngay lập tức, bắn acid ra xung quanh."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Khí Carbon dioxide (CO₂) nặng hơn không khí và không duy trì sự cháy. Tuy nhiên, tại sao không dùng bình cứu hỏa CO₂ để dập tắt đám cháy kim loại (như Magie, Nhôm)?",
    "a": "Vì CO₂ sẽ hóa lỏng làm lạnh kim loại.",
    "b": "Vì ở nhiệt độ cao, kim loại mạnh (Mg, Al) sẽ cướp Oxy của CO₂, làm đám cháy bùng to hơn và sinh ra Carbon (muội than).",
    "c": "Vì CO₂ bay hơi quá nhanh.",
    "d": "Vì kim loại không cháy được.",
    "correct": "Vì ở nhiệt độ cao, kim loại mạnh (Mg, Al) sẽ cướp Oxy của CO₂, làm đám cháy bùng to hơn và sinh ra Carbon (muội than).",
    "explain": "Phản ứng hóa học: 2Mg + CO₂ -> 2MgO + C. Phản ứng này tỏa nhiệt mạnh và sinh ra Carbon tiếp tục cháy."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao các thanh ray đường sắt luôn có một khe hở nhỏ ở chỗ nối giữa hai thanh?",
    "a": "Để tiết kiệm vật liệu sắt.",
    "b": "Để thoát nước mưa.",
    "c": "Để tạo không gian cho sự giãn nở vì nhiệt của thanh sắt khi trời nóng, tránh làm cong đường ray.",
    "d": "Để giảm tiếng ồn khi tàu chạy.",
    "correct": "Để tạo không gian cho sự giãn nở vì nhiệt của thanh sắt khi trời nóng, tránh làm cong đường ray.",
    "explain": "Chất rắn giãn nở khi nóng lên. Nếu không có khe hở (khe nhiệt), lực giãn nở cực lớn sẽ bẻ cong đường ray gây tai nạn."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Làm thế nào để thu được nước ngọt từ nước biển trong trường hợp khẩn cấp trên đảo hoang (dựa trên nguyên lý chưng cất)?",
    "a": "Lọc nước biển qua nhiều lớp vải.",
    "b": "Đun nóng nước biển, hứng hơi nước bay lên và làm lạnh để ngưng tụ thành nước ngọt.",
    "c": "Để nước biển đông đá rồi lấy phần đá tan ra uống.",
    "d": "Phơi nước biển dưới nắng để muối lắng xuống.",
    "correct": "Đun nóng nước biển, hứng hơi nước bay lên và làm lạnh để ngưng tụ thành nước ngọt.",
    "explain": "Muối không bay hơi. Khi đun, chỉ có nước bay hơi (hơi nước tinh khiết). Ngưng tụ hơi này ta được nước ngọt."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Hiện tượng 'Hiệu ứng nhà kính' làm Trái Đất nóng lên chủ yếu liên quan đến sự gia tăng nồng độ của khí nào trong khí quyển?",
    "a": "Khí Nitrogen (N₂).",
    "b": "Khí Oxygen (O₂).",
    "c": "Khí Carbon dioxide (CO₂) và Methane (CH₄).",
    "d": "Khí Argon (Ar).",
    "correct": "Khí Carbon dioxide (CO₂) và Methane (CH₄).",
    "explain": "Các khí nhà kính (CO₂, CH₄...) hấp thụ bức xạ nhiệt từ mặt đất và giữ lại trong khí quyển, ngăn nhiệt thoát ra vũ trụ."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao than tổ ong (than đá) khi ủ cháy trong phòng kín lại dễ gây tử vong cho con người?",
    "a": "Vì nó tỏa ra quá nhiều nhiệt làm bỏng da.",
    "b": "Vì nó tiêu thụ hết khí Nitơ.",
    "c": "Vì quá trình cháy thiếu khí Oxy sẽ sinh ra khí Carbon monoxide (CO) - một khí không màu, không mùi nhưng cực độc, ngăn cản máu vận chuyển Oxy.",
    "d": "Vì nó sinh ra khí CO₂ gây ngạt thở từ từ.",
    "correct": "Vì quá trình cháy thiếu khí Oxy sẽ sinh ra khí Carbon monoxide (CO) - một khí không màu, không mùi nhưng cực độc, ngăn cản máu vận chuyển Oxy.",
    "explain": "Khí CO (Cacbon monoxit) kết hợp với Hemoglobin trong máu chặt hơn Oxy gấp 200 lần, làm cơ thể chết ngạt dù vẫn hít thở."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Một vật thể làm bằng hợp kim (ví dụ: thép) thường cứng và bền hơn kim loại nguyên chất (ví dụ: sắt tinh khiết). Nguyên nhân chính là gì?",
    "a": "Vì hợp kim nặng hơn.",
    "b": "Vì các nguyên tử khác loại trong hợp kim có kích thước khác nhau, làm xô lệch mạng tinh thể, ngăn cản sự trượt của các lớp nguyên tử lên nhau.",
    "c": "Vì hợp kim không bị gỉ sét.",
    "d": "Vì hợp kim có nhiệt độ nóng chảy cao hơn.",
    "correct": "Vì các nguyên tử khác loại trong hợp kim có kích thước khác nhau, làm xô lệch mạng tinh thể, ngăn cản sự trượt của các lớp nguyên tử lên nhau.",
    "explain": "Cấu trúc tinh thể bị xô lệch khiến các lớp nguyên tử khó trượt lên nhau khi chịu lực, làm tăng độ cứng."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao muối I-ốt (NaCl trộn KIO₃) cần được bảo quản trong lọ kín, tối màu và tránh nhiệt độ cao?",
    "a": "Vì muối sẽ bị tan chảy.",
    "b": "Vì hợp chất I-ốt (KIO₃) kém bền, dễ bị phân hủy hoặc thăng hoa (bay hơi) khi gặp nhiệt độ và ánh sáng, làm mất tác dụng phòng bướu cổ.",
    "c": "Vì muối sẽ biến thành đường.",
    "d": "Vì muối sẽ hút ẩm biến thành nước.",
    "correct": "Vì hợp chất I-ốt (KIO₃) kém bền, dễ bị phân hủy hoặc thăng hoa (bay hơi) khi gặp nhiệt độ và ánh sáng, làm mất tác dụng phòng bướu cổ.",
    "explain": "I-ốt bổ sung thường không bền nhiệt và ánh sáng. Nếu bảo quản sai, lượng I-ốt sẽ thất thoát hết, chỉ còn lại muối ăn thường."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Khi đốt cháy 1kg than đá dạng cục và 1kg than đá dạng bột trong cùng điều kiện, than dạng bột cháy nhanh và mạnh hơn. Yếu tố nào ảnh hưởng đến tốc độ phản ứng này?",
    "a": "Nhiệt độ môi trường.",
    "b": "Diện tích tiếp xúc bề mặt của chất cháy với Oxy.",
    "c": "Khối lượng chất cháy.",
    "d": "Áp suất không khí.",
    "correct": "Diện tích tiếp xúc bề mặt của chất cháy với Oxy.",
    "explain": "Nghiền nhỏ làm tăng diện tích tiếp xúc giữa nhiên liệu và Oxy, giúp phản ứng cháy diễn ra nhanh và triệt để hơn."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao không nên dùng hộp xốp hoặc túi nilon tái chế để đựng thức ăn nóng, nhiều dầu mỡ?",
    "a": "Vì thức ăn sẽ bị nguội nhanh.",
    "b": "Vì nhiệt độ cao và dầu mỡ sẽ hòa tan các chất phụ gia, monome độc hại (như Styrene, Chì, Cadimi) từ nhựa/xốp vào thức ăn gây ung thư.",
    "c": "Vì làm biến đổi mùi vị thức ăn.",
    "d": "Vì hộp xốp dễ vỡ.",
    "correct": "Vì nhiệt độ cao và dầu mỡ sẽ hòa tan các chất phụ gia, monome độc hại (như Styrene, Chì, Cadimi) từ nhựa/xốp vào thức ăn gây ung thư.",
    "explain": "Nhựa tái chế và xốp kém bền nhiệt và dễ tương tác hóa học với dung môi hữu cơ (dầu mỡ) ở nhiệt độ cao, giải phóng độc tố."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Để bảo quản kim loại Natri (Na) trong phòng thí nghiệm, người ta phải ngâm nó trong dầu hỏa. Tại sao?",
    "a": "Để Natri không bị bay hơi.",
    "b": "Để giữ Natri luôn lạnh.",
    "c": "Để ngăn cách Natri tiếp xúc với Oxy và hơi nước trong không khí (vì Natri phản ứng rất mạnh gây cháy nổ).",
    "d": "Để Natri cứng hơn.",
    "correct": "Để ngăn cách Natri tiếp xúc với Oxy và hơi nước trong không khí (vì Natri phản ứng rất mạnh gây cháy nổ).",
    "explain": "Natri là kim loại kiềm hoạt động hóa học rất mạnh, tác dụng ngay với hơi nước và Oxy trong không khí. Dầu hỏa trơ và ngăn cách các chất này."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao nước máy ở thành phố thường có mùi hơi hắc?",
    "a": "Do mùi của đường ống dẫn nước.",
    "b": "Do dư lượng khí Clo (Chlorine) được sục vào để khử trùng, diệt khuẩn nguồn nước.",
    "c": "Do nước bị nhiễm phèn.",
    "d": "Do mùi của khoáng chất tự nhiên.",
    "correct": "Do dư lượng khí Clo (Chlorine) được sục vào để khử trùng, diệt khuẩn nguồn nước.",
    "explain": "Clo là chất oxi hóa mạnh dùng để diệt khuẩn. Một lượng nhỏ dư lại để ngăn ngừa tái nhiễm khuẩn trên đường ống, gây mùi hắc đặc trưng."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Bê tông (hỗn hợp xi măng, cát, đá, nước) là một loại vật liệu composite. Tại sao người ta thường dùng 'Bê tông cốt thép' thay vì bê tông thường trong xây dựng?",
    "a": "Vì thép rẻ hơn xi măng.",
    "b": "Vì bê tông chịu nén tốt nhưng chịu lực kéo kém, thép chịu lực kéo tốt. Kết hợp lại tạo vật liệu chịu được cả hai lực.",
    "c": "Vì thép giúp bê tông khô nhanh hơn.",
    "d": "Vì thép giúp bê tông nhẹ hơn.",
    "correct": "Vì bê tông chịu nén tốt nhưng chịu lực kéo kém, thép chịu lực kéo tốt. Kết hợp lại tạo vật liệu chịu được cả hai lực.",
    "explain": "Đây là nguyên lý bổ trợ tính chất của vật liệu composite. Sự kết hợp giúp công trình chịu lực tốt và bền vững."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Hiện tượng 'Mưa axit' có khả năng ăn mòn các công trình kiến trúc làm bằng đá vôi hoặc đá cẩm thạch. Phản ứng hóa học chủ yếu ở đây là gì?",
    "a": "Axit hòa tan bụi bẩn trên đá.",
    "b": "Axit (H₂SO₄, HNO₃) trong mưa phản ứng với Canxi cacbonat (CaCO₃) trong đá, tạo thành muối tan và khí CO₂, làm đá bị mòn.",
    "c": "Nước mưa làm đá bị nứt vỡ vật lý.",
    "d": "Axit làm đá chuyển màu đen.",
    "correct": "Axit (H₂SO₄, HNO₃) trong mưa phản ứng với Canxi cacbonat (CaCO₃) trong đá, tạo thành muối tan và khí CO₂, làm đá bị mòn.",
    "explain": "CaCO₃ + 2H⁺ -> Ca²⁺ + CO₂ + H₂O. Phản ứng này phá hủy cấu trúc của các bức tượng, tòa nhà làm bằng đá vôi."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Khi nung nóng đá vôi (CaCO₃) để sản xuất vôi sống (CaO), khối lượng chất rắn sau phản ứng thay đổi như thế nào so với ban đầu?",
    "a": "Tăng lên vì hấp thụ nhiệt.",
    "b": "Giảm đi vì khí CO₂ đã bay hơi thoát ra ngoài.",
    "c": "Không đổi theo định luật bảo toàn khối lượng.",
    "d": "Tăng lên vì kết hợp với Oxy.",
    "correct": "Giảm đi vì khí CO₂ đã bay hơi thoát ra ngoài.",
    "explain": "Phương trình: CaCO₃ (rắn) -> CaO (rắn) + CO₂ (khí). Khí CO₂ thoát đi làm khối lượng chất rắn còn lại (CaO) nhẹ hơn ban đầu."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao không nên dùng dụng cụ bằng nhôm để đựng vôi, nước vôi hoặc vữa xây dựng?",
    "a": "Vì nhôm sẽ làm vôi bị khô.",
    "b": "Vì nhôm tác dụng được với dung dịch kiềm (nước vôi), làm dụng cụ bị ăn mòn và thủng.",
    "c": "Vì nhôm quá nặng.",
    "d": "Vì vôi sẽ dính chặt vào nhôm không rửa được.",
    "correct": "Vì nhôm tác dụng được với dung dịch kiềm (nước vôi), làm dụng cụ bị ăn mòn và thủng.",
    "explain": "Lớp màng oxit nhôm và kim loại nhôm đều tan được trong dung dịch kiềm (base) như Ca(OH)₂, làm hỏng dụng cụ."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Sự khác biệt cơ bản nhất về cấu trúc giữa 'Huyền phù' (như nước phù sa) và 'Dung dịch' (như nước muối) là gì?",
    "a": "Màu sắc.",
    "b": "Kích thước hạt chất tan. (Huyền phù chứa hạt rắn lớn lơ lửng, dung dịch chứa hạt kích thước phân tử/ion).",
    "c": "Trạng thái vật lý.",
    "d": "Nhiệt độ sôi.",
    "correct": "Kích thước hạt chất tan. (Huyền phù chứa hạt rắn lớn lơ lửng, dung dịch chứa hạt kích thước phân tử/ion).",
    "explain": "Dung dịch là hỗn hợp đồng nhất (kích thước hạt < 1nm). Huyền phù là hỗn hợp không đồng nhất (kích thước hạt lớn, lắng xuống khi để yên)."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao Hydrogen được coi là 'Nhiên liệu của tương lai' thay thế cho xăng dầu?",
    "a": "Vì nó có sẵn trong không khí.",
    "b": "Vì sản phẩm cháy của nó chỉ là nước (H₂O), không gây ô nhiễm môi trường và năng suất tỏa nhiệt rất cao.",
    "c": "Vì nó rẻ tiền và dễ khai thác.",
    "d": "Vì nó an toàn hơn xăng dầu.",
    "correct": "Vì sản phẩm cháy của nó chỉ là nước (H₂O), không gây ô nhiễm môi trường và năng suất tỏa nhiệt rất cao.",
    "explain": "Hydrogen là nhiên liệu sạch (Zero emission) và hiệu suất năng lượng cao gấp 3 lần xăng. Tuy nhiên khó khăn hiện tại là công nghệ lưu trữ."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Các ký hiệu nhựa số 1 (PET), số 5 (PP), số 6 (PS) dưới đáy chai lọ cho biết điều gì quan trọng nhất đối với người tiêu dùng?",
    "a": "Nơi sản xuất chai nhựa.",
    "b": "Khả năng chịu nhiệt và mức độ an toàn khi tái sử dụng hoặc đựng thực phẩm nóng.",
    "c": "Ngày hết hạn của nhựa.",
    "d": "Giá tiền của loại nhựa đó.",
    "correct": "Khả năng chịu nhiệt và mức độ an toàn khi tái sử dụng hoặc đựng thực phẩm nóng.",
    "explain": "Ví dụ: Số 1 (PET) chỉ dùng 1 lần, không chịu nhiệt. Số 5 (PP) chịu nhiệt tốt, dùng được trong lò vi sóng. Số 6 (PS) sinh độc tố ở nhiệt độ cao."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao khi xuống các hang sâu hoặc giếng cạn lâu ngày, người ta thường thả một ngọn nến xuống trước để kiểm tra?",
    "a": "Để soi sáng đáy giếng.",
    "b": "Để kiểm tra nồng độ khí Oxy và khí CO₂. Nếu nến tắt nghĩa là thiếu Oxy hoặc nhiều khí độc CO₂ nặng tích tụ, người xuống sẽ chết ngạt.",
    "c": "Để đốt cháy khí độc.",
    "d": "Để đo độ sâu của giếng.",
    "correct": "Để kiểm tra nồng độ khí Oxy và khí CO₂. Nếu nến tắt nghĩa là thiếu Oxy hoặc nhiều khí độc CO₂ nặng tích tụ, người xuống sẽ chết ngạt.",
    "explain": "CO₂ nặng hơn không khí nên tích tụ ở đáy giếng/hang. Nó không duy trì sự cháy và sự hô hấp. Nến tắt là dấu hiệu nguy hiểm."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Quá trình nào sau đây thể hiện tính chất hóa học (sự biến đổi chất) chứ không phải tính chất vật lý?",
    "a": "Cồn để hở bị bay hơi.",
    "b": "Thanh sắt bị nam châm hút.",
    "c": "Sữa tươi để lâu bị chua và đông tụ.",
    "d": "Bóng đèn dây tóc phát sáng khi có điện.",
    "correct": "Sữa tươi để lâu bị chua và đông tụ.",
    "explain": "Sữa chua là do vi khuẩn lên men biến đường lactose thành axit lactic (chất mới). Các phương án khác chỉ là thay đổi trạng thái hoặc tương tác vật lý."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao người ta dùng khí Acetylene (C₂H₂) hoặc Hydrogen trong đèn xì để hàn cắt kim loại?",
    "a": "Vì các khí này cháy tỏa nhiệt cực lớn (lên tới 3000°C), đủ sức làm nóng chảy kim loại.",
    "b": "Vì các khí này làm kim loại cứng hơn.",
    "c": "Vì các khí này có màu sáng chói.",
    "d": "Vì các khí này phản ứng với kim loại tạo mối hàn.",
    "correct": "Vì các khí này cháy tỏa nhiệt cực lớn (lên tới 3000°C), đủ sức làm nóng chảy kim loại.",
    "explain": "Phản ứng cháy của Acetylene với Oxy tỏa nhiệt lượng rất cao, tạo ra ngọn lửa Oxy-Acetylene dùng để hàn/cắt."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao trong các máy lọc nước gia đình thường có một lõi lọc chứa Than hoạt tính?",
    "a": "Để làm nước ngọt hơn.",
    "b": "Để hấp phụ các chất độc, chất hữu cơ, khí Clo và mùi lạ trong nước nhờ cấu trúc xốp rỗng đặc biệt.",
    "c": "Để tiêu diệt virus.",
    "d": "Để bổ sung khoáng chất than cho cơ thể.",
    "correct": "Để hấp phụ các chất độc, chất hữu cơ, khí Clo và mùi lạ trong nước nhờ cấu trúc xốp rỗng đặc biệt.",
    "explain": "Than hoạt tính có diện tích bề mặt cực lớn, có khả năng 'giữ lại' (hấp phụ) các phân tử chất bẩn và độc tố trên bề mặt của nó."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao khi muốn tách dầu ăn ra khỏi nước, người ta dùng phương pháp chiết (dùng phễu chiết) mà không dùng phương pháp lọc hay cô cạn?",
    "a": "Vì dầu ăn có nhiệt độ sôi cao hơn nước.",
    "b": "Vì dầu ăn nhẹ hơn nước và không tan trong nước, tạo thành hai lớp chất lỏng riêng biệt dễ dàng tách ra bằng phễu chiết.",
    "c": "Vì dầu ăn làm tắc giấy lọc.",
    "d": "Vì cô cạn sẽ làm dầu ăn bị cháy.",
    "correct": "Vì dầu ăn nhẹ hơn nước và không tan trong nước, tạo thành hai lớp chất lỏng riêng biệt dễ dàng tách ra bằng phễu chiết.",
    "explain": "Phương pháp chiết dựa trên sự khác nhau về khối lượng riêng và tính tan (không hòa tan vào nhau) của hai chất lỏng."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Hiện tượng 'Hiệu ứng Tyndall' (khi chiếu đèn pin qua cốc nước pha sữa thấy vệt sáng) dùng để phân biệt loại hỗn hợp nào?",
    "a": "Phân biệt Dung dịch và Chất tinh khiết.",
    "b": "Phân biệt Dung dịch và Huyền phù/Keo (Colloid).",
    "c": "Phân biệt Nước và Dầu.",
    "d": "Phân biệt Chất rắn và Chất khí.",
    "correct": "Phân biệt Dung dịch và Huyền phù/Keo (Colloid).",
    "explain": "Dung dịch thật đồng nhất không tán xạ ánh sáng. Huyền phù hoặc hệ keo chứa các hạt lơ lửng đủ lớn để tán xạ ánh sáng tạo thành vệt sáng (Tyndall)."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Để làm sạch nước đục (nước phù sa) thành nước trong, người ta thường đánh 'Phèn chua'. Cơ chế hoạt động của phèn chua là gì?",
    "a": "Phèn chua tiêu diệt vi khuẩn làm nước trong.",
    "b": "Phèn chua tạo ra chất kết dính (keo tụ), kéo các hạt bụi lơ lửng kết lại thành bông cặn lớn và lắng xuống đáy.",
    "c": "Phèn chua làm bay hơi các tạp chất.",
    "d": "Phèn chua ăn mòn các hạt đất.",
    "correct": "Phèn chua tạo ra chất kết dính (keo tụ), kéo các hạt bụi lơ lửng kết lại thành bông cặn lớn và lắng xuống đáy.",
    "explain": "Đây là quá trình keo tụ và tạo bông. Các hạt cặn nhỏ lơ lửng rất khó lắng, phèn chua giúp chúng dính lại thành hạt lớn nặng hơn để lắng nhanh."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao muối ăn (NaCl) khai thác từ nước biển thường bị chảy nước (ẩm ướt) khi để ngoài không khí, trong khi muối tinh khiết thì không?",
    "a": "Vì muối ăn hấp thụ ánh sáng.",
    "b": "Vì trong muối biển có lẫn tạp chất (như Magie clorua) có tính hút ẩm mạnh từ không khí.",
    "c": "Vì muối ăn phản ứng với Oxy.",
    "d": "Vì muối biển lạnh hơn.",
    "correct": "Vì trong muối biển có lẫn tạp chất (như Magie clorua) có tính hút ẩm mạnh từ không khí.",
    "explain": "Bản thân NaCl tinh khiết ít hút ẩm. Tạp chất MgCl₂ hay CaCl₂ có trong muối thô mới là nguyên nhân chính gây hiện tượng chảy nước."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao xăng sinh học E5 (chứa 5% Etanol cồn) được khuyến khích sử dụng hơn xăng truyền thống?",
    "a": "Vì nó giúp động cơ chạy nhanh hơn gấp đôi.",
    "b": "Vì nó giảm sự phụ thuộc vào dầu mỏ, cháy sạch hơn và giảm lượng khí thải độc hại (CO, HC) ra môi trường.",
    "c": "Vì nó không bao giờ gây cháy nổ.",
    "d": "Vì nó có mùi thơm dễ chịu.",
    "correct": "Vì nó giảm sự phụ thuộc vào dầu mỏ, cháy sạch hơn và giảm lượng khí thải độc hại (CO, HC) ra môi trường.",
    "explain": "Etanol là nhiên liệu tái tạo (từ thực vật). Pha trộn vào xăng giúp giảm tiêu thụ nhiên liệu hóa thạch và giảm ô nhiễm không khí."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Nếu vô tình làm vỡ nhiệt kế thủy ngân trong phòng, hành động nào sau đây là TUYỆT ĐỐI CẤM?",
    "a": "Mở cửa sổ để thông gió.",
    "b": "Dùng máy hút bụi để hút thủy ngân.",
    "c": "Rắc bột lưu huỳnh lên chỗ thủy ngân rơi vãi.",
    "d": "Đeo găng tay thu gom thủy ngân bằng bìa cứng.",
    "correct": "Dùng máy hút bụi để hút thủy ngân.",
    "explain": "Máy hút bụi sẽ làm thủy ngân bay hơi nhanh hơn và phát tán hơi độc ra khắp phòng qua quạt gió, gây ngộ độc phổi nghiêm trọng."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao khí cầu bay bằng khí Helium an toàn hơn khí Hydrogen, mặc dù Hydrogen nhẹ hơn (tạo lực nâng tốt hơn)?",
    "a": "Vì Helium rẻ hơn.",
    "b": "Vì Helium là khí trơ (khí hiếm), không cháy nổ. Còn Hydrogen cực kỳ dễ gây nổ lớn khi gặp tia lửa.",
    "c": "Vì Helium có màu đẹp hơn.",
    "d": "Vì Helium dễ chế tạo hơn.",
    "correct": "Vì Helium là khí trơ (khí hiếm), không cháy nổ. Còn Hydrogen cực kỳ dễ gây nổ lớn khi gặp tia lửa.",
    "explain": "An toàn là ưu tiên hàng đầu. Vụ nổ tàu khí cầu Hindenburg là bài học lịch sử về sự nguy hiểm của Hydrogen."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Trong quá trình sản xuất muối, những ngày nắng to và có gió thì thu hoạch được nhiều muối hơn. Yếu tố nào đã làm tăng tốc độ quá trình này?",
    "a": "Nhiệt độ và gió làm tăng tốc độ bay hơi của nước.",
    "b": "Nắng làm muối kết tinh nhanh hơn từ nước.",
    "c": "Gió thổi cát bay đi để lại muối.",
    "d": "Nhiệt độ làm nước biển mặn hơn.",
    "correct": "Nhiệt độ và gió làm tăng tốc độ bay hơi của nước.",
    "explain": "Tốc độ bay hơi phụ thuộc vào: Nhiệt độ (càng cao càng nhanh), Gió (càng mạnh càng nhanh) và Diện tích mặt thoáng."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao đồ dùng bằng Bạc (Ag) để lâu ngày trong không khí thường bị xỉn màu đen?",
    "a": "Do bám bụi bẩn không rửa sạch.",
    "b": "Do Bạc phản ứng với khí Hydrogen Sulfide (H₂S) có trong không khí tạo thành Bạc Sulfide (Ag₂S) màu đen.",
    "c": "Do Bạc bị gỉ giống như sắt.",
    "d": "Do ánh sáng làm cháy bề mặt bạc.",
    "correct": "Do Bạc phản ứng với khí Hydrogen Sulfide (H₂S) có trong không khí tạo thành Bạc Sulfide (Ag₂S) màu đen.",
    "explain": "Dù Bạc kém hoạt động, nhưng nó rất nhạy cảm với hợp chất lưu huỳnh (có trong không khí ô nhiễm hoặc tuyến mồ hôi), tạo lớp màng đen."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Khi luộc rau muống, nếu vắt chanh vào nước luộc thì nước rau sẽ chuyển từ màu xanh sang màu đỏ nhạt hoặc vàng trong. Đây là hiện tượng gì?",
    "a": "Hiện tượng vật lý do màu chanh hòa vào.",
    "b": "Hiện tượng hóa học: Chất diệp lục/chất màu trong rau thay đổi cấu trúc khi gặp môi trường Axit (nước chanh).",
    "c": "Hiện tượng rau bị chín quá.",
    "d": "Hiện tượng kết tủa.",
    "correct": "Hiện tượng hóa học: Chất diệp lục/chất màu trong rau thay đổi cấu trúc khi gặp môi trường Axit (nước chanh).",
    "explain": "Nước rau muống chứa chất chỉ thị màu tự nhiên. Môi trường kiềm (nước cứng) giữ màu xanh, môi trường axit (chanh) làm đổi màu."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Cát (Silic dioxit) là nguyên liệu chính để sản xuất vật liệu nào sau đây?",
    "a": "Nhựa PVC.",
    "b": "Thủy tinh.",
    "c": "Cao su.",
    "d": "Giấy.",
    "correct": "Thủy tinh.",
    "explain": "Nấu chảy cát trắng cùng với đá vôi và soda ở nhiệt độ cao tạo ra thủy tinh."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao không thể dập tắt đám cháy Magie (Mg) bằng cát ẩm hoặc nước?",
    "a": "Vì cát ẩm chứa nước, Magie cháy ở nhiệt độ cao sẽ tách Oxy từ nước để cháy tiếp và sinh ra khí Hydro gây nổ.",
    "b": "Vì cát làm Magie nóng hơn.",
    "c": "Vì nước làm trôi Magie đi nơi khác.",
    "d": "Vì Magie thích nước.",
    "correct": "Vì cát ẩm chứa nước, Magie cháy ở nhiệt độ cao sẽ tách Oxy từ nước để cháy tiếp và sinh ra khí Hydro gây nổ.",
    "explain": "Mg + H₂O (nhiệt độ cao) -> MgO + H₂. Khí Hydro sinh ra kết hợp với Oxy không khí gây nổ. Phải dùng cát khô hoàn toàn để dập."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Để bảo quản thực phẩm bằng phương pháp 'muối chua' (dưa muối, kim chi), yếu tố nào ức chế vi khuẩn gây thối?",
    "a": "Độ mặn của muối và độ axit (chua) do quá trình lên men lactic tạo ra.",
    "b": "Màu sắc của thực phẩm.",
    "c": "Nhiệt độ cao khi muối.",
    "d": "Việc đậy nắp kín.",
    "correct": "Độ mặn của muối và độ axit (chua) do quá trình lên men lactic tạo ra.",
    "explain": "Môi trường ưu trương (muối) làm vi khuẩn mất nước, cộng với môi trường axit (pH thấp) ức chế sự phát triển của vi khuẩn gây hại."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao dây tóc bóng đèn sợi đốt thường làm bằng kim loại Vonfram (Tungsten)?",
    "a": "Vì Vonfram dẫn điện tốt nhất.",
    "b": "Vì Vonfram có nhiệt độ nóng chảy rất cao (hơn 3000°C), không bị chảy hay đứt khi nung nóng phát sáng.",
    "c": "Vì Vonfram rẻ tiền.",
    "d": "Vì Vonfram có màu sáng trắng.",
    "correct": "Vì Vonfram có nhiệt độ nóng chảy rất cao (hơn 3000°C), không bị chảy hay đứt khi nung nóng phát sáng.",
    "explain": "Bóng đèn hoạt động dựa trên nguyên lý nung nóng dây dẫn đến phát sáng. Các kim loại khác sẽ nóng chảy ngay lập tức ở nhiệt độ này."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Khí Ozone (O₃) trên tầng bình lưu bảo vệ Trái Đất khỏi tia cực tím. Tuy nhiên, nếu khí Ozone xuất hiện ở mặt đất (do ô nhiễm khói bụi xe cộ), nó được coi là:",
    "a": "Chất làm sạch không khí.",
    "b": "Chất khí độc hại gây bệnh hô hấp và kích ứng mắt.",
    "c": "Chất giúp cây xanh quang hợp tốt hơn.",
    "d": "Chất làm mát không khí.",
    "correct": "Chất khí độc hại gây bệnh hô hấp và kích ứng mắt.",
    "explain": "Ozone là chất oxy hóa cực mạnh. Ở tầng cao nó chắn tia UV, nhưng ở mặt đất nó tấn công mô phổi và hệ hô hấp của con người."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Khi nung nóng đường kính trắng, đường chuyển sang màu nâu đen và có mùi khét. Đây là hiện tượng gì?",
    "a": "Đường bị nóng chảy (Vật lý).",
    "b": "Đường bị phân hủy thành than và hơi nước (Hóa học).",
    "c": "Đường bay hơi.",
    "d": "Đường kết tinh lại.",
    "correct": "Đường bị phân hủy thành than và hơi nước (Hóa học).",
    "explain": "Đường (C₁₂H₂₂O₁₁) khi bị nhiệt phân sẽ tách nước, còn lại Carbon (than) màu đen. Chất mới (than) đã được tạo thành."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao nước mưa tự nhiên (ngay cả khi không ô nhiễm) vẫn có tính axit nhẹ (pH khoảng 5.6)?",
    "a": "Do nước mưa hòa tan khí Carbon dioxide (CO₂) trong không khí tạo thành axit carbonic yếu.",
    "b": "Do nước mưa bị bẩn.",
    "c": "Do nước mưa chứa vi khuẩn.",
    "d": "Do sét đánh tạo ra axit.",
    "correct": "Do nước mưa hòa tan khí Carbon dioxide (CO₂) trong không khí tạo thành axit carbonic yếu.",
    "explain": "CO₂ + H₂O ⇌ H₂CO₃. Đây là hiện tượng tự nhiên. Mưa axit do ô nhiễm (SO₂, NOx) có pH thấp hơn nhiều (< 5.0)."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Để dập tắt đám cháy nhỏ trong phòng thí nghiệm (ví dụ cồn cháy trên bàn), dùng chăn chiên ướt trùm lên là áp dụng nguyên lý nào của Tam giác lửa?",
    "a": "Loại bỏ chất cháy.",
    "b": "Cách ly Oxygen và giảm nhiệt độ đám cháy.",
    "c": "Tăng nồng độ CO₂.",
    "d": "Làm ướt chất cháy.",
    "correct": "Cách ly Oxygen và giảm nhiệt độ đám cháy.",
    "explain": "Chăn ngăn không khí (Oxy) tiếp xúc với ngọn lửa, đồng thời nước trong chăn thu nhiệt làm giảm nhiệt độ dưới điểm cháy."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao Vàng tây (hợp kim Vàng - Đồng/Bạc) lại cứng hơn Vàng ta (Vàng nguyên chất 99.99%)?",
    "a": "Vì Đồng cứng hơn Vàng.",
    "b": "Vì cấu trúc tinh thể hợp kim bị xô lệch ngăn cản sự trượt của các lớp nguyên tử.",
    "c": "Vì Vàng tây nặng hơn.",
    "d": "Vì Vàng tây được nung nóng lâu hơn.",
    "correct": "Vì cấu trúc tinh thể hợp kim bị xô lệch ngăn cản sự trượt của các lớp nguyên tử.",
    "explain": "Nguyên tắc chung của hợp kim: Sự pha trộn các nguyên tử kích thước khác nhau làm tăng độ cứng so với kim loại nền nguyên chất."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao không thể dùng phương pháp Lọc để tách muối ăn ra khỏi nước muối?",
    "a": "Vì hạt muối quá nhỏ, nhỏ hơn kích thước lỗ của giấy lọc nên sẽ chui qua cùng với nước.",
    "b": "Vì muối làm rách giấy lọc.",
    "c": "Vì muối dính vào giấy lọc.",
    "d": "Vì nước muối quá đặc.",
    "correct": "Vì hạt muối quá nhỏ, nhỏ hơn kích thước lỗ của giấy lọc nên sẽ chui qua cùng với nước.",
    "explain": "Lọc chỉ giữ lại chất rắn không tan (huyền phù). Muối tan trong nước tạo thành dung dịch (kích thước ion/phân tử) nên đi qua giấy lọc dễ dàng."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao sơn chống gỉ lại bảo vệ được sắt thép?",
    "a": "Vì sơn làm cho sắt cứng hơn.",
    "b": "Vì sơn tạo lớp màng ngăn cách cơ học, không cho sắt tiếp xúc với Oxy và Hơi nước - hai tác nhân gây gỉ.",
    "c": "Vì sơn phản ứng với sắt tạo chất bền.",
    "d": "Vì sơn hút hết ẩm.",
    "correct": "Vì sơn tạo lớp màng ngăn cách cơ học, không cho sắt tiếp xúc với Oxy và Hơi nước - hai tác nhân gây gỉ.",
    "explain": "Nguyên lý bảo vệ: Cách ly kim loại với môi trường ăn mòn."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Trong sản xuất Nông nghiệp, việc đốt rơm rạ sau mùa gặt gây tác hại gì lớn nhất về mặt hóa học môi trường?",
    "a": "Làm nóng đất.",
    "b": "Sinh ra nhiều khói bụi mịn và khí độc (CO, CO₂, NOx) gây hiệu ứng nhà kính và ô nhiễm không khí nghiêm trọng.",
    "c": "Làm chết vi sinh vật trong đất.",
    "d": "Lãng phí nguồn phân bón.",
    "correct": "Sinh ra nhiều khói bụi mịn và khí độc (CO, CO₂, NOx) gây hiệu ứng nhà kính và ô nhiễm không khí nghiêm trọng.",
    "explain": "Đốt cháy sinh khối không hoàn toàn tạo ra lượng lớn khí thải độc hại và bụi mịn PM2.5 ảnh hưởng sức khỏe cộng đồng."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao bình chứa khí Oxy y tế thường được sơn màu xanh, còn bình khí Gas (nhiên liệu) thường sơn màu hồng/đỏ/vàng?",
    "a": "Để cho đẹp.",
    "b": "Để phân biệt loại khí chứa bên trong theo quy chuẩn an toàn, tránh nhầm lẫn gây tai nạn cháy nổ.",
    "c": "Để phản xạ ánh sáng.",
    "d": "Do sở thích của nhà sản xuất.",
    "correct": "Để phân biệt loại khí chứa bên trong theo quy chuẩn an toàn, tránh nhầm lẫn gây tai nạn cháy nổ.",
    "explain": "Màu sắc vỏ bình khí nén được quy định nghiêm ngặt để nhận biết nhanh chóng tính chất khí (Oxy là chất duy trì sự cháy, Gas là chất cháy)."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Vì sao khi mở nắp chai nước ngọt có ga (Soda) lại nghe tiếng 'xì' và bọt khí trào ra?",
    "a": "Do nước ngọt bị hỏng.",
    "b": "Do áp suất trong chai giảm đột ngột, độ tan của khí CO₂ giảm đi, làm khí CO₂ thoát ra ồ ạt.",
    "c": "Do nhiệt độ tăng lên.",
    "d": "Do chai bị lắc.",
    "correct": "Do áp suất trong chai giảm đột ngột, độ tan của khí CO₂ giảm đi, làm khí CO₂ thoát ra ồ ạt.",
    "explain": "Độ tan của chất khí tỉ lệ thuận với áp suất. Đóng nắp (áp suất cao) khí tan nhiều. Mở nắp (áp suất giảm) khí không tan được nữa nên thoát ra."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao các thiết bị điện tử (như máy tính, điện thoại) chứa nhiều Vàng và Bạc trong vi mạch nhưng việc tái chế chúng lại rất khó khăn và độc hại?",
    "a": "Vì lượng vàng quá ít không bõ công.",
    "b": "Vì kim loại quý bị trộn lẫn phức tạp với nhựa và các kim loại nặng độc hại (Chì, Thủy ngân), cần quy trình hóa học phức tạp để tách chiết.",
    "c": "Vì nhựa dính chặt vào vàng.",
    "d": "Vì vàng trong máy tính là vàng giả.",
    "correct": "Vì kim loại quý bị trộn lẫn phức tạp với nhựa và các kim loại nặng độc hại (Chì, Thủy ngân), cần quy trình hóa học phức tạp để tách chiết.",
    "explain": "Rác thải điện tử (E-waste) là vấn đề lớn vì quá trình đốt/tách kim loại thường giải phóng chất độc dioxin và kim loại nặng ra môi trường."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Nước cứng (chứa nhiều Canxi, Magie) gây tác hại gì khi đun sôi?",
    "a": "Làm nước lâu sôi hơn.",
    "b": "Tạo lớp cặn đá vôi (cáu cặn) bám vào đáy ấm, làm giảm khả năng dẫn nhiệt và tốn nhiên liệu, nhanh hỏng thiết bị.",
    "c": "Làm nước có mùi hôi.",
    "d": "Làm nước bay hơi nhanh hơn.",
    "correct": "Tạo lớp cặn đá vôi (cáu cặn) bám vào đáy ấm, làm giảm khả năng dẫn nhiệt và tốn nhiên liệu, nhanh hỏng thiết bị.",
    "explain": "Nhiệt phân muối hidrocacbonat trong nước cứng tạo kết tủa CaCO₃ bám chặt vào thành ấm, cách nhiệt làm tốn điện/gas."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao một số loại nhựa (như PVC) khi đốt cháy lại sinh ra khói đen độc hại và mùi khét lẹt?",
    "a": "Vì nhựa làm từ than đá.",
    "b": "Vì quá trình cháy không hoàn toàn sinh ra muội than và các khí độc gốc Clo (như HCl, Dioxin).",
    "c": "Vì nhựa chứa nhiều nước.",
    "d": "Vì nhựa không cháy được.",
    "correct": "Vì quá trình cháy không hoàn toàn sinh ra muội than và các khí độc gốc Clo (như HCl, Dioxin).",
    "explain": "PVC (Polyvinyl Clorua) chứa Clo. Khi đốt cháy sinh ra axit HCl ăn mòn và Dioxin cực độc."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Để chứng minh trong hơi thở của chúng ta có khí Carbon dioxide (CO₂), ta thổi hơi vào cốc đựng nước vôi trong. Hiện tượng quan sát được là gì?",
    "a": "Nước vôi chuyển sang màu xanh.",
    "b": "Nước vôi nóng lên.",
    "c": "Nước vôi bị vẩn đục (xuất hiện kết tủa trắng).",
    "d": "Không có hiện tượng gì.",
    "correct": "Nước vôi bị vẩn đục (xuất hiện kết tủa trắng).",
    "explain": "Phản ứng đặc trưng: Ca(OH)₂ + CO₂ -> CaCO₃ (kết tủa trắng) + H₂O."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao Kim cương và Than chì đều được cấu tạo hoàn toàn từ nguyên tố Carbon nhưng tính chất vật lý lại trái ngược nhau (Kim cương siêu cứng, Than chì mềm)?",
    "a": "Vì Kim cương chứa Carbon tinh khiết hơn.",
    "b": "Vì cách sắp xếp các nguyên tử Carbon trong mạng tinh thể không gian khác nhau.",
    "c": "Vì Than chì bị lẫn tạp chất đất.",
    "d": "Vì Kim cương được nung nóng.",
    "correct": "Vì cách sắp xếp các nguyên tử Carbon trong mạng tinh thể không gian khác nhau.",
    "explain": "Đây là hiện tượng thù hình. Cấu trúc tinh thể quyết định tính chất. Kim cương có cấu trúc tứ diện đều bền vững, than chì cấu trúc lớp trượt lên nhau."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Nếu không may bị axit dính vào tay, bước sơ cứu đầu tiên và quan trọng nhất là gì?",
    "a": "Bôi ngay kem đánh răng vào.",
    "b": "Rửa liên tục dưới vòi nước sạch chảy nhẹ ít nhất 15-20 phút để làm loãng và trôi bớt axit.",
    "c": "Băng kín vết thương lại.",
    "d": "Ngâm tay vào nước đá.",
    "correct": "Rửa liên tục dưới vòi nước sạch chảy nhẹ ít nhất 15-20 phút để làm loãng và trôi bớt axit.",
    "explain": "Nước chảy giúp tản nhiệt (do axit hòa tan tỏa nhiệt) và giảm nồng độ axit nhanh chóng. Không được trung hòa bằng bazơ ngay vì phản ứng sinh nhiệt gây bỏng thêm."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao đường ray tàu hỏa không bao giờ được hàn liền mạch thành một thanh dài vô tận mà luôn có các khe hở?",
    "a": "Để tiết kiệm sắt.",
    "b": "Để tạo không gian cho sự giãn nở vì nhiệt của kim loại khi trời nóng, tránh làm cong vênh đường ray gây tai nạn.",
    "c": "Để nước mưa thoát đi nhanh hơn.",
    "d": "Để giảm tiếng ồn khi tàu chạy.",
    "correct": "Để tạo không gian cho sự giãn nở vì nhiệt của kim loại khi trời nóng, tránh làm cong vênh đường ray gây tai nạn.",
    "explain": "Chất rắn (sắt thép) giãn nở khi nhiệt độ tăng. Lực giãn nở rất lớn, nếu không có khe hở (khe nhiệt) để 'thở', đường ray sẽ bị uốn cong phá hủy cấu trúc."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Phương pháp sắc ký giấy (Paper Chromatography) dùng để làm gì trong thí nghiệm hóa học vui?",
    "a": "Để đo độ pH của dung dịch.",
    "b": "Để tách các thành phần màu sắc khác nhau trong một hỗn hợp mực viết hoặc phẩm nhuộm dựa trên tốc độ di chuyển khác nhau của chúng trên giấy.",
    "c": "Để làm khô giấy.",
    "d": "Để kiểm tra độ bền của giấy.",
    "correct": "Để tách các thành phần màu sắc khác nhau trong một hỗn hợp mực viết hoặc phẩm nhuộm dựa trên tốc độ di chuyển khác nhau của chúng trên giấy.",
    "explain": "Mỗi chất màu có khả năng tan trong dung môi và bám vào giấy khác nhau, nên chúng sẽ di chuyển với tốc độ khác nhau, tạo thành các vệt màu riêng biệt."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao xà phòng và chất tẩy rửa có thể làm sạch dầu mỡ bám trên bát đĩa, trong khi nước thường không làm được?",
    "a": "Vì xà phòng có tính axit mạnh ăn mòn dầu mỡ.",
    "b": "Vì phân tử xà phòng có hai đầu: một đầu ưa nước và một đầu ưa dầu. Đầu ưa dầu bám vào vết bẩn, đầu ưa nước kéo vết bẩn ra khỏi bề mặt bát đĩa vào nước.",
    "c": "Vì xà phòng làm nóng dầu mỡ.",
    "d": "Vì xà phòng biến dầu mỡ thành khí.",
    "correct": "Vì phân tử xà phòng có hai đầu: một đầu ưa nước và một đầu ưa dầu. Đầu ưa dầu bám vào vết bẩn, đầu ưa nước kéo vết bẩn ra khỏi bề mặt bát đĩa vào nước.",
    "explain": "Đây là cơ chế hoạt động của chất hoạt động bề mặt. Nước và dầu không tan vào nhau, xà phòng đóng vai trò cầu nối để hòa tan dầu vào nước."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Khi ướp đường vào trái cây (như làm sấu ngâm, mơ ngâm), sau một thời gian thấy trái cây teo lại và nước trong bình nhiều lên. Đây là hiện tượng gì?",
    "a": "Hiện tượng bay hơi.",
    "b": "Hiện tượng thẩm thấu: Nước từ trong tế bào trái cây đi ra ngoài môi trường đường ưu trương (nồng độ cao) để cân bằng nồng độ.",
    "c": "Hiện tượng đường tan chảy thành nước.",
    "d": "Hiện tượng trái cây hô hấp.",
    "correct": "Hiện tượng thẩm thấu: Nước từ trong tế bào trái cây đi ra ngoài môi trường đường ưu trương (nồng độ cao) để cân bằng nồng độ.",
    "explain": "Nước luôn di chuyển từ nơi có nồng độ chất tan thấp sang nơi có nồng độ chất tan cao (đường) qua màng tế bào, làm trái cây mất nước (teo lại)."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao không nên dùng nồi nhôm để nấu canh chua hoặc đựng dưa muối lâu ngày?",
    "a": "Vì nồi nhôm sẽ bị đen.",
    "b": "Vì axit trong canh chua/dưa muối sẽ phản ứng hóa học ăn mòn lớp oxit nhôm bảo vệ, sau đó hòa tan nhôm vào thức ăn gây hại sức khỏe.",
    "c": "Vì thức ăn sẽ bị mặn hơn.",
    "d": "Vì nồi nhôm dẫn nhiệt kém.",
    "correct": "Vì axit trong canh chua/dưa muối sẽ phản ứng hóa học ăn mòn lớp oxit nhôm bảo vệ, sau đó hòa tan nhôm vào thức ăn gây hại sức khỏe.",
    "explain": "Nhôm là kim loại lưỡng tính, dễ bị ăn mòn trong môi trường axit hoặc kiềm, giải phóng ion Al³⁺ vào thực phẩm."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Trong các hang động đá vôi (như Phong Nha - Kẻ Bàng), thạch nhũ được hình thành như thế nào?",
    "a": "Do nước mưa làm xói mòn đá.",
    "b": "Do sự kết tủa lại của Canxi cacbonat (CaCO₃) từ nước chảy qua khe đá chứa Canxi hidrocacbonat khi gặp không khí hoặc thay đổi áp suất.",
    "c": "Do đá vôi bị nung nóng chảy.",
    "d": "Do kiến trúc sư xây dựng.",
    "correct": "Do sự kết tủa lại của Canxi cacbonat (CaCO₃) từ nước chảy qua khe đá chứa Canxi hidrocacbonat khi gặp không khí hoặc thay đổi áp suất.",
    "explain": "Phản ứng thuận nghịch: Ca(HCO₃)₂ -> CaCO₃ (rắn - thạch nhũ) + CO₂ + H₂O. Quá trình này diễn ra hàng triệu năm."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao khinh khí cầu bơm khí nóng có thể bay lên được?",
    "a": "Vì khí nóng nhẹ hơn (khối lượng riêng nhỏ hơn) khí lạnh xung quanh, tạo ra lực đẩy Ác-si-mét lớn hơn trọng lượng khí cầu.",
    "b": "Vì khí nóng cháy tạo ra phản lực.",
    "c": "Vì khí nóng làm giãn nở vỏ khí cầu.",
    "d": "Vì khí nóng không chịu tác dụng của trọng lực.",
    "correct": "Vì khí nóng nhẹ hơn (khối lượng riêng nhỏ hơn) khí lạnh xung quanh, tạo ra lực đẩy Ác-si-mét lớn hơn trọng lượng khí cầu.",
    "explain": "Khi nung nóng, không khí giãn nở, mật độ thưa hơn (nhẹ hơn) so với không khí lạnh bên ngoài, giúp khí cầu nổi lên."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao khi bị kiến hoặc ong đốt (nọc độc thường có tính axit), người ta thường bôi vôi tôi hoặc kem đánh răng vào vết thương để giảm đau?",
    "a": "Để làm mát vết thương.",
    "b": "Để trung hòa axit trong nọc độc bằng bazơ (chất kiềm) có trong vôi/kem đánh răng, làm giảm tác dụng của nọc.",
    "c": "Để diệt vi khuẩn.",
    "d": "Để bịt kín vết thương.",
    "correct": "Để trung hòa axit trong nọc độc bằng bazơ (chất kiềm) có trong vôi/kem đánh răng, làm giảm tác dụng của nọc.",
    "explain": "Phản ứng trung hòa: Axit + Bazơ -> Muối + Nước. Việc trung hòa axit giúp giảm sưng tấy và đau nhức."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao nước cất (tinh khiết) không dẫn điện, nhưng nước máy hoặc nước mưa lại dẫn điện?",
    "a": "Vì nước cất quá sạch.",
    "b": "Vì nước máy/nước mưa có hòa tan các muối khoáng, axit, bazơ... tạo ra các ion tự do di chuyển được và dẫn điện.",
    "c": "Vì nước máy có áp suất cao.",
    "d": "Vì nước mưa lạnh hơn.",
    "correct": "Vì nước máy/nước mưa có hòa tan các muối khoáng, axit, bazơ... tạo ra các ion tự do di chuyển được và dẫn điện.",
    "explain": "Dòng điện trong chất lỏng là dòng chuyển dời có hướng của các ion. Nước cất chỉ gồm phân tử H₂O trung hòa nên không dẫn điện."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Để dập tắt đám cháy do chập điện trong phòng server máy tính, loại bình chữa cháy nào là lựa chọn an toàn nhất để không làm hỏng thiết bị điện tử?",
    "a": "Bình chữa cháy dạng bọt (Foam).",
    "b": "Nước.",
    "c": "Bình khí CO₂.",
    "d": "Cát.",
    "correct": "Bình khí CO₂.",
    "explain": "Khí CO₂ dập tắt lửa sau đó bay hơi hoàn toàn, không để lại cặn bẩn hay nước làm hỏng mạch điện tử như bọt, nước hay cát."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao khi mở chai nước hoa ở đầu lớp, một lát sau người ở cuối lớp cũng ngửi thấy mùi thơm?",
    "a": "Do gió thổi.",
    "b": "Do sự khuếch tán: Các phân tử nước hoa chuyển động hỗn loạn không ngừng và len lỏi vào khoảng cách giữa các phân tử không khí lan tỏa đi khắp nơi.",
    "c": "Do mùi thơm nặng hơn không khí.",
    "d": "Do phản ứng hóa học.",
    "correct": "Do sự khuếch tán: Các phân tử nước hoa chuyển động hỗn loạn không ngừng và len lỏi vào khoảng cách giữa các phân tử không khí lan tỏa đi khắp nơi.",
    "explain": "Đây là hiện tượng khuếch tán chất khí, chứng tỏ vật chất được cấu tạo từ các hạt riêng biệt luôn chuyển động."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao 'Băng phiến' (Long não) để trong tủ quần áo lại biến mất dần mà không để lại vết ướt?",
    "a": "Vì nó bị gián ăn.",
    "b": "Vì xảy ra sự thăng hoa: Chất rắn chuyển trực tiếp sang thể hơi (khí) mà không qua thể lỏng.",
    "c": "Vì nó tan chảy thấm vào quần áo.",
    "d": "Vì nó bị oxi hóa.",
    "correct": "Vì xảy ra sự thăng hoa: Chất rắn chuyển trực tiếp sang thể hơi (khí) mà không qua thể lỏng.",
    "explain": "Một số chất như Băng phiến, I-ốt, Đá khô có khả năng thăng hoa ở điều kiện thường."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Khi ủ cơm rượu, người ta rắc men vào cơm nếp đã nấu chín và để nơi ấm. Quá trình này thực chất là gì?",
    "a": "Sự bay hơi của nước cơm.",
    "b": "Sự lên men rượu: Nấm men chuyển hóa tinh bột thành đường, rồi từ đường thành rượu Etanol và khí CO₂.",
    "c": "Sự oxi hóa cơm nếp.",
    "d": "Sự đông đặc của cơm.",
    "correct": "Sự lên men rượu: Nấm men chuyển hóa tinh bột thành đường, rồi từ đường thành rượu Etanol và khí CO₂.",
    "explain": "Đây là phản ứng hóa sinh học. Men rượu đóng vai trò là chất xúc tác sinh học cho quá trình chuyển hóa này."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao không nên để nhiều cây xanh trong phòng ngủ đóng kín vào ban đêm?",
    "a": "Vì cây xanh thải ra nhiều nhiệt làm nóng phòng.",
    "b": "Vì ban đêm không có ánh sáng, cây ngừng quang hợp nhưng vẫn hô hấp: Hấp thụ khí Oxy và thải ra khí CO₂, làm người ngủ bị thiếu Oxy, mệt mỏi.",
    "c": "Vì cây xanh thu hút ma quỷ.",
    "d": "Vì cây xanh thải ra khí độc vào ban đêm.",
    "correct": "Vì ban đêm không có ánh sáng, cây ngừng quang hợp nhưng vẫn hô hấp: Hấp thụ khí Oxy và thải ra khí CO₂, làm người ngủ bị thiếu Oxy, mệt mỏi.",
    "explain": "Quang hợp (nhả Oxy) chỉ diễn ra khi có ánh sáng. Hô hấp (lấy Oxy) diễn ra suốt ngày đêm. Ban đêm trong phòng kín, cây cạnh tranh Oxy với người."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao khi đun nước bằng ấm nhôm, lớp cặn vôi (cáu cặn) dưới đáy ấm lại giúp bảo vệ ấm không bị thủng, nhưng lại làm tốn gas?",
    "a": "Lớp cặn dẫn nhiệt tốt.",
    "b": "Lớp cặn ngăn nhôm tiếp xúc với nước nóng nhưng lại cách nhiệt, làm nhiệt từ bếp truyền vào nước khó khăn hơn.",
    "c": "Lớp cặn làm nước sôi nhanh hơn.",
    "d": "Lớp cặn phản ứng với nhôm.",
    "correct": "Lớp cặn ngăn nhôm tiếp xúc với nước nóng nhưng lại cách nhiệt, làm nhiệt từ bếp truyền vào nước khó khăn hơn.",
    "explain": "Cặn đá vôi (CaCO₃) dẫn nhiệt kém (cách nhiệt). Nhiệt bị giữ lại ở đáy ấm làm đáy ấm rất nóng (dễ hỏng) nhưng nước bên trong lại lâu sôi."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Trong công nghiệp, khí Nitơ (N₂) thường được dùng để bơm vào gói bim bim (snack). Mục đích chính là gì?",
    "a": "Để gói bim bim trông to hơn, bắt mắt hơn.",
    "b": "Để tạo môi trường khí trơ, đẩy hết khí Oxy ra ngoài, ngăn chặn quá trình oxi hóa làm ỉu và hỏng thực phẩm, đồng thời chống vỡ vụn khi vận chuyển.",
    "c": "Để làm lạnh bim bim.",
    "d": "Để tăng hương vị.",
    "correct": "Để tạo môi trường khí trơ, đẩy hết khí Oxy ra ngoài, ngăn chặn quá trình oxi hóa làm ỉu và hỏng thực phẩm, đồng thời chống vỡ vụn khi vận chuyển.",
    "explain": "Nitơ là khí trơ, rẻ tiền, không phản ứng với thực phẩm, giúp bảo quản độ giòn và hương vị."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Khi cho một viên C sủi (Vitamin C) vào nước, thấy sủi bọt khí rất mạnh. Khí đó là gì và sinh ra từ đâu?",
    "a": "Khí Oxy từ nước.",
    "b": "Khí Carbon dioxide (CO₂) sinh ra do phản ứng giữa axit hữu cơ (như axit citric) và muối kiềm (như natri bicarbonat) có sẵn trong viên sủi khi gặp nước.",
    "c": "Khí Hydro do phản ứng của kim loại.",
    "d": "Khí Nitơ trong viên thuốc.",
    "correct": "Khí Carbon dioxide (CO₂) sinh ra do phản ứng giữa axit hữu cơ (như axit citric) và muối kiềm (như natri bicarbonat) có sẵn trong viên sủi khi gặp nước.",
    "explain": "Viên sủi chứa sẵn 'nguyên liệu' khô. Khi gặp nước (dung môi), phản ứng xảy ra: Axit + NaHCO₃ -> Muối + CO₂ + H₂O."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao Thủy ngân (Hg) là kim loại nhưng lại ở thể lỏng ở nhiệt độ thường?",
    "a": "Vì nó rất nhẹ.",
    "b": "Vì liên kết giữa các nguyên tử thủy ngân rất yếu, làm cho nhiệt độ nóng chảy của nó rất thấp (-39°C).",
    "c": "Vì nó hấp thụ nhiệt từ môi trường.",
    "d": "Vì nó là kim loại nhân tạo.",
    "correct": "Vì liên kết giữa các nguyên tử thủy ngân rất yếu, làm cho nhiệt độ nóng chảy của nó rất thấp (-39°C).",
    "explain": "Đây là đặc tính vật lý đặc biệt của Thủy ngân, là kim loại duy nhất lỏng ở nhiệt độ phòng."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Vải làm từ sợi tổng hợp (Nylon, Polyester) có ưu điểm là bền, đẹp, ít nhăn nhưng có nhược điểm lớn gì về mặt vệ sinh?",
    "a": "Dễ bị rách.",
    "b": "Thấm hút mồ hôi kém, gây bí bách, dễ tạo mùi cơ thể và nấm mốc phát triển.",
    "c": "Rất nặng.",
    "d": "Dễ bị côn trùng cắn.",
    "correct": "Thấm hút mồ hôi kém, gây bí bách, dễ tạo mùi cơ thể và nấm mốc phát triển.",
    "explain": "Sợi tổng hợp không có cấu trúc mao dẫn thấm hút như sợi bông (cotton), nên mồ hôi đọng lại trên da."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao các chai đựng hóa chất lỏng dễ bay hơi (như Cồn, Axeton, Xăng) không bao giờ được đổ đầy 100%?",
    "a": "Để tiết kiệm hóa chất.",
    "b": "Để chừa không gian cho chất lỏng giãn nở khi nhiệt độ tăng, tránh làm bật nắp hoặc vỡ chai.",
    "c": "Để không khí vào giúp bảo quản.",
    "d": "Để dễ rót ra.",
    "correct": "Để chừa không gian cho chất lỏng giãn nở khi nhiệt độ tăng, tránh làm bật nắp hoặc vỡ chai.",
    "explain": "Chất lỏng dễ bay hơi có áp suất hơi lớn và hệ số giãn nở nhiệt cao. Nếu đầy kín, khi trời nóng áp suất nội sẽ phá hủy bình chứa."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao nước bắp cải tím được dùng làm chất chỉ thị màu tự nhiên trong các thí nghiệm vui?",
    "a": "Vì nó có màu đẹp.",
    "b": "Vì nó chứa sắc tố Anthocyanin có khả năng đổi màu theo độ pH: Màu đỏ (axit), Tím (trung tính), Xanh/Vàng (bazơ/kiềm).",
    "c": "Vì nó phản ứng với mọi chất.",
    "d": "Vì nó rẻ tiền.",
    "correct": "Vì nó chứa sắc tố Anthocyanin có khả năng đổi màu theo độ pH: Màu đỏ (axit), Tím (trung tính), Xanh/Vàng (bazơ/kiềm).",
    "explain": "Anthocyanin là chất màu nhạy cảm với pH môi trường, là công cụ tuyệt vời để nhận biết axit/bazơ tại nhà."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Trong quá trình chưng cất rượu, tại sao rượu (Etanol) lại bay hơi và được thu hồi trước nước?",
    "a": "Vì rượu nhẹ hơn nước.",
    "b": "Vì rượu có nhiệt độ sôi thấp hơn nước (78°C so với 100°C).",
    "c": "Vì rượu không tan trong nước.",
    "d": "Vì rượu là chất khí.",
    "correct": "Vì rượu có nhiệt độ sôi thấp hơn nước (78°C so với 100°C).",
    "explain": "Nguyên tắc chưng cất phân đoạn dựa trên sự chênh lệch nhiệt độ sôi. Chất nào sôi thấp hơn sẽ bay hơi trước."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao khi nướng bánh mì hoặc bánh quy, bánh lại phồng lên và xốp?",
    "a": "Do bột nở (Baking soda/Baking powder) bị nhiệt phân hủy sinh ra khí CO₂, khí này giãn nở tạo thành các lỗ rỗng trong bánh.",
    "b": "Do nước trong bánh bay hơi.",
    "c": "Do bánh hút không khí từ lò nướng.",
    "d": "Do phản ứng giữa đường và muối.",
    "correct": "Do bột nở (Baking soda/Baking powder) bị nhiệt phân hủy sinh ra khí CO₂, khí này giãn nở tạo thành các lỗ rỗng trong bánh.",
    "explain": "2NaHCO₃ (nhiệt) -> Na₂CO₃ + CO₂ + H₂O. Khí CO₂ bị nhốt trong mạng lưới gluten của bột mì làm bánh nở."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao Canxi (Ca) rất quan trọng cho xương, nhưng kim loại Canxi nguyên chất lại không thể dùng làm vật liệu cấy ghép xương?",
    "a": "Vì Canxi kim loại quá mềm.",
    "b": "Vì Canxi kim loại phản ứng rất mạnh với nước trong cơ thể sinh ra kiềm ăn mòn và khí Hydro, gây nguy hiểm chết người.",
    "c": "Vì Canxi kim loại quá đắt.",
    "d": "Vì cơ thể đào thải Canxi.",
    "correct": "Vì Canxi kim loại phản ứng rất mạnh với nước trong cơ thể sinh ra kiềm ăn mòn và khí Hydro, gây nguy hiểm chết người.",
    "explain": "Xương là hợp chất của Canxi (Canxi photphat). Còn Canxi đơn chất (kim loại) là chất khử mạnh, phản ứng nổ với nước."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Hiện tượng 'Mưa vàng' (bụi phấn hoa) hay 'Mưa máu' (bụi sa mạc đỏ) thực chất là loại hỗn hợp nào?",
    "a": "Dung dịch màu.",
    "b": "Huyền phù khí (Aerosol) - Các hạt rắn nhỏ lơ lửng trong không khí rồi rơi xuống cùng nước mưa.",
    "c": "Nhũ tương.",
    "d": "Chất tinh khiết.",
    "correct": "Huyền phù khí (Aerosol) - Các hạt rắn nhỏ lơ lửng trong không khí rồi rơi xuống cùng nước mưa.",
    "explain": "Đây là hiện tượng vật lý, các hạt bụi/phấn hoa bị cuốn lên bầu trời và rơi xuống tạo màu cho nước mưa."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao than hoạt tính lại được dùng trong mặt nạ phòng độc?",
    "a": "Vì nó lọc được bụi to.",
    "b": "Vì nó có cấu trúc xốp với diện tích bề mặt khổng lồ, hấp phụ (giữ lại) các phân tử khí độc trên bề mặt của nó.",
    "c": "Vì nó phản ứng với khí độc tạo khí lành.",
    "d": "Vì nó cung cấp Oxy.",
    "correct": "Vì nó có cấu trúc xốp với diện tích bề mặt khổng lồ, hấp phụ (giữ lại) các phân tử khí độc trên bề mặt của nó.",
    "explain": "Hấp phụ (Adsorption) là quá trình chất khí/lỏng bám trên bề mặt chất rắn. Than hoạt tính là vua hấp phụ."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Khi đổ nước nóng vào cốc thủy tinh dày và cốc thủy tinh mỏng, cốc nào dễ bị vỡ hơn? Tại sao?",
    "a": "Cốc mỏng, vì nó yếu hơn.",
    "b": "Cốc dày, vì sự truyền nhiệt qua thành cốc chậm, lớp trong giãn nở nhanh hơn lớp ngoài gây ứng suất làm nứt cốc.",
    "c": "Cả hai vỡ như nhau.",
    "d": "Không cốc nào vỡ.",
    "correct": "Cốc dày, vì sự truyền nhiệt qua thành cốc chậm, lớp trong giãn nở nhanh hơn lớp ngoài gây ứng suất làm nứt cốc.",
    "explain": "Thủy tinh dẫn nhiệt kém. Cốc mỏng thì nhiệt truyền qua nhanh, giãn nở đều. Cốc dày thì trong nóng ngoài lạnh, giãn nở không đều gây nứt."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao vỏ tàu biển bằng thép thường được gắn các miếng Kẽm (Zn) ở phần ngâm dưới nước?",
    "a": "Để trang trí.",
    "b": "Để làm 'Vật hi sinh' (Sacrificial Anode): Kẽm hoạt động hóa học mạnh hơn Sắt nên sẽ bị nước biển ăn mòn trước, bảo vệ vỏ tàu khỏi bị gỉ.",
    "c": "Để giúp tàu bơi nhanh hơn.",
    "d": "Để cân bằng trọng lượng tàu.",
    "correct": "Để làm 'Vật hi sinh' (Sacrificial Anode): Kẽm hoạt động hóa học mạnh hơn Sắt nên sẽ bị nước biển ăn mòn trước, bảo vệ vỏ tàu khỏi bị gỉ.",
    "explain": "Đây là phương pháp bảo vệ điện hóa. Kim loại mạnh hơn (Zn) sẽ bị ăn mòn thay cho kim loại yếu hơn (Fe)."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Khi nung nóng một cục đá vôi (CaCO₃) trong bình kín rồi để nguội, áp suất trong bình sẽ thay đổi như thế nào?",
    "a": "Không đổi.",
    "b": "Tăng lên, vì phản ứng sinh ra khí CO₂ làm tăng lượng khí trong bình.",
    "c": "Giảm đi.",
    "d": "Tăng lên rồi giảm xuống.",
    "correct": "Tăng lên, vì phản ứng sinh ra khí CO₂ làm tăng lượng khí trong bình.",
    "explain": "CaCO₃ (rắn) -> CaO (rắn) + CO₂ (khí). Từ chất rắn sinh ra chất khí, số mol khí tăng lên làm áp suất tăng mạnh."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao không được dùng nước để dập tắt đám cháy do kim loại kiềm (như Natri, Kali)?",
    "a": "Vì nước làm kim loại lạnh đi.",
    "b": "Vì kim loại kiềm phản ứng mãnh liệt với nước sinh ra khí Hydro dễ cháy nổ và nhiệt lượng lớn, làm đám cháy bùng phát dữ dội hơn.",
    "c": "Vì nước sẽ hòa tan kim loại.",
    "d": "Vì kim loại kiềm quá đắt.",
    "correct": "Vì kim loại kiềm phản ứng mãnh liệt với nước sinh ra khí Hydro dễ cháy nổ và nhiệt lượng lớn, làm đám cháy bùng phát dữ dội hơn.",
    "explain": "2Na + 2H₂O -> 2NaOH + H₂ + Nhiệt. H₂ sinh ra gặp nhiệt độ cao của đám cháy sẽ nổ."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao TUYỆT ĐỐI KHÔNG ĐƯỢC trộn thuốc tẩy rửa bồn cầu (chứa Axit HCl) với nước tẩy Javel (chứa NaOCl)?",
    "a": "Vì hỗn hợp sẽ bị đông cứng.",
    "b": "Vì phản ứng hóa học xảy ra sinh ra khí Clo (Cl₂) màu vàng lục, có mùi hắc và cực độc, gây ngạt thở và tổn thương phổi ngay lập tức.",
    "c": "Vì hỗn hợp sẽ mất tác dụng tẩy rửa.",
    "d": "Vì sẽ làm hỏng men bồn cầu.",
    "correct": "Vì phản ứng hóa học xảy ra sinh ra khí Clo (Cl₂) màu vàng lục, có mùi hắc và cực độc, gây ngạt thở và tổn thương phổi ngay lập tức.",
    "explain": "Phản ứng: NaOCl + 2HCl -> NaCl + Cl₂ + H₂O. Khí Clo là vũ khí hóa học, rất nguy hiểm trong không gian hẹp như nhà tắm."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao khi cắt hành tây lại làm ta bị cay mắt và chảy nước mắt?",
    "a": "Do mùi hăng của hành.",
    "b": "Do khi tế bào hành vỡ ra, các hợp chất lưu huỳnh phản ứng tạo thành khí Propanethial-S-oxide. Khí này bay vào mắt gặp nước mắt tạo thành Axit Sulfuric loãng gây kích ứng.",
    "c": "Do hành bắn nước vào mắt.",
    "d": "Do phản xạ tự nhiên.",
    "correct": "Do khi tế bào hành vỡ ra, các hợp chất lưu huỳnh phản ứng tạo thành khí Propanethial-S-oxide. Khí này bay vào mắt gặp nước mắt tạo thành Axit Sulfuric loãng gây kích ứng.",
    "explain": "Đây là cơ chế tự vệ của củ hành. Axit tạo ra tuy lượng rất nhỏ nhưng đủ làm mắt bị xót và tiết nước mắt để rửa trôi."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao ở các nước hàn đới, người ta thường rải muối lên mặt đường khi có tuyết rơi?",
    "a": "Để tăng ma sát cho xe chạy.",
    "b": "Để hạ thấp nhiệt độ đông đặc của nước, làm băng tuyết tan chảy thành nước lỏng ngay cả khi nhiệt độ dưới 0°C.",
    "c": "Để làm đường sạch hơn.",
    "d": "Để muối ăn mòn mặt đường.",
    "correct": "Để hạ thấp nhiệt độ đông đặc của nước, làm băng tuyết tan chảy thành nước lỏng ngay cả khi nhiệt độ dưới 0°C.",
    "explain": "Nước tinh khiết đóng băng ở 0°C, nhưng dung dịch nước muối có thể chịu được nhiệt độ thấp hơn nhiều (tới -10°C hoặc thấp hơn) mà không đóng băng."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tượng Nữ thần Tự do (Mỹ) ban đầu có màu nâu đỏ của Đồng (Cu), nhưng hiện nay lại có màu xanh lục. Đây là hiện tượng gì?",
    "a": "Do người ta sơn lại màu xanh.",
    "b": "Do Đồng bị oxi hóa bởi Oxy, hơi nước và khí CO₂ trong không khí tạo thành lớp gỉ Đồng (CuCO₃.Cu(OH)₂) có màu xanh (Patina).",
    "c": "Do rêu mọc phủ kín.",
    "d": "Do bụi bẩn bám vào.",
    "correct": "Do Đồng bị oxi hóa bởi Oxy, hơi nước và khí CO₂ trong không khí tạo thành lớp gỉ Đồng (CuCO₃.Cu(OH)₂) có màu xanh (Patina).",
    "explain": "Lớp gỉ xanh này thực chất rất bền, giúp bảo vệ lớp đồng bên trong không bị ăn mòn tiếp."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao dầu mỏ (Dầu thô) mới khai thác lên không dùng được ngay mà phải đưa vào nhà máy lọc dầu chưng cất phân đoạn?",
    "a": "Để lọc sạch cát bụi.",
    "b": "Vì dầu thô là hỗn hợp của hàng nghìn hydrocarbon khác nhau. Cần chưng cất để tách chúng ra thành các phân đoạn có nhiệt độ sôi khác nhau (Xăng, Dầu hỏa, Diesel, Nhựa đường...) để sử dụng.",
    "c": "Để làm dầu lỏng hơn.",
    "d": "Để đổi màu dầu.",
    "correct": "Vì dầu thô là hỗn hợp của hàng nghìn hydrocarbon khác nhau. Cần chưng cất để tách chúng ra thành các phân đoạn có nhiệt độ sôi khác nhau (Xăng, Dầu hỏa, Diesel, Nhựa đường...) để sử dụng.",
    "explain": "Mỗi sản phẩm của dầu mỏ có nhiệt độ sôi và ứng dụng khác nhau. Không thể đổ dầu thô vào xe máy chạy được."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao khi bị ốm sốt cao, các bác sĩ khuyên nên uống nước Oresol (nước biển khô)?",
    "a": "Để hạ sốt nhanh.",
    "b": "Để bù đắp lượng Nước và các Ion khoáng (Điện giải: Na⁺, K⁺, Cl⁻) bị mất đi do mồ hôi, giúp cơ thể cân bằng lại áp suất thẩm thấu, tránh kiệt sức.",
    "c": "Để cung cấp đường cho cơ thể.",
    "d": "Để diệt vi khuẩn trong ruột.",
    "correct": "Để bù đắp lượng Nước và các Ion khoáng (Điện giải: Na⁺, K⁺, Cl⁻) bị mất đi do mồ hôi, giúp cơ thể cân bằng lại áp suất thẩm thấu, tránh kiệt sức.",
    "explain": "Sốt cao gây mất nước và muối khoáng nghiêm trọng. Uống nước lọc thôi là chưa đủ, phải uống dung dịch đẳng trương (Oresol) để tế bào hồi phục."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Hiện tượng 'Ma trơi' (những đốm lửa xanh nhạt bay lơ lửng ở nghĩa địa) được giải thích khoa học như thế nào?",
    "a": "Là hiện tượng tâm linh.",
    "b": "Do sự phân hủy xương cốt sinh ra khí Photphine (PH₃). Khí này tự bốc cháy khi gặp không khí ẩm ở nhiệt độ thường, tạo ra ngọn lửa lạnh.",
    "c": "Do đom đóm tụ tập.",
    "d": "Do phản chiếu ánh trăng.",
    "correct": "Do sự phân hủy xương cốt sinh ra khí Photphine (PH₃). Khí này tự bốc cháy khi gặp không khí ẩm ở nhiệt độ thường, tạo ra ngọn lửa lạnh.",
    "explain": "Trong xương có Photpho. Khi phân hủy yếm khí sinh ra PH₃. PH₃ (lẫn P₂H₄) rất kém bền và tự cháy trong không khí: 2PH₃ + 4O₂ -> P₂O₅ + 3H₂O."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao thợ lặn biển sâu phải dùng bình khí thở chứa hỗn hợp Helium-Oxy thay vì Nitơ-Oxy (như không khí thường)?",
    "a": "Vì Helium rẻ hơn Nitơ.",
    "b": "Vì Nitơ tan nhiều trong máu ở áp suất cao, khi ngoi lên nhanh sẽ sủi bọt khí trong mạch máu gây tắc mạch (Bệnh thợ lặn). Helium ít tan hơn nên an toàn hơn.",
    "c": "Vì Helium giúp thợ lặn bơi nhanh hơn.",
    "d": "Vì Helium giúp giữ ấm cơ thể.",
    "correct": "Vì Nitơ tan nhiều trong máu ở áp suất cao, khi ngoi lên nhanh sẽ sủi bọt khí trong mạch máu gây tắc mạch (Bệnh thợ lặn). Helium ít tan hơn nên an toàn hơn.",
    "explain": "Độ tan của khí tăng khi áp suất tăng. Nitơ áp suất cao gây say và nguy hiểm khi giảm áp. Helium trơ và ít tan nên được dùng thay thế."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Trong phòng cháy chữa cháy rừng, người ta thường đào các 'đường băng cản lửa' (khoảng đất trống cây cỏ) để làm gì?",
    "a": "Để xe cứu hỏa đi vào.",
    "b": "Để loại bỏ yếu tố 'Chất cháy' trong Tam giác lửa, ngăn đám cháy lan truyền sang khu vực khác.",
    "c": "Để lấy đất lấp lửa.",
    "d": "Để bộ đội hành quân.",
    "correct": "Để loại bỏ yếu tố 'Chất cháy' trong Tam giác lửa, ngăn đám cháy lan truyền sang khu vực khác.",
    "explain": "Lửa cần vật liệu để cháy tiếp. Tạo khoảng trống không có cây cối là cắt đứt nguồn nhiên liệu, làm lửa tự tắt khi cháy hết vùng cũ."
  },
  {
    "subject": "Hóa học",
    "difficulty": "hard",
    "content": "Tại sao Thủy tinh (silicat) là chất rắn vô định hình chứ không phải chất rắn tinh thể?",
    "a": "Vì nó trong suốt.",
    "b": "Vì khi nung nóng nó mềm dần rồi mới chảy lỏng (không có nhiệt độ nóng chảy xác định), do các hạt cấu tạo sắp xếp không theo trật tự hình học nhất định.",
    "c": "Vì nó dễ vỡ.",
    "d": "Vì nó được làm từ cát.",
    "correct": "Vì khi nung nóng nó mềm dần rồi mới chảy lỏng (không có nhiệt độ nóng chảy xác định), do các hạt cấu tạo sắp xếp không theo trật tự hình học nhất định.",
    "explain": "Chất rắn tinh thể (như muối, kim loại, băng phiến) nóng chảy ở nhiệt độ cố định. Chất vô định hình (như thủy tinh, nhựa đường) chỉ mềm đi qua một khoảng nhiệt độ."
  }
]