[
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Cơ chế đóng mở khí khổng của thực vật dựa trên nguyên lý vật lý nào của tế bào hình hạt đậu?",
    "a": "Sự thay đổi độ dày của thành tế bào do sự lão hóa hóa học.",
    "b": "Sự biến động áp suất trương nước do sự ra vào của các ion.",
    "c": "Sự co giãn của màng sinh chất dưới tác động của nhiệt độ.",
    "d": "Sự phân hủy các hạt tinh bột thành đường làm giảm áp suất.",
    "correct": "b",
    "explain": "Khi ion K+ được bơm vào, nước thẩm thấu theo làm tế bào trương nước. Do thành mỏng giãn nhiều hơn thành dày, khí khổng mở ra."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Tại sao biện pháp đấu tranh sinh học (dùng thiên địch) lại ưu việt hơn thuốc trừ sâu hóa học trong bảo vệ thực vật?",
    "a": "Tiêu diệt nhanh chóng mọi loại côn trùng gây hại ngay lập tức.",
    "b": "Có khả năng tồn tại vĩnh viễn trong môi trường không bị mất đi.",
    "c": "Không gây ô nhiễm môi trường và không tạo ra dư lượng độc hại.",
    "d": "Làm tăng năng suất cây trồng ngay sau khi thả thiên địch vào.",
    "correct": "c",
    "explain": "Biện pháp sinh học nhắm trúng đích, không gây kháng thuốc, bảo vệ đa dạng sinh học và không để lại chất độc trong nông sản."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Chức năng chính của nhân con (hạch nhân) nằm bên trong nhân tế bào nhân thực là gì?",
    "a": "Tổng hợp các phân tử ATP cung cấp năng lượng cho nhân.",
    "b": "Lưu trữ thông tin di truyền chính của toàn bộ tế bào.",
    "c": "Tổng hợp rARN và lắp ráp các tiểu đơn vị của ribosome.",
    "d": "Phân giải các chất độc hại xâm nhập vào bên trong nhân.",
    "correct": "c",
    "explain": "Nhân con là nơi các gen mã hóa rARN hoạt động mạnh, kết hợp với protein để tạo thành các tiểu phần ribosome trước khi xuất ra tế bào chất."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Tại sao ADN được chọn lọc tự nhiên ưu tiên làm vật chất di truyền lưu trữ thông tin thay vì ARN?",
    "a": "Đường Deoxyribose bền vững hơn về mặt hóa học so với Ribose.",
    "b": "ADN có cấu trúc mạch đơn nên dễ dàng sao chép nhanh hơn ARN.",
    "c": "ADN chứa Uracil giúp liên kết hydro bền vững hơn là Thymine.",
    "d": "ADN có kích thước nhỏ hơn ARN nên dễ đóng gói vào trong nhân.",
    "correct": "a",
    "explain": "Nhóm -OH ở đường Ribose làm ARN kém bền và dễ bị thủy phân. ADN thiếu oxy ở vị trí 2' (Deoxy) nên ổn định hơn để lưu trữ dài hạn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Bào tử (Endospore) của vi khuẩn được hình thành nhằm mục đích sinh học chủ yếu nào?",
    "a": "Là hình thức sinh sản để gia tăng số lượng cá thể nhanh chóng.",
    "b": "Giúp vi khuẩn bám chặt vào tế bào của vật chủ để gây bệnh.",
    "c": "Giúp vi khuẩn sống sót qua các điều kiện bất lợi khắc nghiệt.",
    "d": "Là nơi dự trữ các chất dinh dưỡng cho hoạt động sống hàng ngày.",
    "correct": "c",
    "explain": "Bào tử không phải là sinh sản (1 vi khuẩn tạo 1 bào tử). Nó là trạng thái 'ngủ đông' với vỏ dày chịu nhiệt, hóa chất để tồn tại chờ thời cơ."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Sự khác biệt cơ bản về chiều vận chuyển giữa dòng mạch gỗ (xylem) và dòng mạch rây (phloem) là gì?",
    "a": "Mạch gỗ vận chuyển nước, mạch rây vận chuyển các muối khoáng.",
    "b": "Mạch gỗ gồm tế bào sống, mạch rây gồm các tế bào đã chết.",
    "c": "Mạch gỗ vận chuyển hai chiều, mạch rây vận chuyển một chiều.",
    "d": "Mạch gỗ vận chuyển một chiều, mạch rây vận chuyển hai chiều.",
    "correct": "d",
    "explain": "Mạch gỗ chỉ đẩy nước từ rễ lên lá. Mạch rây vận chuyển chất hữu cơ từ 'nguồn' (lá) đến 'nơi chứa' (rễ, quả) nên có thể đi lên hoặc xuống."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Tại sao Virus không được coi là một cơ thể sinh vật sống hoàn chỉnh trong hệ thống phân loại 5 giới?",
    "a": "Chúng có kích thước siêu hiển vi nhỏ hơn nhiều so với vi khuẩn.",
    "b": "Chúng gây bệnh cho cả thực vật, động vật và con người chúng ta.",
    "c": "Chúng không có cấu tạo tế bào và không có trao đổi chất tự thân.",
    "d": "Chúng chứa vật chất di truyền là các đoạn ADN hoặc ARN mạch đơn.",
    "correct": "c",
    "explain": "Tiêu chuẩn cơ bản của sự sống là cấu tạo tế bào và chuyển hóa năng lượng. Virus chỉ là các hạt nucleoprotein 'mượn' sự sống của vật chủ."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Vai trò sinh thái quan trọng nhất của nhóm sinh vật phân giải (vi khuẩn, nấm) trong tự nhiên là gì?",
    "a": "Cung cấp nguồn năng lượng trực tiếp cho các động vật ăn thịt.",
    "b": "Khép kín vòng tuần hoàn vật chất trong các hệ sinh thái đất.",
    "c": "Cạnh tranh nguồn dinh dưỡng với các loài thực vật tự dưỡng.",
    "d": "Tạo ra khí oxy cung cấp cho các sinh vật hiếu khí hô hấp.",
    "correct": "b",
    "explain": "Nếu không có sinh vật phân giải, xác chết sẽ chất đống và khoáng chất bị khóa chặt trong hợp chất hữu cơ, cây cối sẽ chết vì thiếu khoáng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Tính bất đối xứng của màng sinh chất được thể hiện rõ nhất qua sự phân bố của thành phần nào?",
    "a": "Các chuỗi carbohydrate (glycocalyx) chỉ nằm ở mặt ngoài màng.",
    "b": "Các protein xuyên màng chỉ quay mặt hoạt động về phía tế bào.",
    "c": "Các phân tử cholesterol chỉ nằm chen chúc ở lớp lipid bên trong.",
    "d": "Các đầu ưa nước của phospholipid chỉ quay về phía dịch ngoại bào.",
    "correct": "a",
    "explain": "Glycocalyx đóng vai trò 'thẻ tên' nhận diện tế bào, nên chúng luôn quay ra ngoài. Màng trong và màng ngoài có thành phần lipid/protein khác nhau."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Tại sao tế bào phải sử dụng năng lượng ATP để thực hiện quá trình vận chuyển chủ động qua màng?",
    "a": "Để vận chuyển các phân tử nước ra vào tế bào một cách nhanh chóng.",
    "b": "Để cân bằng nồng độ các chất tan ở hai bên màng tế bào sinh chất.",
    "c": "Để đưa các chất hòa tan đi qua lớp lipid kép có tính chất kị nước.",
    "d": "Để lấy các chất cần thiết ngược chiều gradient nồng độ tự nhiên.",
    "correct": "d",
    "explain": "Khuếch tán tự nhiên đi từ nơi nồng độ cao xuống thấp. Để đi ngược lại (gom tụ chất), tế bào phải 'bơm' và tốn công (ATP)."
  },
  
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Trong quá trình truyền tin qua synapse thần kinh, vai trò chính xác của ion Canxi (Ca2+) tại màng trước synapse là gì?",
    "a": "Kích hoạt các túi chứa chất trung gian hóa học dung hợp với màng trước.",
    "b": "Trực tiếp dẫn truyền xung điện thế hoạt động nhảy qua khe hở synapse.",
    "c": "Gắn vào các thụ thể trên màng sau để mở kênh ion Natri gây khử cực.",
    "d": "Phân giải các chất dẫn truyền thần kinh thừa để tái lập trạng thái nghỉ.",
    "correct": "a",
    "explain": "Khi xung thần kinh đến, kênh Ca2+ mở, Ca2+ tràn vào làm các túi chứa chất dẫn truyền (như Acetylcholine) gắn vào màng tế bào và giải phóng nội dung ra khe synapse."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Tại sao thực vật C4 không xảy ra hiện tượng hô hấp sáng gây lãng phí năng lượng như thực vật C3 khi cường độ ánh sáng cao?",
    "a": "Nhờ khả năng đóng kín khí khổng hoàn toàn vào ban ngày để ngăn O2.",
    "b": "Nhờ cấu trúc lục lạp đặc biệt không chứa enzyme Rubisco trong mô giậu.",
    "c": "Nhờ enzyme PEP-carboxylase có ái lực cao với CO2 và không gắn với O2.",
    "d": "Nhờ quá trình quang phân ly nước bị ức chế mạnh mẽ khi trời nắng gắt.",
    "correct": "c",
    "explain": "PEP-carboxylase chỉ cố định CO2 mà không cố định O2, giúp cây C4 tránh được phản ứng oxy hóa chất nền của Rubisco (hô hấp sáng) ngay cả khi nồng độ CO2 thấp."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Trong cấu trúc xoắn kép của ADN, yếu tố vật lý nào đóng vai trò chính yếu nhất giúp ổn định cấu trúc chồng xếp của các cặp base?",
    "a": "Lực liên kết cộng hóa trị phosphodiester bền vững dọc theo khung đường.",
    "b": "Tương tác kị nước (chồng xếp base) giữa các mặt phẳng của bazơ nitơ.",
    "c": "Lực liên kết hydro yếu hình thành giữa các cặp bazơ nitơ bổ sung nhau.",
    "d": "Lực hút tĩnh điện giữa các nhóm phosphate tích điện âm và ion dương.",
    "correct": "b",
    "explain": "Mặc dù liên kết hydro giúp định hướng đặc hiệu, nhưng tương tác chồng xếp (kị nước) giữa các mặt phẳng base mới là lực chính giữ ổn định cấu trúc xoắn trong môi trường nước."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Hệ thống 'đai Caspary' ở tế bào nội bì rễ cây có chức năng sinh học quan trọng nào đối với dòng vận chuyển nước và khoáng?",
    "a": "Tạo lực đẩy chủ động để bơm nước từ rễ lên thân cây ngược chiều trọng lực.",
    "b": "Hấp thụ thêm nước từ môi trường đất vào trong mạch gỗ bằng cơ chế thẩm thấu.",
    "c": "Lọc sạch các loại vi khuẩn và nấm gây hại trước khi chúng đi vào mạch rây.",
    "d": "Ngăn chặn dòng nước đi qua con đường gian bào, buộc phải qua màng sinh chất.",
    "correct": "d",
    "explain": "Đai Caspary không thấm nước buộc dòng khoáng chất phải đi xuyên qua màng sinh chất (con đường tế bào chất), giúp cây kiểm soát chọn lọc các chất đi vào."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Trong cơ chế vận chuyển thụ động, tốc độ khuếch tán của một chất qua kênh protein sẽ đạt trạng thái bão hòa khi yếu tố nào xảy ra?",
    "a": "Tất cả các vị trí gắn trên protein vận chuyển trên màng đều đang hoạt động.",
    "b": "Nồng độ chất tan bên ngoài tế bào thấp hơn nồng độ chất tan bên trong.",
    "c": "Năng lượng ATP dự trữ trong tế bào bị cạn kiệt hoàn toàn do hoạt động mạnh.",
    "d": "Nhiệt độ môi trường giảm xuống dưới mức sinh lý học bình thường của tế bào.",
    "correct": "a",
    "explain": "Khác với khuếch tán đơn giản, khuếch tán qua kênh/chất mang bị giới hạn bởi số lượng protein vận chuyển. Khi tất cả protein đều 'bận', tốc độ sẽ đạt Vmax."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Hiện tượng 'biến động mã' (Wobble) ở vị trí thứ ba của bộ ba mã hóa (codon) mang lại ý nghĩa tiết kiệm nào cho tế bào?",
    "a": "Giảm thiểu sai sót trong quá trình sao chép ADN nhiễm sắc thể trước phân bào.",
    "b": "Tăng tốc độ trượt của ribosome trên phân tử ARN thông tin trong quá trình dịch mã.",
    "c": "Giảm số lượng loại tARN cần thiết để nhận diện hết 61 mã bộ ba mã hóa axit amin.",
    "d": "Ngăn chặn sự hình thành các cấu trúc bậc hai phức tạp trên phân tử mARN.",
    "correct": "c",
    "explain": "Do sự kết cặp lỏng lẻo ở vị trí thứ 3, một loại tARN có thể nhận diện nhiều codon đồng nghĩa khác nhau, giúp tế bào không cần tổng hợp đủ 61 loại tARN."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Tại sao các loài thú sống ở vùng cực (như gấu trắng) thường có kích thước cơ thể lớn hơn các loài họ hàng sống ở vùng nhiệt đới?",
    "a": "Để tích trữ được lượng mỡ dự phòng nhiều hơn cho mùa đông khan hiếm thức ăn.",
    "b": "Để giảm tỉ lệ diện tích bề mặt trên thể tích (S/V) nhằm hạn chế mất nhiệt.",
    "c": "Để dễ dàng săn bắt các con mồi có kích thước lớn đặc trưng ở vùng cực.",
    "d": "Để có bộ xương vững chắc hơn giúp di chuyển linh hoạt trên nền băng tuyết.",
    "correct": "b",
    "explain": "Theo quy tắc Bergmann: Kích thước lớn làm giảm tỉ lệ S/V (diện tích/thể tích), giúp hạn chế sự thất thoát nhiệt lượng cơ thể ra môi trường lạnh giá."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Trong kĩ thuật di truyền, plasmid được sử dụng làm thể truyền (vector) chủ yếu nhờ vào đặc tính sinh học ưu việt nào dưới đây?",
    "a": "Là phân tử ARN bền vững không bị enzyme của tế bào vật chủ phân hủy ngay.",
    "b": "Là protein đặc biệt có thể mang gen xâm nhập qua màng tế bào một cách dễ dàng.",
    "c": "Là phân tử ADN thẳng có khả năng tích hợp nhanh vào hệ gen của tế bào chủ.",
    "d": "Là phân tử ADN vòng có điểm khởi đầu sao chép riêng và tự nhân đôi độc lập.",
    "correct": "d",
    "explain": "Plasmid là ADN vòng nằm ngoài NST, có điểm khởi đầu sao chép riêng (ori) nên có thể nhân lên số lượng lớn trong tế bào vật chủ mà không phụ thuộc vào NST chính."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Hormone Glucagon do tuyến tụy tiết ra thực hiện chức năng điều hòa đường huyết thông qua cơ chế tác động chủ yếu nào?",
    "a": "Kích thích gan phân giải glycogen dự trữ thành glucose giải phóng vào máu.",
    "b": "Ức chế quá trình phân giải lipid dự trữ trong các mô mỡ thừa của cơ thể.",
    "c": "Kích thích tế bào cơ tăng cường hấp thu glucose từ dòng máu để tạo năng lượng.",
    "d": "Thúc đẩy quá trình tổng hợp protein từ các axit amin tự do trong tế bào chất.",
    "correct": "a",
    "explain": "Glucagon là hormone đối kháng Insulin. Khi đường huyết thấp, nó kích thích gan chuyển hóa Glycogen thành Glucose để nâng nồng độ đường trong máu."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Cơ chế 'cắt nối thay thế' (alternative splicing) tiền mARN ở sinh vật nhân thực mang lại lợi ích tiến hóa to lớn nào?",
    "a": "Loại bỏ hoàn toàn các đột biến gen xảy ra trong quá trình sao chép ADN.",
    "b": "Tạo ra nhiều loại protein khác nhau từ một trình tự gen cấu trúc duy nhất.",
    "c": "Tăng độ bền vững của phân tử mARN trước các enzyme phân giải ARN nội bào.",
    "d": "Giúp quá trình dịch mã diễn ra nhanh hơn nhờ rút ngắn chiều dài mạch mARN.",
    "correct": "b",
    "explain": "Bằng cách chọn các exon khác nhau để giữ lại, một gen có thể mã hóa cho nhiều phiên bản protein (isoform) khác nhau tùy thuộc vào nhu cầu của tế bào."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Sự hiện diện của lớp cutin dày trên biểu bì lá của thực vật sống ở vùng khô hạn nhằm mục đích thích nghi chủ yếu nào?",
    "a": "Phản xạ ánh sáng mặt trời gay gắt để tránh làm cháy các mô lá bên dưới.",
    "b": "Ngăn chặn sự xâm nhập của các loài côn trùng và vi sinh vật gây hại cho lá.",
    "c": "Hạn chế tối đa sự thoát hơi nước qua bề mặt lá ngoài con đường khí khổng.",
    "d": "Tăng cường độ cứng cho lá để chống chịu sức gió bão mạnh ở vùng sa mạc.",
    "correct": "c",
    "explain": "Cutin là sáp không thấm nước. Lớp cutin dày buộc nước phải thoát ra chủ yếu qua khí khổng (nơi cây có thể chủ động điều khiển đóng mở), giúp tiết kiệm nước."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Trong chu trình Krebs, phân tử Axit Oxaloaxetic (OAA) đóng vai trò gì trong việc duy trì sự hoạt động liên tục của chu trình?",
    "a": "Là enzyme xúc tác cho phản ứng khử carboxyl của axit Pyruvic đầu vào.",
    "b": "Là nguồn cung cấp năng lượng trực tiếp để tổng hợp các phân tử ATP.",
    "c": "Là sản phẩm cuối cùng được đào thải ra ngoài ti thể ngay lập tức.",
    "d": "Là chất nhận nhóm Acetyl-CoA đầu tiên để tái tạo thành axit Citric.",
    "correct": "d",
    "explain": "Oxaloaxetic (4C) kết hợp với Acetyl-CoA (2C) tạo thành Citric (6C), khởi đầu chu trình. Cuối chu trình, Oxaloaxetic được tái tạo để bắt đầu vòng quay mới."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Tại sao các tế bào hồng cầu của người không có nhân và các bào quan như ti thể khi đã biệt hóa thành dạng trưởng thành?",
    "a": "Để tối ưu hóa không gian chứa Hemoglobin giúp vận chuyển khí oxy hiệu quả.",
    "b": "Để giảm trọng lượng giúp chúng di chuyển nhanh hơn trong dòng máu tuần hoàn.",
    "c": "Để ngăn chặn sự phân chia tế bào không kiểm soát có thể gây ra ung thư máu.",
    "d": "Để tránh việc tiêu thụ oxy mà chúng đang vận chuyển đi nuôi các tế bào khác.",
    "correct": "a",
    "explain": "Việc loại bỏ nhân và ti thể giúp hồng cầu trở thành 'túi chứa' Hemoglobin tối đa, đồng thời ngăn hồng cầu tự tiêu thụ oxy (chúng hô hấp kị khí)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Vai trò của enzyme Helicase trong quá trình nhân đôi ADN là thực hiện chức năng cơ học nào đối với phân tử ADN kép?",
    "a": "Cắt đứt liên kết cộng hóa trị trên mạch đường - phosphate bền vững.",
    "b": "Tháo xoắn và phá vỡ các liên kết hydro để tách hai mạch đơn ADN ra.",
    "c": "Gắn các đoạn mồi ARN vào mạch khuôn để khởi đầu sự tổng hợp mạch mới.",
    "d": "Nối các đoạn Okazaki lại với nhau để tạo thành mạch ADN hoàn chỉnh.",
    "correct": "b",
    "explain": "Helicase hoạt động như một cái 'dây kéo', trượt dọc theo ADN và dùng năng lượng ATP để tách đôi hai mạch đơn, tạo chạc ba sao chép."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Hiện tượng 'tự thực' (Autophagy) của tế bào được kích hoạt mạnh mẽ nhất trong điều kiện sinh lý bất lợi nào dưới đây?",
    "a": "Khi tế bào đang phân chia mạnh mẽ và cần nhiều vật liệu xây dựng mới.",
    "b": "Khi tế bào bị nhiễm virus và cần tiêu diệt tác nhân xâm nhập ngay lập tức.",
    "c": "Khi tế bào bị thiếu hụt dinh dưỡng và cần tái chế nội bào quan lấy năng lượng.",
    "d": "Khi tế bào tích lũy quá nhiều năng lượng dưới dạng mỡ dự trữ trong tế bào chất.",
    "correct": "c",
    "explain": "Khi 'đói', tế bào tự 'ăn' các thành phần của chính mình (bào quan già, protein hỏng) thông qua lysosome để lấy axit amin và năng lượng duy trì sự sống cơ bản."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Trong hệ sinh thái, tại sao chuỗi thức ăn trên cạn thường ngắn hơn chuỗi thức ăn dưới nước (đại dương)?",
    "a": "Do động vật trên cạn tiêu tốn nhiều năng lượng để chống trọng lực và giữ nhiệt.",
    "b": "Do hiệu suất chuyển hóa năng lượng của động vật trên cạn luôn thấp hơn dưới nước.",
    "c": "Do sinh vật sản xuất trên cạn có kích thước lớn và khó tiêu hóa hơn tảo biển.",
    "d": "Do môi trường trên cạn khắc nghiệt hơn môi trường nước có tính ổn định cao.",
    "correct": "a",
    "explain": "Động vật trên cạn tốn năng lượng khổng lồ cho việc duy trì thân nhiệt và nâng đỡ cơ thể, làm năng lượng thất thoát nhanh hơn qua mỗi bậc, giới hạn độ dài chuỗi."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Cơ chế 'bán bảo toàn' (semiconservative) trong quá trình nhân đôi ADN đảm bảo tính chính xác di truyền nhờ nguyên tắc nào?",
    "a": "Mỗi phân tử ADN con được tổng hợp hoàn toàn mới từ các nucleotide tự do.",
    "b": "Mỗi phân tử ADN con giữ lại một mạch cũ làm khuôn và tổng hợp một mạch mới.",
    "c": "Phân tử ADN mẹ được bảo tồn nguyên vẹn sau khi quá trình sao chép kết thúc.",
    "d": "Các đoạn ADN con được lắp ghép ngẫu nhiên từ các đoạn ADN mẹ cũ và mới.",
    "correct": "b",
    "explain": "Nguyên tắc bán bảo toàn giúp giảm thiểu sai sót: mạch cũ đóng vai trò là khuôn mẫu chính xác để tổng hợp mạch bổ sung mới theo nguyên tắc bổ sung."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Tại sao một số loài vi khuẩn cổ (Archaea) có thể sống trong môi trường nước sôi 100°C mà protein không bị biến tính?",
    "a": "Do chúng có lớp vỏ cách nhiệt cực tốt bao quanh tế bào chất bảo vệ bên trong.",
    "b": "Do chúng liên tục tổng hợp protein mới để thay thế protein hỏng do nhiệt độ cao.",
    "c": "Do protein của chúng có cấu trúc cuộn chặt và nhiều liên kết disulfide bền vững.",
    "d": "Do chúng không sử dụng protein để thực hiện các chức năng sống cơ bản như enzyme.",
    "correct": "c",
    "explain": "Protein của vi khuẩn chịu nhiệt có nhiều liên kết ion, cầu nối disulfide và lõi kị nước chặt chẽ, giúp cấu trúc không gian bền vững trước nhiệt độ cao."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Sự khác biệt về thế năng nước (water potential) giữa đất và rễ cây là động lực chính cho quá trình sinh lý nào?",
    "a": "Vận chuyển chủ động các ion khoáng từ đất vào lông hút ngược chiều nồng độ.",
    "b": "Thoát hơi nước qua khí khổng để làm mát bề mặt lá cây khi trời nắng nóng.",
    "c": "Đẩy dòng mạch gỗ di chuyển ngược chiều trọng lực từ rễ lên đến ngọn cây.",
    "d": "Dòng nước thẩm thấu thụ động từ môi trường đất vào bên trong tế bào rễ cây.",
    "correct": "d",
    "explain": "Nước luôn di chuyển từ nơi có thế năng nước cao (đất ẩm, ít chất tan) sang nơi có thế năng nước thấp hơn (tế bào rễ chứa nhiều chất tan) một cách tự nhiên."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Trong quá trình giảm phân, sự tiếp hợp và trao đổi chéo giữa các nhiễm sắc thể tương đồng xảy ra ở giai đoạn đặc thù nào?",
    "a": "Kỳ đầu của giảm phân I khi các nhiễm sắc thể bắt đầu co xoắn và hiện rõ.",
    "b": "Kỳ giữa của giảm phân I khi các nhiễm sắc thể xếp thành hai hàng ở xích đạo.",
    "c": "Kỳ đầu của giảm phân II ngay sau khi tế bào vừa hoàn thành giảm phân I.",
    "d": "Kỳ sau của giảm phân II khi các nhiễm sắc thể đơn phân ly về hai cực tế bào.",
    "correct": "a",
    "explain": "Tại kỳ đầu I, các NST tương đồng bắt cặp chính xác; sự trao đổi đoạn (crossing-over) tạo ra các tổ hợp gen mới (biến dị tổ hợp) quan trọng cho tiến hóa."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Tại sao thuốc kháng sinh Penicillin lại có tác dụng diệt khuẩn mạnh đối với vi khuẩn Gram dương hơn là Gram âm?",
    "a": "Do Gram dương không có khả năng sinh enzyme phân giải thuốc kháng sinh này.",
    "b": "Do Gram dương có thành peptidoglycan dày và nằm lộ ngay bề mặt tế bào.",
    "c": "Do Gram âm có màng tế bào chất dày hơn ngăn cản thuốc thâm nhập vào trong.",
    "d": "Do Gram âm sinh sản chậm hơn nên ít chịu tác động ức chế của thuốc hơn.",
    "correct": "b",
    "explain": "Penicillin tấn công vào quá trình tổng hợp thành peptidoglycan. Gram âm có lớp màng ngoài (outer membrane) che chắn, ngăn thuốc tiếp cận lớp thành mỏng bên trong."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Trong cơ chế điều hòa Operon Lac, chất cảm ứng Allolactose thực hiện chức năng kích hoạt phiên mã bằng cách nào?",
    "a": "Gắn vào vùng khởi động để giúp enzyme ARN polymerase bám chặt hơn vào gen.",
    "b": "Phân giải protein ức chế thành các axit amin để loại bỏ sự cản trở phiên mã.",
    "c": "Gắn vào protein ức chế làm nó thay đổi cấu hình và rời khỏi vùng vận hành.",
    "d": "Gắn trực tiếp vào gen cấu trúc để khởi động quá trình phiên mã mARN tương ứng.",
    "correct": "c",
    "explain": "Allolactose liên kết với protein ức chế (LacI), làm protein này mất khả năng bám vào vùng vận hành (Operator), từ đó 'mở khóa' cho gen hoạt động."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Cơ chế 'bẫy ion' trong không bào của tế bào thực vật giúp cây chịu đựng được môi trường đất nhiễm mặn nhờ vào đâu?",
    "a": "Đẩy toàn bộ ion Na+ ra khỏi rễ trở lại môi trường đất xung quanh rễ cây.",
    "b": "Bơm các ion Na+ độc hại từ tế bào chất vào chứa cô lập trong không bào.",
    "c": "Biến đổi ion Na+ thành các hợp chất hữu cơ không gây độc hại cho tế bào.",
    "d": "Sử dụng ion Na+ thay thế hoàn toàn cho ion K+ trong các phản ứng sinh hóa.",
    "correct": "b",
    "explain": "Cây chịu mặn dùng năng lượng để 'nhốt' Na+ vào không bào (khu vực cách ly), giữ cho nồng độ Na+ trong tế bào chất thấp để không ức chế hoạt động enzyme."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Trong quá trình truyền tin tế bào, tại sao các thụ thể nội bào (trong tế bào chất) chỉ dành cho các hormone loại steroid?",
    "a": "Vì steroid có kích thước nhỏ nên dễ dàng lọt qua các kênh protein trên màng.",
    "b": "Vì steroid tích điện dương nên bị màng tế bào tích điện âm hút vào bên trong.",
    "c": "Vì steroid không bị phân hủy bởi các enzyme nằm trên bề mặt màng tế bào.",
    "d": "Vì steroid có bản chất lipid kị nước nên khuếch tán được qua màng sinh chất.",
    "correct": "d",
    "explain": "Màng sinh chất là lớp lipid kép. Chỉ các chất kị nước (tan trong lipid) như steroid mới đi xuyên qua màng dễ dàng để gặp thụ thể nằm bên trong."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Hiện tượng 'Di nhập gen' (Gene flow) có tác động tích cực nào đối với sự tồn vong của một quần thể sinh vật nhỏ?",
    "a": "Làm tăng sự đồng nhất di truyền giúp quần thể ổn định hơn trước biến động.",
    "b": "Ngăn chặn sự xâm nhập của các cá thể lạ mang mầm bệnh nguy hiểm vào bầy.",
    "c": "Cung cấp các alen mới làm tăng đa dạng di truyền và khả năng thích nghi.",
    "d": "Thúc đẩy quá trình giao phối cận huyết để giữ lại các gen quý giá của loài.",
    "correct": "c",
    "explain": "Quần thể nhỏ dễ bị suy giảm đa dạng di truyền do giao phối gần. Di nhập gen mang đến các biến dị mới, giúp 'làm mới' vốn gen, tăng sức sống cho quần thể."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Vai trò của cấu trúc 'mũ 5'' (5' cap) được gắn vào đầu phân tử mARN sơ khai của sinh vật nhân thực là gì?",
    "a": "Bảo vệ mARN khỏi bị phân hủy và là tín hiệu giúp ribosome gắn vào dịch mã.",
    "b": "Đánh dấu vị trí kết thúc quá trình dịch mã cho ribosome nhận biết và dừng lại.",
    "c": "Giúp enzyme cắt bỏ các đoạn intron không mã hóa ra khỏi phân tử mARN sơ khai.",
    "d": "Làm khuôn mẫu để tổng hợp mạch ADN bổ sung trong quá trình phiên mã ngược lại.",
    "correct": "a",
    "explain": "Mũ 5' (Guanine bị methyl hóa) là tín hiệu nhận diện cho ribosome và bảo vệ đầu 5' của mARN khỏi sự tấn công của các enzyme exonuclease trong tế bào chất."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Tại sao ti thể của người mẹ lại được di truyền nguyên vẹn cho tất cả các con mà không có sự đóng góp của bố?",
    "a": "Do hệ gen của ti thể bố bị gen của mẹ ức chế hoàn toàn không biểu hiện được.",
    "b": "Do ti thể của tinh trùng nằm ở phần cổ đuôi và thường bị bỏ lại khi thụ tinh.",
    "c": "Do ti thể của bố có cấu trúc khác biệt không tương thích với tế bào chất trứng.",
    "d": "Do tế bào trứng tiết ra chất độc tiêu diệt toàn bộ ti thể bố ngay khi xâm nhập.",
    "correct": "b",
    "explain": "Khi thụ tinh, chỉ có nhân của tinh trùng xâm nhập vào trứng. Các bào quan (bao gồm ti thể) nằm ở cổ và đuôi tinh trùng thường không đi vào hợp tử."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Trong hệ sinh thái rừng mưa nhiệt đới, tại sao phần lớn chất dinh dưỡng lại nằm trong sinh khối cây chứ không phải trong đất?",
    "a": "Do đất rừng mưa thường xuyên bị ngập nước nên nghèo dinh dưỡng do rửa trôi.",
    "b": "Do tốc độ phân giải xác hữu cơ rất nhanh và rễ cây hấp thụ lại khoáng ngay.",
    "c": "Do tốc độ phân giải xác thực vật diễn ra rất chậm chạp trong môi trường rừng.",
    "d": "Do vi khuẩn cố định đạm hoạt động kém hiệu quả trong môi trường đất axit này.",
    "correct": "b",
    "explain": "Nhiệt ẩm cao làm vi sinh vật phân giải xác hữu cơ cực nhanh. Rễ cây chằng chịt hấp thụ khoáng ngay khi nó vừa được giải phóng, khiến đất rất nghèo màu mỡ."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Cơ chế 'cảm ứng mật độ' (Quorum sensing) ở vi khuẩn cho phép chúng thực hiện hành vi tập thể nào dưới đây?",
    "a": "Di chuyển tản mạn ra xa nhau để tìm kiếm các nguồn thức ăn mới lạ và dồi dào.",
    "b": "Hình thành màng sinh học (biofilm) bền vững khi số lượng cá thể đủ đông đúc.",
    "c": "Tăng tốc độ phân chia tế bào khi mật độ quần thể còn thưa thớt và ít cạnh tranh.",
    "d": "Trao đổi chất dinh dưỡng trực tiếp giữa các tế bào cạnh nhau qua cầu sinh chất.",
    "correct": "b",
    "explain": "Vi khuẩn tiết ra tín hiệu hóa học. Khi mật độ cao, nồng độ tín hiệu đủ lớn để kích hoạt đồng loạt các gen tạo màng nhầy (biofilm) hoặc độc tố tấn công vật chủ."
  },
  {
    "subject": "Sinh học",
    "difficulty": "hell",
    "content": "Chức năng chính của các 'điểm nóng' (hotspots) đa dạng sinh học trên Trái Đất được các nhà bảo tồn xác định là gì?",
    "a": "Khu vực chứa nhiều loài đặc hữu quý hiếm nhưng đang bị đe dọa mất môi trường.",
    "b": "Nơi có khí hậu ổn định nhất để bảo quản các mẫu vật di truyền của sinh vật.",
    "c": "Vùng đất rộng lớn hoang sơ chưa từng chịu sự tác động của con người hiện đại.",
    "d": "Nơi có năng suất sinh học cao nhất cung cấp lương thực thực phẩm cho con người.",
    "correct": "a",
    "explain": "Hotspot là nơi có tính đa dạng sinh học cực cao (đặc biệt là loài đặc hữu) nhưng đã mất đi phần lớn môi trường sống gốc, cần ưu tiên bảo vệ khẩn cấp."
  },
  
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong quá trình dịch mã, hiện tượng 'Polyribosome' (Polysome) mang lại lợi ích sinh học nào cho tế bào đang hoạt động mạnh?",
    "a": "Giúp một phân tử mARN có thể tổng hợp được nhiều chuỗi polypeptide cùng lúc.",
    "b": "Giúp ribosome di chuyển nhanh hơn trên mARN nhờ sự đẩy của các ribosome sau.",
    "c": "Ngăn chặn các enzyme nuclease phân hủy mARN khi nó đang thực hiện dịch mã.",
    "d": "Tạo ra nhiều loại protein khác nhau từ cùng một khuôn mẫu mARN duy nhất.",
    "correct": "a",
    "explain": "Nhiều ribosome cùng trượt trên một mARN giúp tăng hiệu suất tổng hợp protein lên gấp nhiều lần trong một khoảng thời gian ngắn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Cơ chế nào giúp loài chuột nhảy ở sa mạc (Kangaroo rat) có thể sống cả đời mà không cần uống nước?",
    "a": "Chúng có khả năng hấp thụ hơi nước trực tiếp từ không khí qua da.",
    "b": "Chúng tạo ra nước nội sinh từ quá trình oxy hóa chất béo trong ti thể.",
    "c": "Chúng có tuyến mồ hôi đặc biệt giúp tái hấp thụ nước ngay tại bề mặt da.",
    "d": "Chúng ngủ đông suốt mùa hè để giảm thiểu tối đa nhu cầu trao đổi chất.",
    "correct": "b",
    "explain": "Chuột nhảy có quai Henle cực dài để cô đặc nước tiểu và sử dụng nước chuyển hóa (nước nội sinh) từ hô hấp tế bào để bù đắp nhu cầu nước."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong cấu trúc của kháng thể IgG, vùng biến đổi (V region) đóng vai trò then chốt nào trong phản ứng miễn dịch?",
    "a": "Giúp kháng thể gắn kết với các tế bào thực bào để kích hoạt tiêu diệt.",
    "b": "Tạo ra sự linh động cho phân tử kháng thể khi di chuyển trong máu.",
    "c": "Quyết định tính đặc hiệu kháng nguyên thông qua cấu hình không gian.",
    "d": "Liên kết các chuỗi nặng và chuỗi nhẹ lại với nhau bằng cầu nối disulfide.",
    "correct": "c",
    "explain": "Vùng biến đổi có trình tự axit amin thay đổi rất lớn, tạo ra các 'khe' không gian chỉ khớp duy nhất với một loại kháng nguyên cụ thể."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao các loài thực vật CAM lại có vị chua vào buổi sáng sớm và vị nhạt hơn vào buổi chiều tối?",
    "a": "Do sự thay đổi nồng độ enzyme phân giải đường trong dịch tế bào.",
    "b": "Do sự tích lũy Axit Malic trong không bào vào ban đêm khi cố định CO2.",
    "c": "Do quá trình thoát hơi nước làm cô đặc dịch bào vào thời điểm ban ngày.",
    "d": "Do sự chuyển hóa tinh bột thành đường diễn ra mạnh mẽ khi có ánh sáng.",
    "correct": "b",
    "explain": "Cây CAM cố định CO2 ban đêm tạo thành Axit Malic dự trữ (gây vị chua). Ban ngày, axit này bị phân giải để giải phóng CO2 cho quang hợp (mất vị chua)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong di truyền học quần thể, định luật Hardy-Weinberg chỉ nghiệm đúng khi quần thể thỏa mãn điều kiện lý tưởng nào?",
    "a": "Quần thể có kích thước nhỏ và xảy ra hiện tượng biến động di truyền mạnh.",
    "b": "Có sự di nhập gen từ các quần thể lân cận để làm phong phú vốn gen.",
    "c": "Các cá thể giao phối hoàn toàn ngẫu nhiên và không có chọn lọc tự nhiên.",
    "d": "Tần số đột biến gen xảy ra ở mức độ cao để tạo ra nhiều alen mới lạ.",
    "correct": "c",
    "explain": "Trạng thái cân bằng di truyền chỉ đạt được khi không có các nhân tố tiến hóa (đột biến, chọn lọc, di nhập gen, giao phối không ngẫu nhiên) tác động."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Vai trò của chất hoạt diện (Surfactant) bao phủ bề mặt bên trong các phế nang phổi của động vật có vú là gì?",
    "a": "Tiêu diệt các vi khuẩn và bụi bẩn xâm nhập vào đường hô hấp dưới.",
    "b": "Làm giảm sức căng bề mặt giúp phế nang không bị xẹp lại khi thở ra.",
    "c": "Tăng cường khả năng khuếch tán của khí oxy qua màng tế bào phế nang.",
    "d": "Làm ấm và làm ẩm không khí trước khi thực hiện quá trình trao đổi khí.",
    "correct": "b",
    "explain": "Surfactant (bản chất lipid-protein) làm giảm lực hút giữa các phân tử nước lót phế nang, ngăn phế nang bị co sập, giúp phổi giãn nở dễ dàng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Hiện tượng 'thể Barr' (Barr body) ở tế bào sinh dưỡng của nữ giới là kết quả của cơ chế di truyền nào?",
    "a": "Sự nhân đôi bất thường của nhiễm sắc thể giới tính X trong nguyên phân.",
    "b": "Sự bất hoạt ngẫu nhiên của một trong hai nhiễm sắc thể X để cân bằng gen.",
    "c": "Sự đột biến mất đoạn lớn xảy ra trên nhánh dài của nhiễm sắc thể X.",
    "d": "Sự dung hợp giữa hai nhiễm sắc thể X tạo thành một cấu trúc đậm đặc.",
    "correct": "b",
    "explain": "Cơ chế bù trừ liều lượng gen khiến 1 NST X ở nữ giới bị đóng xoắn chặt và bất hoạt (tạo thể Barr), giúp mức biểu hiện gen cân bằng với nam giới (XY)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong chu trình Nitơ, vi khuẩn phản nitrat hóa (denitrifying bacteria) gây hại cho đất trồng vì chúng thực hiện quá trình nào?",
    "a": "Chuyển hóa đạm amoni (NH4+) thành đạm nitrat (NO3-) dễ rửa trôi.",
    "b": "Phân giải xác hữu cơ thành các chất mùn khó tiêu thụ cho cây trồng.",
    "c": "Chuyển hóa nitrat (NO3-) thành khí nitơ (N2) bay mất vào khí quyển.",
    "d": "Cạnh tranh nguồn khí oxy trong đất với hệ thống rễ của các loài cây.",
    "correct": "c",
    "explain": "Trong điều kiện kị khí (ngập úng), vi khuẩn này dùng NO3- làm chất nhận electron, khử nó thành N2, làm đất bị mất nguồn đạm khoáng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Sự khác biệt về mặt năng lượng giữa quá trình lên men và hô hấp hiếu khí nằm ở giai đoạn quyết định nào?",
    "a": "Giai đoạn đường phân biến đổi glucose thành axit pyruvic.",
    "b": "Giai đoạn chuỗi chuyền điện tử và hóa thẩm thấu tại màng.",
    "c": "Giai đoạn oxy hóa axit pyruvic thành Acetyl-CoA.",
    "d": "Giai đoạn chu trình Krebs phân giải hoàn toàn chất hữu cơ.",
    "correct": "b",
    "explain": "Lên men chỉ dừng lại sau đường phân (tạo 2 ATP). Hô hấp hiếu khí tiếp tục đi vào chuỗi chuyền điện tử (nhờ có O2), tạo ra lượng ATP khổng lồ (30-32 ATP)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao các enzyme giới hạn (Restriction Enzyme) lại không cắt phá ADN của chính vi khuẩn sản sinh ra nó?",
    "a": "Vì vi khuẩn có các protein bao bọc bảo vệ toàn bộ hệ gen của mình.",
    "b": "Vì ADN của vi khuẩn được methyl hóa tại các trình tự nhận biết đặc hiệu.",
    "c": "Vì enzyme giới hạn chỉ hoạt động khi được tiết ra môi trường bên ngoài.",
    "d": "Vì trình tự ADN của vi khuẩn không chứa các điểm cắt của enzyme đó.",
    "correct": "b",
    "explain": "Vi khuẩn bảo vệ ADN của mình bằng cách gắn nhóm methyl (-CH3) vào các điểm cắt. Enzyme giới hạn không thể cắt ADN đã bị methyl hóa."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong cấu trúc của virus cúm, các gai Glycoprotein H (Hemagglutinin) và N (Neuraminidase) có chức năng tương ứng là gì?",
    "a": "H giúp virus bám vào tế bào chủ, N giúp virus con thoát ra khỏi tế bào.",
    "b": "H giúp tổng hợp vỏ protein, N giúp sao chép vật chất di truyền ARN.",
    "c": "H giúp tiêu diệt bạch cầu, N giúp virus di chuyển trong hệ tuần hoàn.",
    "d": "H giúp virus xâm nhập vào nhân, N giúp virus tích hợp gen vào ADN chủ.",
    "correct": "a",
    "explain": "Hemagglutinin giống như chìa khóa mở cửa tế bào. Neuraminidase giống như cái kéo cắt đứt liên kết để virus con giải phóng ra ngoài lây nhiễm tiếp."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Cơ chế 'Sửa sai' (Proofreading) của ADN Polymerase III hoạt động dựa trên hoạt tính enzyme đặc biệt nào?",
    "a": "Hoạt tính polymerase theo chiều 5' đến 3' để tổng hợp lại.",
    "b": "Hoạt tính exonuclease theo chiều 3' đến 5' để cắt bỏ nucleotide sai.",
    "c": "Hoạt tính helicase để tháo xoắn đoạn ADN bị lắp ghép sai lệch.",
    "d": "Hoạt tính ligase để hàn gắn lại các chỗ đứt gãy trên mạch đơn.",
    "correct": "b",
    "explain": "Khi phát hiện lắp sai, ADN Polymerase sẽ lùi lại (theo chiều 3'-5'), cắt bỏ nucleotide sai bằng hoạt tính exonuclease, rồi mới tiếp tục tổng hợp."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao nồng độ O2 trong không khí thở ra lại thấp hơn trong không khí hít vào, nhưng nồng độ N2 lại gần như không đổi?",
    "a": "Vì N2 là khí trơ không tham gia vào quá trình trao đổi khí tại phổi.",
    "b": "Vì N2 có kích thước phân tử quá lớn không thể đi qua màng phế nang.",
    "c": "Vì cơ thể chỉ hấp thụ N2 khi thực hiện quá trình tổng hợp protein.",
    "d": "Vì áp suất riêng phần của N2 trong máu luôn cao hơn trong phế nang.",
    "correct": "a",
    "explain": "Nitơ không phản ứng và không được cơ thể sử dụng/chuyển hóa trong hô hấp, nên lượng đi vào và đi ra là tương đương nhau."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong kỹ thuật lai tạo giống, hiện tượng 'Bất thụ đực' (Male sterility) do gen tế bào chất quy định có ứng dụng gì?",
    "a": "Tạo ra các giống cây trồng không có hạt để tăng giá trị thương phẩm.",
    "b": "Ngăn chặn sự tự thụ phấn, buộc cây phải giao phấn để tạo hạt lai F1.",
    "c": "Làm tăng kích thước của quả do cây không tốn năng lượng tạo phấn.",
    "d": "Giúp cây trồng có khả năng kháng lại các loại sâu bệnh hại phấn hoa.",
    "correct": "b",
    "explain": "Bất thụ đực khiến cây mẹ không tạo được phấn hoa, đảm bảo hạt thu được trên cây mẹ 100% là hạt lai (do nhận phấn từ dòng bố khác), giảm công thiến cây."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Cấu trúc bậc 4 của protein Hemoglobin được hình thành từ sự liên kết của các tiểu đơn vị nào?",
    "a": "Hai chuỗi polypeptide alpha và hai chuỗi polypeptide beta.",
    "b": "Bốn chuỗi polypeptide alpha giống hệt nhau liên kết lại.",
    "c": "Một chuỗi polypeptide alpha xoắn cuộn lại với một nhóm Heme.",
    "d": "Ba chuỗi polypeptide beta liên kết với nhau bằng cầu nối kẽm.",
    "correct": "a",
    "explain": "Hemoglobin là một tetramer gồm 2 chuỗi alpha và 2 chuỗi beta. Mỗi chuỗi gắn với một nhóm Heme chứa sắt, cho phép vận chuyển 4 phân tử O2."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Sự kiện nào đánh dấu mốc quan trọng nhất chuyển đổi từ giai đoạn Tiền sinh học sang giai đoạn Sinh học?",
    "a": "Sự hình thành các hạt coacerva trong đại dương nguyên thủy.",
    "b": "Sự xuất hiện của các phân tử protein có hoạt tính xúc tác.",
    "c": "Sự xuất hiện cơ chế tự nhân đôi của vật chất di truyền.",
    "d": "Sự hình thành lớp màng lipid bao bọc lấy các chất hữu cơ.",
    "correct": "c",
    "explain": "Khả năng tự nhân đôi (bắt đầu có thể là ARN) là ranh giới giữa vật chất vô sinh và sự sống, cho phép thông tin được truyền lại và tiến hóa."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong quang hợp, tại sao hệ sắc tố lại có nhiều loại (diệp lục a, b, carotenoit) mà không chỉ dùng một loại?",
    "a": "Để tạo ra màu sắc sặc sỡ giúp thu hút các loài côn trùng thụ phấn.",
    "b": "Để mở rộng phổ hấp thụ ánh sáng, tận dụng tối đa năng lượng mặt trời.",
    "c": "Để bảo vệ diệp lục a không bị phân hủy bởi cường độ ánh sáng mạnh.",
    "d": "Để tham gia vào các phản ứng quang phân ly nước ở các bước sóng khác nhau.",
    "correct": "b",
    "explain": "Mỗi sắc tố hấp thụ ánh sáng ở một bước sóng khác nhau. Tập hợp nhiều sắc tố giúp cây thu nhận năng lượng từ nhiều vùng quang phổ khác nhau (xanh, đỏ, cam...)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Vai trò của nhân tố phiên mã (Transcription Factor) ở sinh vật nhân thực khác biệt so với nhân sơ ở điểm nào?",
    "a": "Chúng gắn trực tiếp vào mARN để điều khiển quá trình dịch mã.",
    "b": "Chúng cần thiết để giúp enzyme ARN polymerase nhận biết và bám vào promoter.",
    "c": "Chúng chỉ hoạt động ở trong tế bào chất chứ không đi vào trong nhân.",
    "d": "Chúng có khả năng tự xúc tác cho việc tổng hợp các đoạn mồi ARN.",
    "correct": "b",
    "explain": "Ở nhân thực, ARN polymerase không thể tự bám vào promoter. Nó cần một phức hệ các nhân tố phiên mã 'dẫn đường' để khởi động phiên mã."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Hiện tượng 'thống trị ngọn' (apical dominance) ở thực vật là kết quả của sự tương tác đối kháng giữa hai hormone nào?",
    "a": "Gibberellin kích thích chồi bên và Ethylene ức chế chồi ngọn.",
    "b": "Auxin từ chồi ngọn ức chế chồi bên và Cytokinin từ rễ kích thích chồi bên.",
    "c": "Axit Abscisic gây ngủ chồi và Auxin đánh thức chồi hoạt động.",
    "d": "Cytokinin kích thích vươn dài và Auxin kích thích phân chia tế bào.",
    "correct": "b",
    "explain": "Auxin sản xuất ở đỉnh ngọn đi xuống ức chế chồi bên phát triển. Cytokinin từ rễ đi lên kích thích chồi bên. Tỉ lệ Auxin/Cytokinin quyết định hình thái cây."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong hệ sinh thái, 'Quy tắc 10%' về dòng năng lượng giải thích hiện tượng sinh học nào dưới đây?",
    "a": "Tại sao kích thước cơ thể của vật ăn thịt luôn lớn hơn con mồi.",
    "b": "Tại sao chuỗi thức ăn trong tự nhiên thường không quá 4-5 bậc dinh dưỡng.",
    "c": "Tại sao tổng sinh khối của thực vật luôn nhỏ hơn tổng sinh khối động vật.",
    "d": "Tại sao động vật biến nhiệt sử dụng năng lượng hiệu quả hơn động vật hằng nhiệt.",
    "correct": "b",
    "explain": "Năng lượng thất thoát qua mỗi bậc là rất lớn (90%). Do đó, năng lượng đến bậc thứ 5 thường không còn đủ để duy trì một quần thể sinh vật ổn định."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao các tế bào ung thư lại kích thích quá trình tạo mạch máu mới (angiogenesis) xung quanh khối u?",
    "a": "Để cung cấp con đường cho các tế bào ung thư di căn sang cơ quan khác.",
    "b": "Để đảm bảo nguồn cung cấp oxy và dinh dưỡng cho khối u đang lớn nhanh.",
    "c": "Để thải các chất độc hại do tế bào ung thư tạo ra vào dòng máu.",
    "d": "Để thu hút các tế bào miễn dịch đến tiêu diệt khối u (phản ứng viêm).",
    "correct": "b",
    "explain": "Tế bào ung thư phân chia cực nhanh nên nhu cầu dinh dưỡng rất lớn. Nếu không có mạch máu mới, khối u sẽ bị hoại tử vì thiếu đói."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong cấu trúc của nhiễm sắc thể, vùng 'nguyên nhiễm sắc' (Euchromatin) có đặc điểm hoạt động gen như thế nào?",
    "a": "Đóng xoắn chặt chẽ, chứa các gen không hoạt động hoặc ít phiên mã.",
    "b": "Dãn xoắn, bắt màu nhạt và chứa các gen đang hoạt động phiên mã mạnh.",
    "c": "Nằm ở vùng tâm động và đầu mút, đóng vai trò bảo vệ cấu trúc NST.",
    "d": "Chứa các trình tự lặp lại vô nghĩa không mang thông tin di truyền.",
    "correct": "b",
    "explain": "Euchromatin là dạng sợi mảnh, lỏng lẻo, cho phép enzyme phiên mã tiếp cận được gen. Ngược lại, Heterochromatin đóng xoắn chặt và gen bị tắt."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Cơ chế nào giúp tế bào thực vật nhận biết phương hướng của trọng lực để rễ mọc xuống và thân mọc lên?",
    "a": "Sự lắng đọng của các hạt tinh bột (statolith) trong tế bào theo chiều trọng lực.",
    "b": "Sự chênh lệch áp suất thủy tĩnh giữa mặt trên và mặt dưới của các mô cây.",
    "c": "Sự cảm nhận ánh sáng khác nhau giữa phần rễ nằm trong đất và phần thân.",
    "d": "Sự phân bố không đều của các lục lạp bên trong tế bào chất của mô phân sinh.",
    "correct": "a",
    "explain": "Các hạt tinh bột nặng (statolith) trong tế bào chóp rễ sẽ lắng xuống phía dưới theo trọng lực, kích hoạt tín hiệu tái phân bố Auxin gây uốn cong."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao việc sử dụng thuốc trừ sâu hóa học liên tục lại dẫn đến hiện tượng 'bùng phát dịch hại thứ cấp'?",
    "a": "Do thuốc làm sâu hại sinh sản nhanh hơn để bù đắp số lượng đã mất.",
    "b": "Do thuốc vô tình tiêu diệt cả các loài thiên địch tự nhiên của sâu hại.",
    "c": "Do thuốc làm cây trồng yếu đi và mất khả năng đề kháng tự nhiên.",
    "d": "Do thuốc cung cấp nguồn dinh dưỡng kích thích sâu hại phát triển mạnh.",
    "correct": "b",
    "explain": "Thiên địch thường nhạy cảm với thuốc hơn và phục hồi chậm hơn sâu hại. Khi thiên địch chết hết, sâu hại (đã kháng thuốc) sẽ bùng phát không ai kiểm soát."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong quá trình đường phân (Glycolysis), mặc dù tạo ra năng lượng, tại sao tế bào phải đầu tư 2 ATP ở giai đoạn đầu?",
    "a": "Để vận chuyển glucose từ bên ngoài vào bên trong tế bào chất.",
    "b": "Để hoạt hóa phân tử glucose, làm nó kém bền và dễ bị bẻ gãy hơn.",
    "c": "Để ngăn chặn glucose khuếch tán ngược trở lại ra ngoài môi trường.",
    "d": "Để cung cấp nhóm phosphate cho việc tổng hợp các enzyme đường phân.",
    "correct": "b",
    "explain": "Việc gắn phosphate (từ ATP) vào glucose làm tăng năng lượng hoạt hóa, biến nó thành trạng thái không ổn định để dễ dàng bị cắt đôi ở các bước sau."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Vai trò của gen ức chế khối u p53 (Guardian of the genome) trong chu kỳ tế bào là gì?",
    "a": "Thúc đẩy tế bào phân chia nhanh chóng để sửa chữa các mô bị tổn thương.",
    "b": "Phát hiện sai hỏng ADN và ra lệnh ngừng phân chia hoặc kích hoạt tự sát.",
    "c": "Tổng hợp các protein histone giúp đóng gói ADN vào trong nhân tế bào.",
    "d": "Tạo ra các tín hiệu hóa học để thu hút mạch máu đến nuôi dưỡng tế bào.",
    "correct": "b",
    "explain": "p53 là 'người gác cổng'. Nếu ADN hỏng, p53 sẽ chặn chu kỳ tế bào ở G1 để sửa chữa. Nếu không sửa được, p53 kích hoạt apoptosis để loại bỏ tế bào lỗi."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Hiện tượng 'Di truyền liên kết giới tính' (Sex-linked inheritance) khác với 'Di truyền chịu ảnh hưởng của giới tính' ở điểm nào?",
    "a": "Di truyền liên kết giới tính gen nằm trên NST thường nhưng biểu hiện khác nhau.",
    "b": "Di truyền liên kết giới tính gen nằm trên NST giới tính (X hoặc Y).",
    "c": "Di truyền liên kết giới tính chỉ xảy ra ở động vật có vú bậc cao.",
    "d": "Di truyền liên kết giới tính gen chỉ truyền từ bố sang con trai.",
    "correct": "b",
    "explain": "Liên kết giới tính: gen nằm trên X/Y. Chịu ảnh hưởng giới tính: gen nằm trên NST thường nhưng hormone giới tính chi phối mức độ biểu hiện (vd: hói đầu)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao các sinh vật sản xuất ở vùng biển khơi (tảo) thường có kích thước nhỏ bé và vòng đời ngắn?",
    "a": "Để dễ dàng trôi nổi và hấp thụ nhanh các chất dinh dưỡng hòa tan loãng.",
    "b": "Để tránh bị các loài động vật ăn thực vật kích thước lớn phát hiện.",
    "c": "Để giảm thiểu tác động cơ học của sóng biển và các dòng hải lưu mạnh.",
    "d": "Để có thể quang hợp hiệu quả hơn trong điều kiện ánh sáng yếu dưới sâu.",
    "correct": "a",
    "explain": "Kích thước nhỏ làm tăng tỉ lệ S/V, giúp tảo hấp thụ tối đa khoáng chất nghèo nàn trong nước biển và sinh sản nhanh để bù đắp lượng bị ăn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong kỹ thuật tạo cừu Dolly (nhân bản vô tính), tại sao con cừu con lại có đặc điểm di truyền giống hệt cừu cho nhân?",
    "a": "Vì nhân tế bào chứa hầu hết thông tin di truyền quy định tính trạng cơ thể.",
    "b": "Vì tế bào chất của trứng không chứa bất kỳ thông tin di truyền nào quan trọng.",
    "c": "Vì cừu mang thai hộ đã truyền toàn bộ gen của mình cho phôi phát triển.",
    "d": "Vì môi trường nuôi cấy phôi đã làm thay đổi cấu trúc di truyền của tế bào.",
    "correct": "a",
    "explain": "Nhân tế bào tuyến vú (2n) được đưa vào trứng đã mất nhân. Cừu con phát triển từ chỉ dẫn di truyền của bộ nhân này nên giống hệt cừu cho nhân."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Sự kiện 'Đại tuyệt chủng' (Mass extinction) trong lịch sử Trái Đất thường dẫn đến hệ quả tiến hóa nào sau đó?",
    "a": "Sự suy giảm vĩnh viễn của đa dạng sinh học trên toàn bộ hành tinh.",
    "b": "Sự bùng nổ của các nhóm sinh vật còn sót lại vào các ổ sinh thái trống.",
    "c": "Sự ngừng lại hoàn toàn của quá trình tiến hóa trong hàng triệu năm.",
    "d": "Sự xuất hiện trở lại của các loài sinh vật cổ xưa đã bị tuyệt chủng.",
    "correct": "b",
    "explain": "Sau đại tuyệt chủng, nhiều ổ sinh thái bị bỏ trống. Các loài sống sót sẽ tiến hóa nhanh chóng (phân ly thích nghi) để chiếm lĩnh, tạo ra sự đa dạng mới."
  }
]