[
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao tế bào nhân sơ (như vi khuẩn) thường có kích thước nhỏ hơn rất nhiều so với tế bào nhân thực?",
    "a": "Vì chúng không có màng tế bào.",
    "b": "Để thuận lợi cho việc trao đổi chất nhanh và sinh sản nhanh.",
    "c": "Vì chúng sống trong môi trường nước.",
    "d": "Vì chúng không có vật chất di truyền.",
    "correct": "Để thuận lợi cho việc trao đổi chất nhanh và sinh sản nhanh.",
    "explain": "Kích thước nhỏ giúp tỉ lệ diện tích bề mặt/thể tích (S/V) lớn, giúp vi khuẩn trao đổi chất và khuếch tán chất dinh dưỡng cực nhanh để sinh trưởng mạnh."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Nếu loại bỏ thành tế bào của một tế bào thực vật, sau đó ngâm nó vào nước cất, hiện tượng gì sẽ xảy ra?",
    "a": "Tế bào vẫn giữ nguyên hình dạng.",
    "b": "Tế bào sẽ bị co lại (teo bào).",
    "c": "Tế bào sẽ hút nước, trương lên và vỡ ra.",
    "d": "Tế bào sẽ chuyển thành tế bào động vật.",
    "correct": "Tế bào sẽ hút nước, trương lên và vỡ ra.",
    "explain": "Thành tế bào có chức năng bảo vệ và tạo khung cứng. Khi mất thành, tế bào hút nước do chênh lệch nồng độ và sẽ vỡ như tế bào động vật vì màng sinh chất không chịu nổi áp lực."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao Nấm từng được xếp vào giới Thực vật, nhưng ngày nay lại được tách ra thành một giới riêng?",
    "a": "Vì nấm không có rễ, thân, lá thật.",
    "b": "Vì nấm không có lục lạp và sống dị dưỡng (hoại sinh/ký sinh).",
    "c": "Vì nấm sinh sản bằng bào tử.",
    "d": "Vì nấm không thể di chuyển.",
    "correct": "Vì nấm không có lục lạp và sống dị dưỡng (hoại sinh/ký sinh).",
    "explain": "Đặc điểm cốt lõi phân biệt Nấm và Thực vật là dinh dưỡng: Thực vật tự dưỡng (quang hợp), còn Nấm dị dưỡng (hấp thụ chất hữu cơ có sẵn)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Trong một chuyến thám hiểm, bạn tìm thấy một sinh vật lạ: Đơn bào, có nhân hoàn chỉnh, có lục lạp và có khả năng di chuyển. Sinh vật này có khả năng cao nhất thuộc giới nào?",
    "a": "Giới Khởi sinh (Vi khuẩn).",
    "b": "Giới Thực vật.",
    "c": "Giới Nguyên sinh (Nguyên sinh vật).",
    "d": "Giới Nấm.",
    "correct": "Giới Nguyên sinh (Nguyên sinh vật).",
    "explain": "Vi khuẩn không có nhân hoàn chỉnh. Thực vật và Nấm không di chuyển. Nguyên sinh vật (như trùng roi) có đặc điểm giao thoa: vừa tự dưỡng (giống cây), vừa di chuyển (giống động vật)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao thuốc kháng sinh Penicillin tiêu diệt được vi khuẩn nhưng lại không có tác dụng với virus?",
    "a": "Vì virus có kích thước quá nhỏ.",
    "b": "Vì virus di chuyển quá nhanh trong máu.",
    "c": "Vì virus không có cấu tạo tế bào và không có quá trình trao đổi chất tự thân.",
    "d": "Vì virus có lớp vỏ protein rất dày.",
    "correct": "Vì virus không có cấu tạo tế bào và không có quá trình trao đổi chất tự thân.",
    "explain": "Kháng sinh thường tác động vào thành tế bào hoặc quá trình trao đổi chất của vi khuẩn. Virus không phải là tế bào, sống ký sinh hoàn toàn nên kháng sinh không có đích để tấn công."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Lục lạp trong tế bào thực vật đóng vai trò như một 'nhà máy năng lượng' kiểu nào?",
    "a": "Chuyển hóa năng lượng hóa học thành cơ năng.",
    "b": "Chuyển hóa quang năng (ánh sáng) thành hóa năng (chất hữu cơ).",
    "c": "Phân giải chất hữu cơ để giải phóng năng lượng nhiệt.",
    "d": "Lưu trữ nước và muối khoáng.",
    "correct": "Chuyển hóa quang năng (ánh sáng) thành hóa năng (chất hữu cơ).",
    "explain": "Lục lạp thực hiện quang hợp, hấp thu ánh sáng mặt trời để tổng hợp chất hữu cơ, tức là biến năng lượng ánh sáng thành năng lượng hóa học."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Một nhà khoa học muốn tạo ra một loại thuốc diệt cỏ mới. Để thuốc chỉ tác động lên cây cỏ mà không ảnh hưởng đến động vật và con người, thuốc đó nên ức chế thành phần nào?",
    "a": "Ti thể.",
    "b": "Màng sinh chất.",
    "c": "Nhân tế bào.",
    "d": "Lục lạp.",
    "correct": "Lục lạp.",
    "explain": "Lục lạp chỉ có ở thực vật. Nếu thuốc tấn công Ti thể, Màng hay Nhân thì cả tế bào động vật (người) cũng bị ảnh hưởng vì chúng đều có các bào quan này."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao Rêu thường chỉ mọc được ở những nơi ẩm ướt và có kích thước nhỏ bé?",
    "a": "Vì chúng chưa có mạch dẫn (mạch gỗ và mạch rây) và thụ tinh cần nước.",
    "b": "Vì chúng không có diệp lục để quang hợp mạnh.",
    "c": "Vì chúng bị các loài thực vật khác che khuất.",
    "d": "Vì rễ của chúng quá dài cắm sâu vào đất.",
    "correct": "Vì chúng chưa có mạch dẫn (mạch gỗ và mạch rây) và thụ tinh cần nước.",
    "explain": "Chưa có mạch dẫn khiến nước không thể vận chuyển lên cao (cây thấp bé). Quá trình thụ tinh của rêu cần tinh trùng bơi trong nước đến gặp noãn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Sự khác biệt mang tính tiến hóa quan trọng nhất giữa Dương xỉ và Rêu là gì?",
    "a": "Dương xỉ có rễ thật và hệ thống mạch dẫn.",
    "b": "Dương xỉ sống hoàn toàn trên cạn khô cằn.",
    "c": "Dương xỉ có hạt để sinh sản.",
    "d": "Dương xỉ có hoa và quả.",
    "correct": "Dương xỉ có rễ thật và hệ thống mạch dẫn.",
    "explain": "Bước tiến hóa lớn của Dương xỉ so với Rêu là sự xuất hiện của hệ thống mạch dẫn và rễ thật, giúp chúng vươn cao hơn và hấp thụ nước tốt hơn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao Cây Thông được gọi là cây Hạt trần?",
    "a": "Vì hạt của nó không có vỏ cứng bảo vệ.",
    "b": "Vì nó không có lá bao bọc quanh cành.",
    "c": "Vì hạt nằm lộ trên các lá noãn hở, chưa được thịt quả bao bọc.",
    "d": "Vì hạt của nó rụng xuống đất ngay khi hình thành.",
    "correct": "Vì hạt nằm lộ trên các lá noãn hở, chưa được thịt quả bao bọc.",
    "explain": "Hạt trần nghĩa là hạt 'cởi trần', nằm lộ ra ngoài trên các lá noãn (ở nón thông), khác với hạt kín là hạt được giấu kín bên trong quả."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Địa y là một dạng sống đặc biệt, là minh chứng cho mối quan hệ nào?",
    "a": "Ký sinh (Một bên lợi, một bên hại).",
    "b": "Cộng sinh (Cả hai cùng có lợi và không thể tách rời).",
    "c": "Hội sinh (Một bên lợi, một bên không sao).",
    "d": "Cạnh tranh (Cả hai cùng tranh giành thức ăn).",
    "correct": "Cộng sinh (Cả hai cùng có lợi và không thể tách rời).",
    "explain": "Địa y là sự cộng sinh giữa Nấm (hút nước, muối khoáng, bảo vệ) và Tảo/Vi khuẩn lam (quang hợp tạo chất hữu cơ). Tách ra cả hai thường sẽ chết."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Nếu tiêu diệt hết vi khuẩn trong đường ruột của con người, điều gì sẽ xảy ra?",
    "a": "Con người sẽ khỏe mạnh hơn vì không còn nguy cơ nhiễm bệnh.",
    "b": "Hệ tiêu hóa gặp khó khăn vì mất đi vi khuẩn lợi hỗ trợ tiêu hóa và tổng hợp vitamin.",
    "c": "Dạ dày sẽ tiết ra nhiều axit hơn.",
    "d": "Không có ảnh hưởng gì lớn.",
    "correct": "Hệ tiêu hóa gặp khó khăn vì mất đi vi khuẩn lợi hỗ trợ tiêu hóa và tổng hợp vitamin.",
    "explain": "Trong ruột có hệ vi sinh vật cộng sinh (lợi khuẩn) giúp tiêu hóa chất xơ, tổng hợp vitamin K, B... Tiêu diệt hết sẽ gây rối loạn tiêu hóa nghiêm trọng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao nói virus nằm ở ranh giới giữa vật sống và vật không sống?",
    "a": "Vì chúng có thể di chuyển nhưng không ăn uống.",
    "b": "Vì khi ở ngoài tế bào chủ, chúng như hạt tinh thể vô sinh; chỉ khi vào vật chủ mới biểu hiện sự sống.",
    "c": "Vì chúng có cấu tạo từ kim loại và chất hữu cơ.",
    "d": "Vì chúng sống rất lâu trong môi trường chân không.",
    "correct": "Vì khi ở ngoài tế bào chủ, chúng như hạt tinh thể vô sinh; chỉ khi vào vật chủ mới biểu hiện sự sống.",
    "explain": "Virus không có trao đổi chất, không tự sinh sản được nếu không chui vào tế bào vật chủ. Khi ở ngoài, chúng trơ như vật chất vô cơ."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tảo lục (sống dưới nước) và Cây dương xỉ (sống trên cạn) có đặc điểm chung nào chứng tỏ chúng cùng thuộc nhóm sinh vật tự dưỡng?",
    "a": "Đều có hệ thống mạch dẫn.",
    "b": "Đều có bào tử.",
    "c": "Đều chứa diệp lục và có khả năng quang hợp.",
    "d": "Đều có rễ thật.",
    "correct": "Đều chứa diệp lục và có khả năng quang hợp.",
    "explain": "Đặc điểm căn bản của thực vật và tảo (tự dưỡng) là sở hữu sắc tố quang hợp (diệp lục) để tự tổng hợp chất hữu cơ từ ánh sáng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao khi muối dưa cà, người ta thường dùng nước ấm và cho thêm một chút đường?",
    "a": "Để dưa cà có vị ngọt dễ ăn.",
    "b": "Để tiêu diệt các vi khuẩn gây thối.",
    "c": "Để tạo môi trường thuận lợi cho vi khuẩn lactic hoạt động nhanh hơn.",
    "d": "Để làm mềm dưa cà.",
    "correct": "Để tạo môi trường thuận lợi cho vi khuẩn lactic hoạt động nhanh hơn.",
    "explain": "Vi khuẩn lactic lên men kị khí, cần nhiệt độ ấm để sinh trưởng và cần đường làm thức ăn ban đầu để tạo ra axit lactic làm chua dưa."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Trong khóa lưỡng phân, nguyên tắc quan trọng nhất để phân chia các nhóm sinh vật là gì?",
    "a": "Dựa vào kích thước từ nhỏ đến lớn.",
    "b": "Dựa vào các đặc điểm đối lập nhau (Có hoặc Không có).",
    "c": "Dựa vào màu sắc cơ thể.",
    "d": "Dựa vào môi trường sống.",
    "correct": "Dựa vào các đặc điểm đối lập nhau (Có hoặc Không có).",
    "explain": "Khóa lưỡng phân hoạt động bằng cách tách sinh vật thành 2 nhóm dựa trên một cặp đặc điểm trái ngược (Ví dụ: Có chân vs Không có chân) để loại trừ dần."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Khi quan sát một tế bào dưới kính hiển vi, bạn thấy có thành tế bào và không bào lớn trung tâm nhưng không thấy lục lạp. Đó có thể là tế bào nào?",
    "a": "Tế bào lá cây xanh.",
    "b": "Tế bào biểu bì vảy hành (củ hành tây).",
    "c": "Tế bào cơ người.",
    "d": "Tế bào vi khuẩn.",
    "correct": "Tế bào biểu bì vảy hành (củ hành tây).",
    "explain": "Tế bào củ hành là tế bào thực vật (có thành, không bào) nhưng nằm dưới đất/trong củ không tiếp xúc ánh sáng nên không phát triển lục lạp."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao Cá voi xanh có kích thước khổng lồ nhưng lại ăn những sinh vật phù du nhỏ bé?",
    "a": "Vì răng của chúng quá yếu không nhai được thịt.",
    "b": "Vì cấu tạo miệng lọc (tấm sừng) thích nghi với kiểu ăn lọc số lượng lớn.",
    "c": "Vì chúng bơi chậm không bắt được cá lớn.",
    "d": "Vì sinh vật phù du chứa nhiều chất độc giết chết các loài khác.",
    "correct": "Vì cấu tạo miệng lọc (tấm sừng) thích nghi với kiểu ăn lọc số lượng lớn.",
    "explain": "Cá voi xanh không có răng nhọn để cắn xé mà có tấm sừng để lọc hàng tấn nước, giữ lại lượng lớn sinh vật phù du, đây là sự thích nghi về dinh dưỡng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Đặc điểm nào khiến Ếch đồng (Lưỡng cư) bắt buộc phải sống ở những nơi ẩm ướt, gần bờ nước?",
    "a": "Vì chân của chúng có màng bơi.",
    "b": "Vì chúng hô hấp chủ yếu qua da, da cần ẩm để trao đổi khí.",
    "c": "Vì chúng cần uống nước liên tục.",
    "d": "Vì mắt của chúng không nhìn thấy trên cạn.",
    "correct": "Vì chúng hô hấp chủ yếu qua da, da cần ẩm để trao đổi khí.",
    "explain": "Phổi ếch chưa phát triển hoàn thiện, hô hấp qua da là chính. Nếu da khô, ếch không trao đổi khí được và sẽ chết ngạt."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao Giun đất được coi là 'chiếc cày sinh học' của nhà nông?",
    "a": "Vì chúng ăn rễ cây dại.",
    "b": "Vì phân của chúng chứa chất độc diệt sâu bọ.",
    "c": "Vì chúng đào hang làm đất tơi xốp và phân của chúng giàu dinh dưỡng.",
    "d": "Vì chúng báo hiệu trời sắp mưa.",
    "correct": "Vì chúng đào hang làm đất tơi xốp và phân của chúng giàu dinh dưỡng.",
    "explain": "Hoạt động di chuyển của giun tạo khe hở khí cho đất, đồng thời hệ tiêu hóa của giun biến rác hữu cơ thành phân bón dễ hấp thu cho cây."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "San hô là động vật thuộc ngành Ruột khoang, nhưng tại sao các rạn san hô thường chỉ phân bố ở vùng biển nước nông, có ánh sáng?",
    "a": "Vì san hô cần ánh sáng để nhìn thấy mồi.",
    "b": "Vì san hô cộng sinh với tảo đơn bào, mà tảo cần ánh sáng để quang hợp.",
    "c": "Vì nước sâu quá lạnh san hô không sống được.",
    "d": "Vì áp suất nước sâu làm vỡ khung xương san hô.",
    "correct": "Vì san hô cộng sinh với tảo đơn bào, mà tảo cần ánh sáng để quang hợp.",
    "explain": "Màu sắc và dinh dưỡng của san hô phần lớn đến từ tảo cộng sinh. Tảo cần quang hợp nên san hô phải sống ở vùng nước nông có ánh sáng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Nhện không được xếp vào lớp Sâu bọ (Côn trùng) vì lý do chính nào về cấu tạo?",
    "a": "Nhện không có cánh và có 4 đôi chân (Côn trùng có 3 đôi).",
    "b": "Nhện có khả năng giăng tơ.",
    "c": "Nhện có kích thước lớn hơn.",
    "d": "Nhện ăn thịt.",
    "correct": "Nhện không có cánh và có 4 đôi chân (Côn trùng có 3 đôi).",
    "explain": "Đặc điểm phân loại: Côn trùng có 3 đôi chân, cơ thể 3 phần. Hình nhện (nhện, bọ cạp) có 4 đôi chân, cơ thể 2 phần."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Vì sao Cá sấu đẻ trứng, có vảy sừng nhưng lại được xếp vào Bò sát chứ không phải Lưỡng cư?",
    "a": "Vì cá sấu sống chủ yếu dưới nước.",
    "b": "Vì trứng cá sấu có vỏ đá vôi và cá sấu hô hấp hoàn toàn bằng phổi.",
    "c": "Vì cá sấu có kích thước rất lớn.",
    "d": "Vì cá sấu ăn thịt.",
    "correct": "Vì trứng cá sấu có vỏ đá vôi và cá sấu hô hấp hoàn toàn bằng phổi.",
    "explain": "Lưỡng cư đẻ trứng màng mềm dưới nước và hô hấp bằng da/phổi. Bò sát (cá sấu) tiến hóa hơn: trứng có vỏ cứng (đẻ trên cạn được) và phổi hoàn thiện."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Cơ chế nào giúp cơ thể người tạo ra miễn dịch sau khi tiêm vắc-xin?",
    "a": "Vắc-xin là thuốc tiêu diệt mầm bệnh có sẵn.",
    "b": "Vắc-xin chứa mầm bệnh đã suy yếu, kích thích cơ thể 'tập trận' sinh ra kháng thể.",
    "c": "Vắc-xin cung cấp chất dinh dưỡng để bạch cầu khỏe mạnh.",
    "d": "Vắc-xin tạo một lớp màng bảo vệ tế bào.",
    "correct": "Vắc-xin chứa mầm bệnh đã suy yếu, kích thích cơ thể 'tập trận' sinh ra kháng thể.",
    "explain": "Vắc-xin đưa kháng nguyên (giả định) vào để hệ miễn dịch nhận diện và ghi nhớ. Khi gặp mầm bệnh thật, cơ thể đã có sẵn 'vũ khí' (kháng thể) để tiêu diệt ngay."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao nói: 'Rừng là lá phổi xanh của Trái Đất'?",
    "a": "Vì rừng có màu xanh lục.",
    "b": "Vì hình dáng khu rừng giống lá phổi.",
    "c": "Vì rừng quang hợp hấp thụ CO2 và thải O2, điều hòa khí hậu.",
    "d": "Vì rừng là nơi sinh sống của nhiều loài động vật.",
    "correct": "Vì rừng quang hợp hấp thụ CO2 và thải O2, điều hòa khí hậu.",
    "explain": "Chức năng trao đổi khí khổng lồ của rừng (lấy khí thải CO2, trả lại khí dưỡng O2) tương tự chức năng hô hấp của lá phổi."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Trong quy tắc gọi tên khoa học (Ví dụ: *Panthera leo* - Sư tử), từ thứ hai (*leo*) biểu thị cho cấp độ phân loại nào?",
    "a": "Tên Chi (Giống).",
    "b": "Tên Loài (tính từ mô tả).",
    "c": "Tên Họ.",
    "d": "Tên người phát hiện.",
    "correct": "Tên Loài (tính từ mô tả).",
    "explain": "Tên khoa học gồm 2 phần: Phần đầu là tên Chi (viết hoa), phần sau là tên Loài/tính từ mô tả (viết thường)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Nếu loại bỏ hết các loài động vật ăn thịt (như Hổ, Báo) ra khỏi một hệ sinh thái rừng, hậu quả đầu tiên có thể là gì?",
    "a": "Hệ sinh thái sẽ phát triển bền vững hơn.",
    "b": "Số lượng động vật ăn cỏ (Nai, Thỏ) tăng đột biến gây phá hủy thảm thực vật.",
    "c": "Cây cối sẽ phát triển rậm rạp hơn.",
    "d": "Các loài sâu bọ sẽ biến mất.",
    "correct": "Số lượng động vật ăn cỏ (Nai, Thỏ) tăng đột biến gây phá hủy thảm thực vật.",
    "explain": "Mất đi mắt xích kiểm soát (vật dữ), động vật ăn cỏ sẽ sinh sản mất kiểm soát, ăn hết cây cỏ, dẫn đến mất cân bằng sinh thái."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Cây Lúa (Hạt kín) và Cây Rêu khác nhau cơ bản ở điểm nào về sinh sản?",
    "a": "Lúa sinh sản bằng hạt, Rêu sinh sản bằng bào tử.",
    "b": "Lúa sinh sản vô tính, Rêu sinh sản hữu tính.",
    "c": "Lúa sinh sản bằng bào tử, Rêu sinh sản bằng hạt.",
    "d": "Cả hai đều sinh sản bằng hạt nhưng hạt rêu nhỏ hơn.",
    "correct": "Lúa sinh sản bằng hạt, Rêu sinh sản bằng bào tử.",
    "explain": "Rêu là thực vật bậc thấp chưa có hạt (sinh sản bằng bào tử). Lúa là thực vật bậc cao (Hạt kín) sinh sản bằng hạt được bảo vệ trong quả."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao trong nuôi trồng thủy sản, người ta thường lắp máy sục khí vào hồ nước?",
    "a": "Để tạo dòng chảy cho cá tập bơi.",
    "b": "Để làm mát nước.",
    "c": "Để tăng nồng độ khí Oxygen hòa tan trong nước cho tôm cá hô hấp.",
    "d": "Để đuổi các loài chim săn cá.",
    "correct": "Để tăng nồng độ khí Oxygen hòa tan trong nước cho tôm cá hô hấp.",
    "explain": "Oxy hòa tan trong nước ít hơn không khí. Mật độ nuôi cao làm thiếu oxy, sục khí giúp khuếch tán oxy từ không khí vào nước."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Trùng biến hình (Amoeba) di chuyển và bắt mồi bằng cách nào?",
    "a": "Dùng lông bơi gạt thức ăn vào miệng.",
    "b": "Dùng roi xoáy vào nước.",
    "c": "Hình thành chân giả bao vây và nuốt con mồi (thực bào).",
    "d": "Tiết chất độc làm tê liệt con mồi từ xa.",
    "correct": "Hình thành chân giả bao vây và nuốt con mồi (thực bào).",
    "explain": "Trùng biến hình thay đổi hình dạng tế bào chất tạo thành các chân giả giả để di chuyển và bao lấy con mồi, tiêu hóa trong không bào."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao Cá voi và Cá heo lại có hình dáng cơ thể thon dài giống loài cá dù chúng là Thú?",
    "a": "Vì chúng có họ hàng gần với cá mập.",
    "b": "Đây là hiện tượng 'đồng quy tính trạng' để thích nghi với việc bơi lội giảm ma sát trong nước.",
    "c": "Vì chúng bị biến đổi gen do sống dưới biển sâu.",
    "d": "Vì chúng hô hấp bằng mang giống cá.",
    "correct": "Đây là hiện tượng 'đồng quy tính trạng' để thích nghi với việc bơi lội giảm ma sát trong nước.",
    "explain": "Dù nguồn gốc khác nhau, nhưng do cùng sống trong môi trường nước, chọn lọc tự nhiên đã giữ lại kiểu hình thon dài (hình ngư lôi) để di chuyển hiệu quả nhất."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Một người nông dân nhận thấy cây trong vườn bị vàng lá, còi cọc dù tưới đủ nước. Nguyên nhân khả dĩ nhất liên quan đến chức năng của rễ là gì?",
    "a": "Rễ cây bị thừa nước gây ngạt.",
    "b": "Lông hút của rễ bị tổn thương hoặc đất thiếu muối khoáng cần thiết.",
    "c": "Lá cây thoát hơi nước quá mạnh.",
    "d": "Cây bị thiếu ánh sáng.",
    "correct": "Lông hút của rễ bị tổn thương hoặc đất thiếu muối khoáng cần thiết.",
    "explain": "Lông hút là nơi hấp thụ khoáng. Nếu đất đủ nước nhưng thiếu khoáng (như Nitơ, Magie) hoặc lông hút hỏng, cây không tổng hợp được diệp lục dẫn đến vàng lá."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao Trùng roi xanh (Euglena) lại tập trung về phía có ánh sáng?",
    "a": "Để sưởi ấm cơ thể.",
    "b": "Nhờ điểm mắt cảm nhận ánh sáng, giúp chúng di chuyển đến nơi có ánh sáng để quang hợp.",
    "c": "Để trốn tránh kẻ thù trong bóng tối.",
    "d": "Để tìm kiếm thức ăn là các vi khuẩn phát sáng.",
    "correct": "Nhờ điểm mắt cảm nhận ánh sáng, giúp chúng di chuyển đến nơi có ánh sáng để quang hợp.",
    "explain": "Trùng roi có khả năng tự dưỡng nhờ diệp lục. Điểm mắt giúp định hướng nguồn sáng để tối ưu hóa quá trình quang hợp."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Vì sao khi làm bánh mì, người ta phải ủ bột với nấm men một thời gian trước khi nướng?",
    "a": "Để nấm men tiêu thụ hết đường trong bột.",
    "b": "Để nấm men hô hấp sinh ra khí CO2 làm bột nở xốp.",
    "c": "Để nấm men tạo ra vị chua cho bánh.",
    "d": "Để diệt các vi khuẩn có hại trong bột.",
    "correct": "Để nấm men hô hấp sinh ra khí CO2 làm bột nở xốp.",
    "explain": "Trong quá trình lên men, nấm men giải phóng khí Carbon dioxide (CO2). Khí này bị giữ lại trong khối bột tạo thành các lỗ rỗng, làm bánh nở và xốp."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Nếu bắt một con Giun đất để lên mặt đường khô ráo vào ngày nắng, nó sẽ chết rất nhanh. Tại sao?",
    "a": "Vì nó không chịu được ánh sáng mạnh làm mù mắt.",
    "b": "Vì da bị khô, không thể trao đổi khí (ngạt thở).",
    "c": "Vì nó không tìm được thức ăn.",
    "d": "Vì nó không di chuyển được trên mặt phẳng cứng.",
    "correct": "Vì da bị khô, không thể trao đổi khí (ngạt thở).",
    "explain": "Giun đất hô hấp qua da. Da phải ẩm ướt thì khí Oxy mới khuếch tán vào máu được. Da khô đồng nghĩa với việc ngừng hô hấp."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Đặc điểm cấu tạo nào của Chim bồ câu giúp giảm trọng lượng cơ thể tối đa để thích nghi với sự bay?",
    "a": "Có lông vũ bao phủ.",
    "b": "Xương rỗng (xốp) và không có bóng đái (không trữ nước tiểu).",
    "c": "Có cánh rộng.",
    "d": "Ăn hạt thay vì ăn thịt.",
    "correct": "Xương rỗng (xốp) và không có bóng đái (không trữ nước tiểu).",
    "explain": "Xương rỗng làm giảm khối lượng bộ xương. Không có bóng đái giúp cơ thể không phải mang thêm trọng lượng của chất thải lỏng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao thực vật Hạt kín (như Cây Cam) lại tiến hóa và phân bố rộng rãi hơn thực vật Hạt trần (như Cây Thông)?",
    "a": "Vì chúng có rễ cọc cắm sâu hơn.",
    "b": "Vì hạt được bảo vệ trong quả và có hoa thu hút côn trùng thụ phấn hiệu quả.",
    "c": "Vì chúng sống được ở vùng cực lạnh.",
    "d": "Vì lá của chúng không rụng vào mùa đông.",
    "correct": "Vì hạt được bảo vệ trong quả và có hoa thu hút côn trùng thụ phấn hiệu quả.",
    "explain": "Quả bảo vệ hạt và giúp phát tán hạt đi xa (nhờ động vật ăn quả). Thụ phấn nhờ côn trùng cũng chính xác hơn thụ phấn nhờ gió của hạt trần."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Trong một hệ sinh thái, nếu số lượng Mèo rừng (vật tiêu thụ bậc 2) bị giảm mạnh, điều gì sẽ xảy ra với số lượng Thỏ (vật tiêu thụ bậc 1)?",
    "a": "Số lượng Thỏ sẽ giảm theo.",
    "b": "Số lượng Thỏ sẽ tăng lên nhanh chóng, sau đó giảm do thiếu thức ăn.",
    "c": "Số lượng Thỏ không đổi.",
    "d": "Thỏ sẽ chuyển sang ăn thịt.",
    "correct": "Số lượng Thỏ sẽ tăng lên nhanh chóng, sau đó giảm do thiếu thức ăn.",
    "explain": "Mất kẻ thù tự nhiên, Thỏ sinh sản nhanh. Nhưng khi quá đông, chúng ăn hết cỏ (thức ăn) và sẽ chết đói hoặc bệnh tật, làm số lượng giảm lại."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao khi trồng các loại cây dây leo (mướp, bầu), người ta thường phải làm giàn?",
    "a": "Để quả không chạm đất bị thối.",
    "b": "Để thân cây có chỗ bám, vươn lên đón ánh sáng quang hợp tốt hơn.",
    "c": "Để rễ cây bám chặt hơn.",
    "d": "Để dễ thu hoạch.",
    "correct": "Để thân cây có chỗ bám, vươn lên đón ánh sáng quang hợp tốt hơn.",
    "explain": "Thân leo mềm yếu không tự đứng thẳng được. Giàn giúp chúng leo lên cao, tránh bị che khuất, tối ưu hóa việc nhận ánh sáng mặt trời."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Sán lá gan sống ký sinh trong gan trâu bò. Đặc điểm cấu tạo nào giúp chúng thích nghi với lối sống này?",
    "a": "Có mắt rất tinh để tìm thức ăn.",
    "b": "Giác bám phát triển để bám chặt vật chủ, cơ quan tiêu hóa tiêu giảm.",
    "c": "Có chân bơi để di chuyển trong máu.",
    "d": "Có lớp vỏ cứng chống lại axit dạ dày.",
    "correct": "Giác bám phát triển để bám chặt vật chủ, cơ quan tiêu hóa tiêu giảm.",
    "explain": "Sống trong môi trường giàu dinh dưỡng (gan/máu), sán không cần tiêu hóa phức tạp (tiêu giảm) nhưng cần bám chắc để không bị đào thải (giác bám)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao nói vi khuẩn có vai trò 'kép' trong đời sống con người?",
    "a": "Vì chúng vừa sống trên cạn vừa sống dưới nước.",
    "b": "Vì chúng vừa có lợi (lên men, phân hủy rác) vừa có hại (gây bệnh, làm hỏng thức ăn).",
    "c": "Vì chúng có thể biến đổi thành virus.",
    "d": "Vì chúng vừa quang hợp vừa dị dưỡng.",
    "correct": "Vì chúng vừa có lợi (lên men, phân hủy rác) vừa có hại (gây bệnh, làm hỏng thức ăn).",
    "explain": "Vi khuẩn không hoàn toàn xấu. Vai trò kép ám chỉ hai mặt đối lập: lợi ích trong công nghiệp/môi trường và tác hại về y tế/bảo quản."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Để bảo quản thực phẩm lâu dài, phương pháp đông lạnh (để trong ngăn đá) hoạt động dựa trên nguyên lý nào?",
    "a": "Tiêu diệt hoàn toàn vi khuẩn bằng nhiệt độ thấp.",
    "b": "Ức chế, làm chậm sự sinh trưởng và sinh sản của vi khuẩn.",
    "c": "Làm mất nước của vi khuẩn.",
    "d": "Tạo ra chất độc giết vi khuẩn.",
    "correct": "Ức chế, làm chậm sự sinh trưởng và sinh sản của vi khuẩn.",
    "explain": "Nhiệt độ thấp không nhất thiết giết chết vi khuẩn (chúng có thể ngủ đông) mà chỉ làm chậm quá trình trao đổi chất, khiến chúng không thể phân chia gây hỏng thức ăn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao Tôm (Giáp xác) phải lột xác nhiều lần trong đời?",
    "a": "Để thay lớp vỏ mới đẹp hơn.",
    "b": "Vì lớp vỏ kitin cứng không lớn theo cơ thể được, phải vứt bỏ để cơ thể lớn lên.",
    "c": "Để loại bỏ ký sinh trùng bám trên vỏ.",
    "d": "Để chữa lành vết thương.",
    "correct": "Vì lớp vỏ kitin cứng không lớn theo cơ thể được, phải vứt bỏ để cơ thể lớn lên.",
    "explain": "Vỏ kitin ngấm canxi giống như một bộ giáp cứng, cản trở sự tăng trưởng. Tôm phải lột bỏ vỏ cũ, cơ thể lớn nhanh trong lúc vỏ mới còn mềm."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Thực vật Một lá mầm (như Lúa, Ngô) và Hai lá mầm (như Đậu, Xoài) KHÔNG phân biệt nhau ở đặc điểm nào sau đây?",
    "a": "Số lá mầm trong hạt.",
    "b": "Kiểu gân lá (song song vs hình mạng).",
    "c": "Kiểu rễ (chùm vs cọc).",
    "d": "Khả năng quang hợp.",
    "correct": "Khả năng quang hợp.",
    "explain": "Cả hai nhóm đều quang hợp như nhau. Sự khác biệt nằm ở cấu trúc hình thái: số lá mầm, gân lá, rễ, số cánh hoa..."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao khi trồng cây trong nhà kính, người ta thường thắp đèn vào ban đêm?",
    "a": "Để sưởi ấm cho cây.",
    "b": "Để cây tiếp tục quang hợp, tăng năng suất tạo chất hữu cơ.",
    "c": "Để đuổi côn trùng hại.",
    "d": "Để cây không 'ngủ'.",
    "correct": "Để cây tiếp tục quang hợp, tăng năng suất tạo chất hữu cơ.",
    "explain": "Quang hợp cần ánh sáng. Thắp đèn ban đêm kéo dài thời gian quang hợp, giúp cây tổng hợp được nhiều chất dinh dưỡng hơn, lớn nhanh hơn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Bệnh sốt rét do trùng sốt rét gây ra thường bùng phát mạnh ở vùng nhiệt đới ẩm thấp. Nguyên nhân sâu xa là gì?",
    "a": "Do khí hậu nóng làm trùng sốt rét sinh sản nhanh.",
    "b": "Do môi trường này thuận lợi cho muỗi Anopheles (vật chủ trung gian) sinh sôi.",
    "c": "Do người dân ở đây có sức đề kháng yếu.",
    "d": "Do nguồn nước bị ô nhiễm.",
    "correct": "Do môi trường này thuận lợi cho muỗi Anopheles (vật chủ trung gian) sinh sôi.",
    "explain": "Trùng sốt rét cần muỗi để truyền bệnh. Vùng ẩm thấp nhiều ao tù nước đọng là nơi lý tưởng cho muỗi đẻ trứng, dẫn đến dịch bệnh lây lan."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Nếu quan sát một mẫu nước ao dưới kính hiển vi và thấy một sinh vật màu xanh, di chuyển bằng cách bơi, nhưng khi cho vào bóng tối lâu ngày nó bị mất màu xanh. Đó là sinh vật nào?",
    "a": "Tảo lục.",
    "b": "Trùng giày.",
    "c": "Trùng roi xanh.",
    "d": "Vi khuẩn lam.",
    "correct": "Trùng roi xanh.",
    "explain": "Trùng roi xanh có diệp lục. Khi ở trong tối lâu, hạt diệp lục bị tiêu biến, chúng chuyển sang sống dị dưỡng (ăn chất hữu cơ) và mất màu xanh."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Cơ thể con người được cấu tạo từ hàng tỷ tế bào, nhưng tất cả đều bắt nguồn từ một tế bào ban đầu. Đó là tế bào nào?",
    "a": "Tế bào trứng.",
    "b": "Tế bào tinh trùng.",
    "c": "Hợp tử.",
    "d": "Tế bào gốc.",
    "correct": "Hợp tử.",
    "explain": "Sự thụ tinh giữa trứng và tinh trùng tạo thành Hợp tử. Từ 1 tế bào hợp tử này phân chia và biệt hóa thành toàn bộ cơ thể."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao Ốc sên (Thân mềm) thường tiết ra chất nhầy khi di chuyển?",
    "a": "Để đánh dấu lãnh thổ.",
    "b": "Để giảm ma sát giữa cơ thể mềm với mặt đất gồ ghề.",
    "c": "Để làm thức ăn dự trữ.",
    "d": "Để thu hút bạn tình.",
    "correct": "Để giảm ma sát giữa cơ thể mềm với mặt đất gồ ghề.",
    "explain": "Cơ thể thân mềm rất dễ tổn thương. Chất nhầy đóng vai trò như chất bôi trơn giúp chúng trườn đi mà không bị trầy xước bụng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Trong phân loại học, loài (Species) được định nghĩa chặt chẽ nhất dựa trên tiêu chí nào?",
    "a": "Các cá thể có hình dạng giống hệt nhau.",
    "b": "Các cá thể sống cùng một nơi.",
    "c": "Các cá thể có khả năng giao phối và sinh ra con hữu thụ (con con có khả năng sinh sản).",
    "d": "Các cá thể ăn cùng một loại thức ăn.",
    "correct": "Các cá thể có khả năng giao phối và sinh ra con hữu thụ (con con có khả năng sinh sản).",
    "explain": "Tiêu chuẩn cách ly sinh sản là quan trọng nhất. Ví dụ Lừa và Ngựa sinh ra con La, nhưng con La vô sinh -> Lừa và Ngựa là 2 loài khác nhau."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao khi bị ong đốt, vết thương thường sưng tấy và đau nhức?",
    "a": "Do vòi chích của ong to.",
    "b": "Do nọc độc axit từ tuyến độc của ong bơm vào cơ thể.",
    "c": "Do vi khuẩn trên chân ong.",
    "d": "Do cơ thể ong để lại trong da.",
    "correct": "Do nọc độc axit từ tuyến độc của ong bơm vào cơ thể.",
    "explain": "Ong (bộ Cánh màng) có nọc độc (thường là axit formic). Cơ thể phản ứng viêm với chất độc này gây sưng đau."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Một số loài cây như Cây Nắp ấm có khả năng bắt côn trùng. Đây là sự thích nghi với điều kiện sống nào?",
    "a": "Sống ở nơi quá nhiều ánh sáng.",
    "b": "Sống ở đất nghèo dinh dưỡng (thiếu Đạm/Nitơ).",
    "c": "Sống ở nơi khô hạn.",
    "d": "Sống ở nơi ngập úng.",
    "correct": "Sống ở đất nghèo dinh dưỡng (thiếu Đạm/Nitơ).",
    "explain": "Cây nắp ấm quang hợp bình thường nhưng rễ không hút đủ đạm từ đất xấu. Chúng bắt côn trùng để phân giải protein, bổ sung nguồn Nitơ thiếu hụt."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao Chuột túi (Kangaroo) con khi sinh ra phải bò vào túi mẹ ngay lập tức?",
    "a": "Vì bên ngoài quá lạnh.",
    "b": "Vì con non sinh ra chưa phát triển hoàn thiện, cần môi trường bảo vệ và nguồn sữa trong túi để lớn tiếp.",
    "c": "Vì để tránh kẻ thù.",
    "d": "Vì túi mẹ có chứa thức ăn dự trữ.",
    "correct": "Vì con non sinh ra chưa phát triển hoàn thiện, cần môi trường bảo vệ và nguồn sữa trong túi để lớn tiếp.",
    "explain": "Thú có túi đẻ con rất sớm (chỉ như bào thai). Túi đóng vai trò như 'tử cung ngoài', nơi con non bám vào núm vú để phát triển hoàn chỉnh."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao ở các thành phố lớn, rêu thường ít phát triển hơn so với vùng nông thôn hoặc rừng núi?",
    "a": "Vì thành phố quá nóng.",
    "b": "Vì rêu rất nhạy cảm với ô nhiễm không khí (đặc biệt là khí SO2).",
    "c": "Vì không có đất cho rêu mọc.",
    "d": "Vì thành phố quá ồn ào.",
    "correct": "Vì rêu rất nhạy cảm với ô nhiễm không khí (đặc biệt là khí SO2).",
    "explain": "Rêu hấp thụ nước và khoáng qua toàn bộ bề mặt cơ thể, nên chúng hấp thụ luôn cả chất độc trong không khí. Chúng là sinh vật chỉ thị cho môi trường sạch."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Hiện tượng 'thủy triều đỏ' (tảo nở hoa) gây chết cá hàng loạt chủ yếu do đâu?",
    "a": "Do tảo che lấp ánh sáng mặt trời.",
    "b": "Do tảo tiết ra độc tố vào nước và khi tảo chết bị phân hủy làm cạn kiệt Oxy.",
    "c": "Do tảo ăn hết thức ăn của cá.",
    "d": "Do tảo bám vào mang cá.",
    "correct": "Do tảo tiết ra độc tố vào nước và khi tảo chết bị phân hủy làm cạn kiệt Oxy.",
    "explain": "Một số tảo tiết độc. Nguy hiểm hơn, khi lượng lớn tảo chết đi, vi khuẩn phân hủy xác tảo sẽ tiêu thụ hết Oxy trong nước, khiến cá chết ngạt."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Thú Mỏ vịt là một loài thú kỳ lạ. Đặc điểm nào sau đây KHÔNG đúng về chúng?",
    "a": "Chúng có mỏ giống vịt.",
    "b": "Chúng đẻ trứng.",
    "c": "Chúng nuôi con bằng sữa.",
    "d": "Chúng có vú (núm vú) rõ rệt.",
    "correct": "Chúng có vú (núm vú) rõ rệt.",
    "explain": "Thú mỏ vịt tiết sữa nuôi con, nhưng chúng chưa có núm vú. Sữa tiết ra từ tuyến sữa dưới da bụng và chảy dọc theo lông để con liếm."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao lá cây thường có mặt trên xanh đậm hơn mặt dưới?",
    "a": "Để mặt dưới tránh côn trùng ăn lá.",
    "b": "Vì mặt trên hứng nhiều ánh sáng nên tập trung nhiều lục lạp hơn để quang hợp.",
    "c": "Vì mặt dưới cần màu nhạt để thoát hơi nước.",
    "d": "Vì mặt trên có lớp sáp dày hơn.",
    "correct": "Vì mặt trên hứng nhiều ánh sáng nên tập trung nhiều lục lạp hơn để quang hợp.",
    "explain": "Đây là sự thích nghi cấu tạo. Tế bào mô giậu chứa nhiều lục lạp tập trung ở mặt trên để tối ưu hóa việc hấp thụ năng lượng ánh sáng trực tiếp."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Trong kỹ thuật làm tiêu bản hiển vi, tại sao phải đậy lamen (lá kính) từ từ nghiêng 45 độ?",
    "a": "Để không làm vỡ lam kính.",
    "b": "Để tránh tạo bọt khí, giúp quan sát mẫu vật rõ ràng hơn.",
    "c": "Để mẫu vật không bị trôi đi.",
    "d": "Để nước không tràn ra ngoài.",
    "correct": "Để tránh tạo bọt khí, giúp quan sát mẫu vật rõ ràng hơn.",
    "explain": "Nếu đậy thẳng xuống, không khí sẽ bị nhốt lại tạo thành bọt khí đen tròn, che khuất mẫu vật dưới kính hiển vi."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Ngành Chân khớp (Tiết túc) là ngành động vật đa dạng và thành công nhất trên Trái Đất. Nguyên nhân chính là gì?",
    "a": "Do chúng đẻ nhiều trứng.",
    "b": "Do bộ xương ngoài bằng kitin và các chân phân đốt linh hoạt giúp chúng thích nghi mọi môi trường.",
    "c": "Do chúng có kích thước nhỏ.",
    "d": "Do chúng ăn tạp.",
    "correct": "Do bộ xương ngoài bằng kitin và các chân phân đốt linh hoạt giúp chúng thích nghi mọi môi trường.",
    "explain": "Vỏ kitin bảo vệ và chống mất nước (giúp lên cạn), chân phân đốt giúp di chuyển linh hoạt (bơi, bò, bay, nhảy). Sự đa dạng hóa cấu tạo này giúp chúng chiếm lĩnh mọi nơi."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao một số loài vi khuẩn có thể sống sót được trong nước sôi hoặc môi trường khắc nghiệt hàng trăm năm?",
    "a": "Vì chúng có lớp màng thép.",
    "b": "Vì chúng hình thành 'bào tử' (nội bào tử) với lớp vỏ dày bảo vệ vật chất di truyền.",
    "c": "Vì chúng biến thành virus.",
    "d": "Vì chúng sinh sản cực nhanh bù đắp số lượng chết.",
    "correct": "Vì chúng hình thành 'bào tử' (nội bào tử) với lớp vỏ dày bảo vệ vật chất di truyền.",
    "explain": "Khi gặp điều kiện bất lợi, vi khuẩn cô đặc nguyên sinh chất và tạo vỏ dày thành bào tử. Bào tử này ở trạng thái 'ngủ' và cực kỳ bền vững với nhiệt, hóa chất."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao khi di chuyển cây đi trồng ở nơi khác, người làm vườn thường phải cắt bớt cành và lá?",
    "a": "Để cây trông gọn gàng, đẹp mắt hơn.",
    "b": "Để giảm bớt sự thoát hơi nước qua lá, cân bằng với khả năng hút nước của bộ rễ đang bị tổn thương.",
    "c": "Để kích thích cây ra hoa nhanh hơn.",
    "d": "Để tránh sâu bệnh tấn công lá non.",
    "correct": "Để giảm bớt sự thoát hơi nước qua lá, cân bằng với khả năng hút nước của bộ rễ đang bị tổn thương.",
    "explain": "Khi bứng cây, rễ bị đứt, khả năng hút nước giảm. Nếu để nhiều lá, sự thoát hơi nước vẫn diễn ra mạnh làm cây mất nước và héo chết."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Trong thí nghiệm chứng minh lá cây chế tạo tinh bột khi quang hợp, tại sao phải đun lá trong cồn 90 độ trước khi nhỏ dung dịch I-ốt?",
    "a": "Để làm chín lá cây.",
    "b": "Để tẩy hết chất diệp lục (màu xanh) giúp dễ quan sát màu xanh tím của phản ứng giữa tinh bột và I-ốt.",
    "c": "Để tiêu diệt vi khuẩn trên lá.",
    "d": "Để lá cây mềm ra.",
    "correct": "Để tẩy hết chất diệp lục (màu xanh) giúp dễ quan sát màu xanh tím của phản ứng giữa tinh bột và I-ốt.",
    "explain": "Màu xanh của diệp lục sẽ che lấp màu của phản ứng hóa học. Cồn hòa tan được diệp lục, làm lá trở nên nhợt nhạt."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao Cá Chép chết rất nhanh khi bị đưa lên cạn, trong khi Ếch đồng có thể sống trên cạn khá lâu?",
    "a": "Vì mang cá bị khô và các lá mang dính bết lại làm giảm diện tích trao đổi khí, gây ngạt.",
    "b": "Vì cá sợ ánh sáng mặt trời.",
    "c": "Vì ếch có phổi to hơn cá.",
    "d": "Vì da cá không hô hấp được.",
    "correct": "Vì mang cá bị khô và các lá mang dính bết lại làm giảm diện tích trao đổi khí, gây ngạt.",
    "explain": "Mang cá chỉ hoạt động hiệu quả khi có nước nâng đỡ các lá mang tách rời nhau. Trên cạn, chúng xẹp xuống, dính lại, không trao đổi khí được."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Nếu thả một con cá nước ngọt vào bể nước mặn, con cá sẽ chết. Nguyên nhân chính ở cấp độ tế bào là gì?",
    "a": "Cá bị ngộ độc muối.",
    "b": "Nước trong tế bào cơ thể cá bị rút ra ngoài (do môi trường ưu trương), làm cá mất nước và chết.",
    "c": "Muối lấp đầy mang cá làm cá không thở được.",
    "d": "Cá uống quá nhiều nước mặn.",
    "correct": "Nước trong tế bào cơ thể cá bị rút ra ngoài (do môi trường ưu trương), làm cá mất nước và chết.",
    "explain": "Theo nguyên lý thẩm thấu, nước di chuyển từ nơi nồng độ muối thấp (cơ thể cá nước ngọt) sang nơi nồng độ muối cao (nước biển), làm tế bào teo lại."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao việc du nhập Ốc bươu vàng vào Việt Nam lại trở thành thảm họa cho nông nghiệp?",
    "a": "Vì chúng ăn thịt các loài cá đồng.",
    "b": "Vì chúng sinh sản quá nhanh, ăn tạp (ăn lúa non) và thiếu kẻ thù tự nhiên kiểm soát số lượng.",
    "c": "Vì chúng làm ô nhiễm nguồn nước.",
    "d": "Vì chúng mang mầm bệnh cho trâu bò.",
    "correct": "Vì chúng sinh sản quá nhanh, ăn tạp (ăn lúa non) và thiếu kẻ thù tự nhiên kiểm soát số lượng.",
    "explain": "Là sinh vật ngoại lai, ốc bươu vàng không có thiên địch bản địa, cộng với tốc độ sinh sản khủng khiếp nên chúng phá hoại mùa màng không kiểm soát được."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Khi quan sát dưới kính hiển vi, nếu muốn di chuyển ảnh vật mẫu về phía bên trái thì ta phải dịch chuyển tiêu bản (lam kính) về phía nào?",
    "a": "Phía bên trái.",
    "b": "Phía bên phải.",
    "c": "Phía trên.",
    "d": "Phía dưới.",
    "correct": "Phía bên phải.",
    "explain": "Ảnh qua kính hiển vi quang học là ảnh ngược chiều. Muốn ảnh sang trái thì phải đẩy vật thật sang phải."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao Thằn lằn bóng đuôi dài thường phơi nắng vào buổi sáng?",
    "a": "Để làm khô da.",
    "b": "Để hấp thụ nhiệt, làm tăng thân nhiệt giúp cơ thể hoạt động linh hoạt (vì chúng là động vật biến nhiệt).",
    "c": "Để tổng hợp vitamin D.",
    "d": "Để tìm bạn tình.",
    "correct": "Để hấp thụ nhiệt, làm tăng thân nhiệt giúp cơ thể hoạt động linh hoạt (vì chúng là động vật biến nhiệt).",
    "explain": "Động vật biến nhiệt lạnh đi vào ban đêm. Chúng cần nhiệt độ môi trường để làm ấm cơ thể, kích hoạt các quá trình trao đổi chất để săn mồi."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Một hệ sinh thái bền vững cần có đầy đủ các thành phần nào?",
    "a": "Chỉ cần sinh vật sản xuất và sinh vật tiêu thụ.",
    "b": "Sinh vật sản xuất, sinh vật tiêu thụ, sinh vật phân giải và các yếu tố vô sinh (đất, nước, khí hậu).",
    "c": "Chỉ cần nhiều cây xanh.",
    "d": "Chỉ cần động vật ăn thịt và động vật ăn cỏ.",
    "correct": "Sinh vật sản xuất, sinh vật tiêu thụ, sinh vật phân giải và các yếu tố vô sinh (đất, nước, khí hậu).",
    "explain": "Hệ sinh thái cần vòng tuần hoàn vật chất khép kín: Cây tạo chất hữu cơ -> Động vật ăn -> Vi sinh vật phân giải xác trả lại chất khoáng cho cây."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao rễ cây họ Đậu (như lạc, đậu tương) lại có các nốt sần?",
    "a": "Do bị bệnh sưng rễ.",
    "b": "Đó là nơi cộng sinh của vi khuẩn Rhizobium giúp cố định đạm từ không khí cung cấp cho cây.",
    "c": "Đó là củ chứa tinh bột dự trữ.",
    "d": "Đó là nơi chứa nước.",
    "correct": "Đó là nơi cộng sinh của vi khuẩn Rhizobium giúp cố định đạm từ không khí cung cấp cho cây.",
    "explain": "Vi khuẩn sống trong nốt sần có khả năng biến Nitơ tự do (cây không hấp thụ được) thành dạng muối đạm (cây hấp thụ được), giúp cải tạo đất."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Cơ chế nào giúp cây xương rồng khổng lồ Saguaro sống sót được ở sa mạc nóng bỏng?",
    "a": "Lá biến thành gai, thân mọng nước dự trữ, khí khổng đóng vào ban ngày và mở vào ban đêm.",
    "b": "Rễ cắm sâu xuống địa ngục.",
    "c": "Lá to để che bóng mát cho thân.",
    "d": "Tăng cường thoát hơi nước để làm mát.",
    "correct": "Lá biến thành gai, thân mọng nước dự trữ, khí khổng đóng vào ban ngày và mở vào ban đêm.",
    "explain": "Ngoài gai và thân mọng nước, cơ chế quang hợp đặc biệt (CAM) cho phép chúng mở khí khổng ban đêm để lấy CO2, tránh mất nước dưới nắng gắt ban ngày."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao không nên tưới nước cho cây vào giữa trưa nắng gắt mùa hè?",
    "a": "Vì nước sẽ bốc hơi hết ngay lập tức.",
    "b": "Vì giọt nước đọng trên lá hoạt động như thấu kính hội tụ gây cháy lá, và nhiệt độ đất thay đổi đột ngột gây sốc nhiệt cho rễ.",
    "c": "Vì cây đang ngủ trưa.",
    "d": "Vì lúc đó khí khổng đóng hoàn toàn không hút nước được.",
    "correct": "Vì giọt nước đọng trên lá hoạt động như thấu kính hội tụ gây cháy lá, và nhiệt độ đất thay đổi đột ngột gây sốc nhiệt cho rễ.",
    "explain": "Nước lạnh tưới vào đất nóng gây 'sốc nhiệt', làm tổn thương lông hút, khiến cây không hút được nước trong khi lá vẫn thoát nước mạnh, dẫn đến héo."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Nếu chặt bỏ ngọn (chồi đỉnh) của cây thân gỗ (ví dụ cây ổi), hiện tượng gì thường xảy ra tiếp theo?",
    "a": "Cây sẽ chết ngay lập tức.",
    "b": "Cây sẽ mọc nhiều chồi bên (cành nhánh) xum xuê hơn.",
    "c": "Cây sẽ cao vọt lên nhanh chóng.",
    "d": "Rễ cây sẽ ngừng phát triển.",
    "correct": "Cây sẽ mọc nhiều chồi bên (cành nhánh) xum xuê hơn.",
    "explain": "Đây là hiện tượng 'ưu thế ngọn'. Chồi đỉnh tiết hormone ức chế chồi bên. Khi cắt ngọn (mất ức chế), dinh dưỡng dồn vào nuôi chồi bên phát triển."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao Châu chấu non phải lột xác nhiều lần mới trở thành con trưởng thành?",
    "a": "Vì chúng thích thay đổi màu sắc.",
    "b": "Vì lớp vỏ kitin cứng không lớn lên theo cơ thể, cản trở sự sinh trưởng.",
    "c": "Vì lột xác giúp chúng bay cao hơn.",
    "d": "Vì chúng cần loại bỏ vi khuẩn trên da.",
    "correct": "Vì lớp vỏ kitin cứng không lớn lên theo cơ thể, cản trở sự sinh trưởng.",
    "explain": "Tương tự tôm cua, côn trùng có bộ xương ngoài cứng. Muốn lớn lên, chúng phải vứt bỏ bộ giáp cũ."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Trong chuỗi thức ăn, tại sao số lượng động vật ăn thịt (bậc cao) luôn ít hơn số lượng con mồi (bậc thấp)?",
    "a": "Vì động vật ăn thịt sinh sản kém hơn.",
    "b": "Do năng lượng bị thất thoát qua mỗi bậc dinh dưỡng (chỉ khoảng 10% được chuyển lên bậc tiếp theo).",
    "c": "Vì con mồi chạy nhanh hơn.",
    "d": "Vì con người săn bắn động vật ăn thịt nhiều hơn.",
    "correct": "Do năng lượng bị thất thoát qua mỗi bậc dinh dưỡng (chỉ khoảng 10% được chuyển lên bậc tiếp theo).",
    "explain": "Quy luật hình tháp năng lượng: Năng lượng mất đi do hô hấp, vận động, bài tiết... nên bậc dinh dưỡng càng cao, năng lượng tích lũy càng ít, chỉ nuôi được ít cá thể hơn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao cá Mập phải bơi liên tục, kể cả khi ngủ?",
    "a": "Vì chúng sợ chìm.",
    "b": "Vì chúng không có nắp mang để bơm nước, phải bơi để dòng nước chảy qua mang giúp lấy oxy.",
    "c": "Vì chúng cần săn mồi liên tục.",
    "d": "Vì chúng không có bong bóng cá.",
    "correct": "Vì chúng không có nắp mang để bơm nước, phải bơi để dòng nước chảy qua mang giúp lấy oxy.",
    "explain": "Khác với cá xương có nắp mang bơm nước chủ động, nhiều loài cá mập phải bơi để tạo dòng nước cưỡng bức qua mang (thông khí) và để tạo lực nâng (do thiếu bong bóng)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Trong phân loại sinh vật, đặc điểm nào sau đây được coi là 'tương đồng' (chứng tỏ cùng nguồn gốc) giữa cánh Dơi và tay Người?",
    "a": "Đều dùng để cầm nắm.",
    "b": "Đều có cấu trúc xương giống nhau (xương cánh tay, xương quay, xương trụ, xương bàn...), dù chức năng khác nhau.",
    "c": "Đều có lông bao phủ.",
    "d": "Đều giúp cơ thể di chuyển.",
    "correct": "Đều có cấu trúc xương giống nhau (xương cánh tay, xương quay, xương trụ, xương bàn...), dù chức năng khác nhau.",
    "explain": "Đây là bằng chứng về giải phẫu so sánh. Dù cánh dơi để bay, tay người để cầm, nhưng cấu trúc xương cơ bản giống hệt nhau, chứng tỏ chung tổ tiên lớp Thú."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao Biện pháp sinh học (dùng thiên địch) lại ưu việt hơn thuốc trừ sâu hóa học?",
    "a": "Vì nó tiêu diệt sâu hại nhanh hơn.",
    "b": "Vì nó không gây ô nhiễm môi trường, không gây kháng thuốc và bảo vệ sự cân bằng sinh thái.",
    "c": "Vì nó rẻ tiền hơn rất nhiều.",
    "d": "Vì thiên địch làm đẹp cho cánh đồng.",
    "correct": "Vì nó không gây ô nhiễm môi trường, không gây kháng thuốc và bảo vệ sự cân bằng sinh thái.",
    "explain": "Thuốc hóa học gây độc hại và sâu dễ lờn thuốc. Thiên địch kiểm soát sâu hại một cách bền vững theo quy luật tự nhiên."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao các loài lưỡng cư (như Ếch nhái) đang bị suy giảm số lượng nghiêm trọng trên toàn cầu?",
    "a": "Vì chúng bị ăn thịt quá nhiều.",
    "b": "Vì da của chúng rất nhạy cảm với sự ô nhiễm môi trường và biến đổi khí hậu.",
    "c": "Vì chúng di chuyển quá chậm.",
    "d": "Vì tiếng kêu của chúng thu hút kẻ thù.",
    "correct": "Vì da của chúng rất nhạy cảm với sự ô nhiễm môi trường và biến đổi khí hậu.",
    "explain": "Da ếch thấm nước và khí mạnh, nên chất độc trong môi trường dễ ngấm vào cơ thể. Chúng được coi là sinh vật chỉ thị cho sức khỏe môi trường."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Vì sao lá cây thường có cấu tạo mỏng và diện tích bề mặt lớn?",
    "a": "Để nhẹ bớt cho cành cây đỡ gãy.",
    "b": "Để hứng được nhiều ánh sáng mặt trời nhất và thuận lợi cho khí khuếch tán vào/ra.",
    "c": "Để nước mưa trôi đi nhanh hơn.",
    "d": "Để sâu bọ khó ăn hơn.",
    "correct": "Để hứng được nhiều ánh sáng mặt trời nhất và thuận lợi cho khí khuếch tán vào/ra.",
    "explain": "Diện tích lớn giúp thu nhận tối đa quang năng. Phiến lá mỏng giúp khí CO2 đi vào đến lục lạp nhanh hơn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Trong thực tế, người ta thường dùng khí Cacbua (đất đèn) hoặc khí Ethylen để làm gì với trái cây?",
    "a": "Để rửa sạch trái cây.",
    "b": "Để dấm (làm chín) trái cây nhanh và đều hơn.",
    "c": "Để bảo quản trái cây tươi lâu.",
    "d": "Để làm trái cây ngọt hơn.",
    "correct": "Để dấm (làm chín) trái cây nhanh và đều hơn.",
    "explain": "Ethylen là một hormone thực vật dạng khí, kích thích quá trình chín của quả (phân giải tinh bột thành đường, làm mềm vỏ...)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao khi trồng cây thủy canh (trồng trong nước), người ta vẫn phải dùng máy bơm để tạo dòng chảy hoặc sục khí?",
    "a": "Để rễ cây không bị thối do thiếu Oxy hô hấp.",
    "b": "Để cây uống nước nhiều hơn.",
    "c": "Để rửa sạch rễ cây.",
    "d": "Để ngăn rêu mọc.",
    "correct": "Để rễ cây không bị thối do thiếu Oxy hô hấp.",
    "explain": "Dù sống trong nước, tế bào rễ vẫn cần Oxy để hô hấp tạo năng lượng hút khoáng. Nước tĩnh thiếu oxy sẽ làm rễ ngạt và thối."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Vì sao chim Cánh cụt sống thành bầy đàn đông đúc ở Nam Cực?",
    "a": "Để dễ tìm bạn tình.",
    "b": "Để cùng nhau giữ ấm (hiệu ứng nhóm) chống lại cái lạnh khắc nghiệt.",
    "c": "Để tấn công kẻ thù hiệu quả hơn.",
    "d": "Vì diện tích băng quá nhỏ.",
    "correct": "Để cùng nhau giữ ấm (hiệu ứng nhóm) chống lại cái lạnh khắc nghiệt.",
    "explain": "Đứng chụm vào nhau giúp giảm diện tích tiếp xúc với khí lạnh, giữ nhiệt lượng chung cho cả đàn, giúp chúng sống sót qua bão tuyết."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao Virut HIV đặc biệt nguy hiểm đối với con người?",
    "a": "Vì nó phá hủy các tế bào hồng cầu.",
    "b": "Vì nó tấn công và phá hủy hệ thống miễn dịch (tế bào T), khiến cơ thể mất khả năng chống lại các bệnh thông thường khác.",
    "c": "Vì nó làm suy tim.",
    "d": "Vì nó lây qua đường hô hấp.",
    "correct": "Vì nó tấn công và phá hủy hệ thống miễn dịch (tế bào T), khiến cơ thể mất khả năng chống lại các bệnh thông thường khác.",
    "explain": "HIV gây hội chứng suy giảm miễn dịch (AIDS). Người bệnh thường không chết vì virus HIV mà chết vì các bệnh cơ hội (lao, viêm phổi...) do hệ miễn dịch đã bị vô hiệu hóa."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Sự thụ tinh kép ở thực vật Hạt kín có ý nghĩa gì đặc biệt?",
    "a": "Tạo ra 2 hạt cùng một lúc.",
    "b": "Vừa tạo ra phôi (cây con), vừa tạo ra nội nhũ (chất dinh dưỡng nuôi phôi).",
    "c": "Đảm bảo chắc chắn hạt sẽ nảy mầm.",
    "d": "Giúp cây ra hoa nhiều hơn.",
    "correct": "Vừa tạo ra phôi (cây con), vừa tạo ra nội nhũ (chất dinh dưỡng nuôi phôi).",
    "explain": "Một tinh tử kết hợp với noãn cầu thành phôi. Tinh tử kia kết hợp với nhân cực thành nội nhũ. Đây là đặc điểm tiến hóa chỉ có ở Hạt kín."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao khi ăn sữa chua, ta không nên ăn lúc bụng quá đói?",
    "a": "Vì sẽ bị đau bụng.",
    "b": "Vì axit mạnh trong dạ dày lúc đói sẽ tiêu diệt phần lớn lợi khuẩn trong sữa chua.",
    "c": "Vì sữa chua làm tăng cảm giác đói.",
    "d": "Vì cơ thể không hấp thu được canxi lúc đói.",
    "correct": "Vì axit mạnh trong dạ dày lúc đói sẽ tiêu diệt phần lớn lợi khuẩn trong sữa chua.",
    "explain": "Lợi khuẩn (Probiotic) cần sống sót qua dạ dày xuống ruột mới có tác dụng. Lúc đói pH dạ dày rất thấp (axit cao) dễ giết chết chúng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Đặc điểm nào của lá cây Dương xỉ giúp ta dễ dàng nhận biết chúng?",
    "a": "Lá có mùi thơm đặc biệt.",
    "b": "Lá non cuộn tròn ở đầu, mặt dưới lá già thường có các đốm chứa túi bào tử.",
    "c": "Lá luôn có màu đỏ.",
    "d": "Lá có gai nhọn.",
    "correct": "Lá non cuộn tròn ở đầu, mặt dưới lá già thường có các đốm chứa túi bào tử.",
    "explain": "Dương xỉ sinh sản bằng bào tử. Ổ bào tử (sasus) nằm ở mặt dưới lá già là đặc điểm nhận dạng quan trọng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao nói: 'Sự đa dạng sinh học tỉ lệ thuận với độ ổn định của hệ sinh thái'?",
    "a": "Vì càng nhiều loài thì càng đẹp.",
    "b": "Vì mạng lưới thức ăn càng phức tạp, nếu mất một loài thì có loài khác thay thế, hệ sinh thái khó bị sụp đổ.",
    "c": "Vì nhiều loài thì cạnh tranh ít đi.",
    "d": "Vì nhiều loài thì sinh khối lớn.",
    "correct": "Vì mạng lưới thức ăn càng phức tạp, nếu mất một loài thì có loài khác thay thế, hệ sinh thái khó bị sụp đổ.",
    "explain": "Trong hệ sinh thái đa dạng, các loài có mối quan hệ chằng chịt. Nếu một mắt xích đứt, luồng năng lượng có thể đi qua đường khác, giúp hệ thống tự cân bằng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Việc sử dụng túi nilon khó phân hủy gây hại nghiêm trọng nhất đến môi trường đất như thế nào?",
    "a": "Làm mất thẩm mỹ cảnh quan.",
    "b": "Tạo thành lớp màng ngăn cản sự trao đổi khí, nước và sự phát triển của rễ cây, vi sinh vật trong đất.",
    "c": "Làm đất bị chua.",
    "d": "Làm chết giun đất do ăn phải.",
    "correct": "Tạo thành lớp màng ngăn cản sự trao đổi khí, nước và sự phát triển của rễ cây, vi sinh vật trong đất.",
    "explain": "Túi nilon trong đất ngăn cản sự lưu thông không khí và nước, làm đất bị 'chai', rễ cây không đâm xuyên qua được và chết dần, gây xói mòn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao một số loài chim di cư bay hàng ngàn km để tránh rét mà không ở lại ngủ đông như Gấu?",
    "a": "Vì chúng thích bay lượn.",
    "b": "Vì cơ thể chim nhỏ, dự trữ năng lượng ít không đủ để ngủ đông, và chúng cần tìm nguồn thức ăn dồi dào ở phương Nam.",
    "c": "Vì lông chim không đủ ấm.",
    "d": "Vì chúng sợ tuyết.",
    "correct": "Vì cơ thể chim nhỏ, dự trữ năng lượng ít không đủ để ngủ đông, và chúng cần tìm nguồn thức ăn dồi dào ở phương Nam.",
    "explain": "Ngủ đông đòi hỏi tích lũy mỡ dày. Chim cần cơ thể nhẹ để bay nên không tích mỡ nhiều được. Di cư là giải pháp tối ưu năng lượng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Hiện tượng 'Kháng thuốc kháng sinh' ở vi khuẩn là minh chứng cho quá trình gì?",
    "a": "Sự suy thoái của vi khuẩn.",
    "b": "Chọn lọc tự nhiên và tiến hóa thích nghi.",
    "c": "Sự biến đổi khí hậu.",
    "d": "Sự lây lan của virus.",
    "correct": "Chọn lọc tự nhiên và tiến hóa thích nghi.",
    "explain": "Khi dùng thuốc bừa bãi, những vi khuẩn yếu chết đi, những vi khuẩn có đột biến kháng thuốc sống sót và sinh sản nhanh chóng, tạo ra chủng vi khuẩn mới kháng thuốc hoàn toàn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao động vật Hằng nhiệt (như Chim, Thú) lại có ưu thế sinh tồn hơn động vật Biến nhiệt (như Bò sát, Ếch nhái) ở vùng khí hậu lạnh?",
    "a": "Vì chúng có bộ lông dày hơn.",
    "b": "Vì thân nhiệt của chúng ổn định, không phụ thuộc môi trường, giúp các hoạt động sống diễn ra bình thường dù trời lạnh.",
    "c": "Vì chúng ăn nhiều hơn.",
    "d": "Vì chúng biết ngủ đông.",
    "correct": "Vì thân nhiệt của chúng ổn định, không phụ thuộc môi trường, giúp các hoạt động sống diễn ra bình thường dù trời lạnh.",
    "explain": "Động vật biến nhiệt bị tê cứng khi trời lạnh do thân nhiệt giảm theo môi trường. Động vật hằng nhiệt tự điều chỉnh được thân nhiệt nên vẫn hoạt động (săn mồi, trốn tránh) linh hoạt."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Trong thí nghiệm chứng minh lá cây thoát hơi nước, tại sao phải trùm túi nilon trong suốt kín quanh cành lá?",
    "a": "Để bảo vệ lá khỏi sâu bệnh.",
    "b": "Để giữ nhiệt độ cho lá.",
    "c": "Để hứng và quan sát những giọt nước ngưng tụ (do lá thoát ra) mà không bị lẫn với nước từ không khí bên ngoài.",
    "d": "Để ngăn cản quá trình quang hợp.",
    "correct": "Để hứng và quan sát những giọt nước ngưng tụ (do lá thoát ra) mà không bị lẫn với nước từ không khí bên ngoài.",
    "explain": "Túi nilon kín tạo ra một hệ thống cô lập. Nếu thấy giọt nước đọng mặt trong túi, chứng tỏ nước đó chỉ có thể đi ra từ lá cây."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao Cá Ngựa có hình dáng kỳ lạ, bơi thẳng đứng nhưng lại được xếp vào lớp Cá?",
    "a": "Vì chúng sống dưới nước.",
    "b": "Vì chúng hô hấp bằng mang, bơi bằng vây và có xương sống.",
    "c": "Vì chúng đẻ trứng.",
    "d": "Vì chúng có vảy.",
    "correct": "Vì chúng hô hấp bằng mang, bơi bằng vây và có xương sống.",
    "explain": "Dù hình dáng giống quân cờ vua, nhưng về cấu tạo giải phẫu (mang, vây, bóng cá...), cá ngựa mang đầy đủ đặc điểm của lớp Cá xương."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Vì sao các loại hạt giống (lúa, ngô, đậu) cần phải phơi khô trước khi đưa vào kho bảo quản?",
    "a": "Để giảm trọng lượng dễ vận chuyển.",
    "b": "Để giảm hàm lượng nước xuống mức tối thiểu, ức chế quá trình hô hấp tế bào, ngăn hạt nảy mầm hoặc bị mốc.",
    "c": "Để hạt cứng hơn, chuột không ăn được.",
    "d": "Để màu sắc hạt đẹp hơn.",
    "correct": "Để giảm hàm lượng nước xuống mức tối thiểu, ức chế quá trình hô hấp tế bào, ngăn hạt nảy mầm hoặc bị mốc.",
    "explain": "Nước là điều kiện cần cho hô hấp và nảy mầm. Loại bỏ nước đưa hạt vào trạng thái 'ngủ', giúp giữ được chất dinh dưỡng trong thời gian dài."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao Giun đũa (Ký sinh đường ruột) có lớp vỏ cuticun bọc ngoài cơ thể rất dày và trơn?",
    "a": "Để giữ ấm cơ thể.",
    "b": "Để chống lại sự tấn công của các vi khuẩn đường ruột.",
    "c": "Để không bị các dịch tiêu hóa (axit, enzyme) của vật chủ ăn mòn và tiêu hủy.",
    "d": "Để giúp chúng di chuyển nhanh hơn.",
    "correct": "Để không bị các dịch tiêu hóa (axit, enzyme) của vật chủ ăn mòn và tiêu hủy.",
    "explain": "Môi trường ruột non chứa đầy enzyme phân hủy thức ăn. Lớp vỏ cuticun đóng vai trò như 'áo giáp' hóa học bảo vệ giun đũa an toàn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Một trong những lý do khiến Rừng ngập mặn là nơi ươm nuôi thủy hải sản tự nhiên lý tưởng là gì?",
    "a": "Vì nước ở đây rất trong.",
    "b": "Vì hệ rễ dày đặc tạo nơi trú ẩn an toàn cho con non và lá rụng phân hủy tạo nguồn thức ăn mùn bã hữu cơ dồi dào.",
    "c": "Vì không có loài thú ăn thịt nào sống ở đó.",
    "d": "Vì độ mặn của nước rất cao diệt hết vi khuẩn.",
    "correct": "Vì hệ rễ dày đặc tạo nơi trú ẩn an toàn cho con non và lá rụng phân hủy tạo nguồn thức ăn mùn bã hữu cơ dồi dào.",
    "explain": "Rừng ngập mặn cung cấp cả 'nhà' (rễ cây chằng chịt tránh kẻ thù) và 'cơm' (mùn bã thực vật) cho các loài tôm, cua, cá con phát triển."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Tại sao khi trồng cây chiết cành (ví dụ chiết cành cam), cành chiết lại ra rễ ngay trên cây mẹ?",
    "a": "Do bôi thuốc kích thích rễ.",
    "b": "Do khoanh vỏ cắt đứt mạch rây, chất hữu cơ từ lá vận chuyển xuống bị ứ lại ở mép cắt kích thích tế bào phân chia tạo rễ.",
    "c": "Do bó đất giữ ẩm.",
    "d": "Do cắt đứt mạch gỗ.",
    "correct": "Do khoanh vỏ cắt đứt mạch rây, chất hữu cơ từ lá vận chuyển xuống bị ứ lại ở mép cắt kích thích tế bào phân chia tạo rễ.",
    "explain": "Mạch rây nằm ở vỏ cây, vận chuyển chất dinh dưỡng từ lá xuống. Khi cắt vỏ, đường vận chuyển bị tắc, dinh dưỡng tích tụ làm phình to và mọc rễ."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Vì sao Ếch thường đi kiếm ăn vào ban đêm hoặc sau cơn mưa rào?",
    "a": "Vì lúc đó ếch nhìn rõ nhất.",
    "b": "Vì trời mát và độ ẩm cao giúp da ếch không bị khô, đảm bảo hô hấp dễ dàng khi lên cạn.",
    "c": "Vì côn trùng (thức ăn) chỉ xuất hiện vào ban đêm.",
    "d": "Vì ếch sợ tiếng ồn ban ngày.",
    "correct": "Vì trời mát và độ ẩm cao giúp da ếch không bị khô, đảm bảo hô hấp dễ dàng khi lên cạn.",
    "explain": "Ánh nắng mặt trời ban ngày làm da ếch khô nhanh, gây ngạt thở. Ban đêm hoặc sau mưa là điều kiện lý tưởng về độ ẩm cho ếch hoạt động."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Cơ chế nào giải thích việc 'Tiêm vắc-xin một lần nhưng có thể miễn dịch cả đời' (với một số bệnh)?",
    "a": "Vắc-xin tồn tại mãi trong máu.",
    "b": "Hệ miễn dịch hình thành 'Tế bào nhớ', giúp cơ thể nhận diện và tiêu diệt ngay lập tức mầm bệnh nếu chúng xâm nhập lần sau.",
    "c": "Vắc-xin biến đổi gen của người.",
    "d": "Vắc-xin tạo lớp màng bọc quanh các tế bào.",
    "correct": "Hệ miễn dịch hình thành 'Tế bào nhớ', giúp cơ thể nhận diện và tiêu diệt ngay lập tức mầm bệnh nếu chúng xâm nhập lần sau.",
    "explain": "Tế bào nhớ (Memory B/T cells) lưu trữ thông tin về mầm bệnh. Khi tái nhiễm, chúng kích hoạt sản xuất kháng thể ồ ạt và nhanh chóng hơn nhiều so với lần đầu."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-hard",
    "content": "Xét về mặt tiến hóa, đặc điểm nào của 'Trùng roi' chứng minh mối quan hệ nguồn gốc giữa Động vật và Thực vật?",
    "a": "Chúng có kích thước nhỏ.",
    "b": "Chúng vừa có lục lạp (tự dưỡng như thực vật), vừa có roi và điểm mắt (di chuyển, cảm ứng như động vật).",
    "c": "Chúng sống ở nước.",
    "d": "Chúng sinh sản vô tính.",
    "correct": "Chúng vừa có lục lạp (tự dưỡng như thực vật), vừa có roi và điểm mắt (di chuyển, cảm ứng như động vật).",
    "explain": "Trùng roi là sinh vật trung gian, mang đặc điểm của cả hai giới. Điều này gợi ý rằng thực vật và động vật có thể có chung một tổ tiên xa xưa là nhóm sinh vật giống trùng roi."
  }
]
  