[
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Nếu một tế bào thực vật bị mất khả năng tổng hợp xenlulozơ ở thành tế bào, hệ quả trực tiếp và nghiêm trọng nhất đối với tế bào đó là gì khi đặt trong môi trường nước cất?",
    "a": "Tế bào sẽ co nguyên sinh do mất nước nhanh chóng.",
    "b": "Tế bào sẽ không thể thực hiện quá trình quang hợp.",
    "c": "Tế bào sẽ bị vỡ ra do áp suất trương nước tăng quá mức mà không có thành bảo vệ.",
    "d": "Tế bào sẽ ngừng phân chia nhưng vẫn tồn tại bình thường.",
    "correct": "Tế bào sẽ bị vỡ ra do áp suất trương nước tăng quá mức mà không có thành bảo vệ.",
    "explain": "Thành tế bào có vai trò tạo khung cứng để chống lại áp suất trương nước. Trong nước cất (môi trường nhược trương), nước đi vào tế bào, nếu không có thành, màng sinh chất sẽ vỡ."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Xét về mặt tiến hóa, tại sao các loài thực vật thuộc nhóm Hạt kín lại có khả năng phát tán rộng rãi và chiếm ưu thế hơn hẳn so với thực vật Hạt trần?",
    "a": "Do thực vật Hạt kín có hệ mạch dẫn phát triển hơn rất nhiều.",
    "b": "Do hạt của chúng được bảo vệ trong quả, tăng khả năng sống sót và có nhiều hình thức phát tán nhờ động vật, gió, nước.",
    "c": "Do thực vật Hạt kín không cần nước trong quá trình thụ phấn.",
    "d": "Do thực vật Hạt kín có kích thước cơ thể lớn hơn thực vật Hạt trần.",
    "correct": "Do hạt của chúng được bảo vệ trong quả, tăng khả năng sống sót và có nhiều hình thức phát tán nhờ động vật, gió, nước.",
    "explain": "Sự xuất hiện của hoa và quả là bước tiến hóa nhảy vọt giúp bảo vệ noãn/hạt tốt hơn và đa dạng hóa phương thức phát tán nòi giống."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Một loại vi khuẩn có thời gian thế hệ (thời gian để số tế bào tăng gấp đôi) là 20 phút. Nếu ban đầu có 10 tế bào, sau bao nhiêu giờ thì quần thể này đạt được 10.240 tế bào (giả thiết môi trường nuôi cấy lý tưởng)?",
    "a": "3,33 giờ.",
    "b": "2,5 giờ.",
    "c": "10 giờ.",
    "d": "200 phút.",
    "correct": "3,33 giờ.",
    "explain": "Số lần phân chia n: 10 * 2^n = 10.240 => 2^n = 1024 => n = 10 lần. Thời gian: 10 * 20 phút = 200 phút = 3,33 giờ."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao trong cấu trúc của tế bào nhân thực, lưới nội chất hạt lại thường nằm gần và bao quanh nhân tế bào?",
    "a": "Để bảo vệ nhân khỏi các tác nhân gây hại từ tế bào chất.",
    "b": "Để nhân nhận năng lượng trực tiếp từ lưới nội chất.",
    "c": "Để tiếp nhận trực tiếp thông tin di truyền (mARN) từ nhân phục vụ cho quá trình tổng hợp protein.",
    "d": "Để hỗ trợ nhân trong việc phân chia nhiễm sắc thể.",
    "correct": "Để tiếp nhận trực tiếp thông tin di truyền (mARN) từ nhân phục vụ cho quá trình tổng hợp protein.",
    "explain": "Thông tin di truyền từ nhân được phiên mã ra mARN, mARN đi qua lỗ nhân ra ngay lưới nội chất hạt (có ribosome) để dịch mã tổng hợp protein nhanh chóng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Địa y là sự cộng sinh giữa nấm và tảo. Nếu ta tách riêng nấm và tảo ra rồi nuôi cấy trong điều kiện thiếu chất hữu cơ nhưng có ánh sáng, hiện tượng gì sẽ xảy ra?",
    "a": "Cả hai đều phát triển bình thường.",
    "b": "Nấm sẽ chết, tảo vẫn có khả năng tồn tại và phát triển.",
    "c": "Tảo sẽ chết vì thiếu sự bảo vệ của nấm, nấm vẫn sống.",
    "d": "Cả hai đều chết vì mất đi mối quan hệ cộng sinh.",
    "correct": "Nấm sẽ chết, tảo vẫn có khả năng tồn tại và phát triển.",
    "explain": "Tảo có diệp lục nên có khả năng tự dưỡng (quang hợp) để tạo chất hữu cơ. Nấm là sinh vật dị dưỡng, thiếu tảo cung cấp chất hữu cơ nấm sẽ chết."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Đặc điểm nào sau đây chứng minh virus không phải là sinh vật hoàn chỉnh mà chỉ là một dạng sống trung gian?",
    "a": "Kích thước siêu hiển vi chỉ quan sát được dưới kính hiển vi điện tử.",
    "b": "Có khả năng gây bệnh và biến đổi cấu trúc gen liên tục.",
    "c": "Không có cấu tạo tế bào, không có trao đổi chất riêng và chỉ nhân lên trong tế bào vật chủ.",
    "d": "Vật chất di truyền chỉ có ADN, không có ARN.",
    "correct": "Không có cấu tạo tế bào, không có trao đổi chất riêng và chỉ nhân lên trong tế bào vật chủ.",
    "explain": "Virus thiếu các bào quan và enzyme tự thân để thực hiện chuyển hóa vật chất, chúng ký sinh nội bào bắt buộc để duy trì sự tồn tại."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong quá trình hô hấp tế bào, tại sao ti thể được ví là 'nhà máy điện' của tế bào?",
    "a": "Vì ti thể tổng hợp ra các chất hữu cơ phức tạp.",
    "b": "Vì ti thể là nơi phân giải các chất hữu cơ để giải phóng năng lượng dưới dạng ATP cung cấp cho hoạt động sống.",
    "c": "Vì ti thể chứa nhiều sắc tố quang hợp hấp thụ năng lượng mặt trời.",
    "d": "Vì ti thể có khả năng tự nhân đôi độc lập với tế bào.",
    "correct": "Vì ti thể là nơi phân giải các chất hữu cơ để giải phóng năng lượng dưới dạng ATP cung cấp cho hoạt động sống.",
    "explain": "Ti thể thực hiện chu trình chuyển hóa năng lượng hóa học từ thực phẩm thành ATP - đồng tiền năng lượng của tế bào thông qua hô hấp hiếu khí."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Một loài cây sống ở sa mạc thường có lá biến thành gai, thân mọng nước và rễ đâm sâu. Mục đích chính của việc 'lá biến thành gai' là gì?",
    "a": "Để chống lại các loài động vật ăn thực vật.",
    "b": "Để tăng diện tích tiếp xúc với ánh sáng mặt trời.",
    "c": "Để giảm tối đa sự thoát hơi nước qua bề mặt lá trong điều kiện khô hạn.",
    "d": "Để hấp thụ sương đêm vào sáng sớm.",
    "correct": "Để giảm tối đa sự thoát hơi nước qua bề mặt lá trong điều kiện khô hạn.",
    "explain": "Giảm diện tích lá giúp hạn chế số lượng khí khổng, từ đó giảm mất nước do thoát hơi nước, giúp cây thích nghi với môi trường khô nóng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Đặc điểm cấu tạo nào của tế bào vi khuẩn giúp chúng có khả năng kháng lại các tác động cơ học và áp suất thẩm thấu từ môi trường bên ngoài?",
    "a": "Màng sinh chất có cấu tạo khảm động.",
    "b": "Vùng nhân chứa ADN vòng.",
    "c": "Thành tế bào cấu tạo từ Peptitđôglican.",
    "d": "Các hạt dự trữ trong tế bào chất.",
    "correct": "Thành tế bào cấu tạo từ Peptitđôglican.",
    "explain": "Thành tế bào vi khuẩn rất bền vững, quy định hình dạng tế bào và bảo vệ tế bào trước các tác nhân lý hóa của môi trường."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong phân loại 5 giới của Whittaker, giới nào bao gồm các sinh vật nhân thực, đa bào, dị dưỡng theo phương thức hấp thụ và có thành tế bào bằng kitin?",
    "a": "Giới Khởi sinh.",
    "b": "Giới Nguyên sinh.",
    "c": "Giới Nấm.",
    "d": "Giới Động vật.",
    "correct": "Giới Nấm.",
    "explain": "Giới nấm có đặc trưng là nhân thực, thành kitin, không quang hợp mà sống dị dưỡng bằng cách tiết enzyme phân giải rồi hấp thụ chất hữu cơ."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao các loài lưỡng cư (như ếch, nhái) lại không thể sống xa nguồn nước hoặc những nơi có độ ẩm cao?",
    "a": "Vì chúng chỉ ăn những sinh vật sống dưới nước.",
    "b": "Vì phổi của chúng chưa phát triển, da phải luôn ẩm để thực hiện trao đổi khí (hô hấp qua da).",
    "c": "Vì chúng có máu lạnh nên cần nước để giữ ấm cơ thể.",
    "d": "Vì chúng không có khả năng di chuyển trên cạn lâu.",
    "correct": "Vì phổi của chúng chưa phát triển, da phải luôn ẩm để thực hiện trao đổi khí (hô hấp qua da).",
    "explain": "Phổi của lưỡng cư đơn giản, hiệu quả thấp, da mỏng và giàu mạch máu đóng vai trò chủ đạo trong hô hấp, đòi hỏi phải luôn ẩm để O2 hòa tan và khuếch tán."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Cấu trúc nào sau đây được coi là 'trung tâm điều khiển mọi hoạt động sống của tế bào' và tại sao?",
    "a": "Màng sinh chất, vì nó kiểm soát các chất ra vào.",
    "b": "Ti thể, vì nó cung cấp năng lượng.",
    "c": "Nhân tế bào, vì nó chứa vật chất di truyền mang thông tin quy định mọi đặc điểm và hoạt động sống.",
    "d": "Ribosome, vì nó tổng hợp protein.",
    "correct": "Nhân tế bào, vì nó chứa vật chất di truyền mang thông tin quy định mọi đặc điểm và hoạt động sống.",
    "explain": "ADN trong nhân chứa mã di truyền, điều hành quá trình tổng hợp protein và enzyme, từ đó điều tiết mọi phản ứng sinh hóa của tế bào."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Vi khuẩn Lam (Cyanobacteria) khác với các loại vi khuẩn thông thường khác ở điểm căn bản nào?",
    "a": "Chúng có màng nhân bao bọc vật chất di truyền.",
    "b": "Chúng có khả năng di động nhờ roi rất mạnh.",
    "c": "Chúng có chứa diệp lục và có khả năng quang hợp tự dưỡng giải phóng Oxy.",
    "d": "Chúng sống ký sinh bắt buộc trong cơ thể người.",
    "correct": "Chúng có chứa diệp lục và có khả năng quang hợp tự dưỡng giải phóng Oxy.",
    "explain": "Vi khuẩn Lam là nhóm vi khuẩn nhân sơ duy nhất có khả năng quang hợp giống thực vật, đóng vai trò quan trọng trong việc tạo ra oxy cho khí quyển Trái đất sơ khai."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Nếu một người bị hỏng chức năng của bộ máy Golgi trong tế bào gan, hệ quả nào sau đây dễ xảy ra nhất?",
    "a": "Gan sẽ không thể tạo ra năng lượng cho cơ thể.",
    "b": "Quá trình đóng gói, sửa chữa và vận chuyển các protein/enzym tiết ra ngoài tế bào bị đình trệ.",
    "c": "Tế bào gan sẽ không thể thực hiện quá trình phân bào.",
    "d": "Các chất độc hại sẽ không được hấp thụ vào gan.",
    "correct": "Quá trình đóng gói, sửa chữa và vận chuyển các protein/enzym tiết ra ngoài tế bào bị đình trệ.",
    "explain": "Bộ máy Golgi có chức năng hoàn thiện cấu trúc, phân loại và đóng gói các sản phẩm của tế bào vào túi tiết để xuất bào."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao rêu được coi là nhóm thực vật ở cạn đầu tiên nhưng cấu tạo lại vẫn mang tính chất 'chuyển tiếp' từ môi trường nước?",
    "a": "Vì rêu có rễ thật nhưng lá chưa có gân.",
    "b": "Vì rêu chưa có hệ mạch dẫn chính thức và việc thụ tinh vẫn cần môi trường nước để tinh trùng bơi đến trứng.",
    "c": "Vì rêu không có chất diệp lục mà sống nhờ mùn bã hữu cơ.",
    "d": "Vì rêu chỉ sống ở những vùng núi cao lạnh giá.",
    "correct": "Vì rêu chưa có hệ mạch dẫn chính thức và việc thụ tinh vẫn cần môi trường nước để tinh trùng bơi đến trứng.",
    "explain": "Sự thiếu mạch dẫn và phụ thuộc vào nước trong sinh sản khiến rêu chưa thể hoàn toàn thích nghi với môi trường cạn khô ráo."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Một loài sinh vật đơn bào có lông bơi, nhân thực, không có lục lạp, sống trong môi trường nước và ăn vi khuẩn. Sinh vật này thuộc giới nào?",
    "a": "Giới Khởi sinh.",
    "b": "Giới Nguyên sinh.",
    "c": "Giới Nấm.",
    "d": "Giới Động vật.",
    "correct": "Giới Nguyên sinh.",
    "explain": "Động vật nguyên sinh (như trùng giày) thuộc giới Nguyên sinh, có cấu tạo nhân thực đơn bào và sống dị dưỡng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Xét về cấu tạo mạch dẫn, gỗ của cây Hạt trần (như Thông) khác với gỗ của cây Hạt kín ở điểm nào?",
    "a": "Gỗ Hạt trần chỉ gồm quản bào, chưa có mạch ống; gỗ Hạt kín có mạch ống phát triển hơn.",
    "b": "Gỗ Hạt trần dẫn nước nhanh hơn gỗ Hạt kín.",
    "c": "Gỗ Hạt trần không có khả năng vận chuyển chất khoáng.",
    "d": "Gỗ Hạt trần chỉ có mạch rây, không có mạch gỗ.",
    "correct": "Gỗ Hạt trần chỉ gồm quản bào, chưa có mạch ống; gỗ Hạt kín có mạch ống phát triển hơn.",
    "explain": "Mạch ống ở hạt kín là cấu trúc vận chuyển nước hiệu quả hơn quản bào ở hạt trần, giúp hạt kín thích nghi với nhiều điều kiện khí hậu."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Sự phát triển của bao hoa (đài và tràng) ở thực vật Hạt kín có ý nghĩa quan trọng nhất là gì?",
    "a": "Làm cho hoa đẹp hơn để trang trí.",
    "b": "Bảo vệ các bộ phận sinh sản (nhị, nhụy) và thu hút động vật (côn trùng, chim) hỗ trợ thụ phấn.",
    "c": "Để thực hiện quá trình quang hợp cung cấp dinh dưỡng cho hoa.",
    "d": "Hạn chế sự xâm nhập của các loài sâu bệnh.",
    "correct": "Bảo vệ các bộ phận sinh sản (nhị, nhụy) và thu hút động vật (côn trùng, chim) hỗ trợ thụ phấn.",
    "explain": "Bao hoa giúp tăng tỉ lệ thụ phấn chéo, tạo ra sự đa dạng di truyền cho thế hệ sau."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao cá mập (Lớp Cá sụn) phải bơi liên tục trong nước nếu không muốn bị ngạt thở, trong khi các loài cá xương thì không bắt buộc như vậy?",
    "a": "Vì cá mập có máu lạnh nên cần bơi để giữ nhiệt.",
    "b": "Vì cá mập không có nắp mang để chủ động đẩy nước qua mang, nước chỉ chảy qua mang khi cá di chuyển.",
    "c": "Vì cá mập không có bong bóng cá để điều chỉnh độ nổi.",
    "d": "Cả b và c đều đúng.",
    "correct": "Cả b và c đều đúng.",
    "explain": "Thiếu nắp mang khiến cá mập phải bơi để nước giàu Oxy tràn qua khe mang, đồng thời thiếu bong bóng cá khiến chúng phải bơi để không bị chìm xuống đáy."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong chu kỳ phân chia tế bào, tại sao ADN phải nhân đôi trước khi tế bào phân chia chính thức?",
    "a": "Để tăng kích thước nhân tế bào.",
    "b": "Để mỗi tế bào con sau khi phân chia đều nhận được một bộ thông tin di truyền hoàn chỉnh và giống hệt tế bào mẹ.",
    "c": "Để tế bào mẹ có đủ năng lượng phân chia.",
    "d": "Để ADN không bị hỏng trong quá trình phân chia.",
    "correct": "Để mỗi tế bào con sau khi phân chia đều nhận được một bộ thông tin di truyền hoàn chỉnh và giống hệt tế bào mẹ.",
    "explain": "Sự nhân đôi ADN đảm bảo tính ổn định của vật chất di truyền qua các thế hệ tế bào."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Hiện tượng 'tẩy trắng san hô' (coral bleaching) xảy ra chủ yếu do nguyên nhân nào sau đây?",
    "a": "Nước biển quá lạnh làm san hô chết.",
    "b": "Sự gia tăng nhiệt độ nước biển khiến tảo cộng sinh bị trục xuất khỏi cơ thể san hô, làm san hô mất nguồn cung cấp dinh dưỡng và màu sắc.",
    "c": "Sự xâm lược của các loài cá ăn thịt san hô.",
    "d": "Do san hô không thể quang hợp được trong bóng tối.",
    "correct": "Sự gia tăng nhiệt độ nước biển khiến tảo cộng sinh bị trục xuất khỏi cơ thể san hô, làm san hô mất nguồn cung cấp dinh dưỡng và màu sắc.",
    "explain": "San hô sống cộng sinh với tảo lục/tảo đơn bào. Stress nhiệt làm phá vỡ mối quan hệ này, dẫn đến cái chết của các rạn san hô."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Bào quan nào được coi là 'trạm tiêu hóa' của tế bào nhân thực, chứa các enzyme phân giải các chất hữu cơ và bào quan hỏng?",
    "a": "Peroxisome.",
    "b": "Lysosome.",
    "c": "Không bào.",
    "d": "Lưới nội chất trơn.",
    "correct": "Lysosome.",
    "explain": "Lysosome chứa các enzyme thủy phân mạnh mẽ, giúp tái chế các thành phần tế bào cũ và tiêu hóa các hạt thức ăn từ môi trường."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Đặc điểm cấu tạo nào của tế bào biểu bì lá giúp chúng thực hiện chức năng bảo vệ nhưng vẫn cho ánh sáng xuyên qua để quang hợp?",
    "a": "Tế bào biểu bì chứa rất nhiều lục lạp.",
    "b": "Tế bào biểu bì trong suốt, không có lục lạp (trừ tế bào hạt đậu của khí khổng) và có lớp cutin bao phủ.",
    "c": "Tế bào biểu bì có thành tế bào rất dày màu đen.",
    "d": "Tế bào biểu bì có dạng hình cầu lồi.",
    "correct": "Tế bào biểu bì trong suốt, không có lục lạp (trừ tế bào hạt đậu của khí khổng) và có lớp cutin bao phủ.",
    "explain": "Sự trong suốt cho phép ánh sáng đi tới mô giậu bên dưới, lớp cutin giúp chống mất nước và xâm nhiễm vi sinh vật."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Vì sao các loài chim có thể thực hiện được quá trình 'hô hấp kép', giúp chúng có đủ Oxy cho việc bay lượn tốn năng lượng?",
    "a": "Vì chúng có phổi to hơn các loài thú.",
    "b": "Vì hệ thống các túi khí phối hợp với phổi đảm bảo luôn có dòng khí giàu Oxy đi qua phổi cả khi hít vào và thở ra.",
    "c": "Vì chim có hai khí quản riêng biệt.",
    "d": "Vì chim có khả năng hấp thụ Oxy qua lông.",
    "correct": "Vì hệ thống các túi khí phối hợp với phổi đảm bảo luôn có dòng khí giàu Oxy đi qua phổi cả khi hít vào và thở ra.",
    "explain": "Cấu tạo túi khí giúp không khí đi theo một chiều nhất định qua phổi, tối ưu hóa việc trao đổi khí, không có 'khí cặn' như ở thú."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Loài thực vật nào sau đây có sự xen kẽ thế hệ, trong đó cây hữu tính (nguyên tản) sống độc lập và nhỏ bé so với cây vô tính (cây trưởng thành)?",
    "a": "Cây Rêu.",
    "b": "Cây Dương xỉ.",
    "c": "Cây Vạn tuế.",
    "d": "Cây Cam.",
    "correct": "Cây Dương xỉ.",
    "explain": "Ở Dương xỉ, thế hệ bào tử (vô tính) chiếm ưu thế, nhưng thế hệ giao tử (nguyên tản) vẫn là một cơ thể độc lập thực hiện quang hợp."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Chức năng quan trọng nhất của Lưới nội chất trơn trong tế bào gan người là gì?",
    "a": "Tổng hợp protein tiết.",
    "b": "Giải độc các chất hóa học và chuyển hóa lipid.",
    "c": "Chứa thông tin di truyền.",
    "d": "Tạo ra các gốc tự do để tiêu diệt vi khuẩn.",
    "correct": "Giải độc các chất hóa học và chuyển hóa lipid.",
    "explain": "Lưới nội chất trơn ở gan chứa nhiều enzyme chuyên biệt để biến đổi các chất độc hại thành chất không độc hoặc dễ đào thải."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Sự xuất hiện của 'Hạt' ở nhóm Hạt trần và Hạt kín có ưu thế tiến hóa hơn so với sinh sản bằng 'Bào tử' ở nhóm Rêu và Dương xỉ như thế nào?",
    "a": "Hạt nhỏ hơn nên dễ phát tán hơn bào tử.",
    "b": "Hạt chứa phôi và nguồn dinh dưỡng dự trữ, có vỏ bảo vệ giúp cây mầm có khả năng sống sót cao hơn trước điều kiện bất lợi.",
    "c": "Hạt không cần thụ phấn vẫn có thể mọc thành cây.",
    "d": "Hạt có khả năng quang hợp ngay khi mới hình thành.",
    "correct": "Hạt chứa phôi và nguồn dinh dưỡng dự trữ, có vỏ bảo vệ giúp cây mầm có khả năng sống sót cao hơn trước điều kiện bất lợi.",
    "explain": "Hạt là một cấu trúc phức tạp giúp bảo vệ thế hệ sau và cung cấp 'hành trang' dinh dưỡng ban đầu, giúp thực vật chiếm lĩnh các môi trường khô hạn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong một hệ sinh thái, tại sao chuỗi thức ăn thường không thể kéo dài quá 5-6 mắt xích?",
    "a": "Vì không có đủ loài sinh vật để tham gia.",
    "b": "Do sự thất thoát năng lượng qua mỗi bậc dinh dưỡng là rất lớn (khoảng 90%), năng lượng còn lại ở bậc cuối cùng không đủ duy trì một quần thể sinh vật.",
    "c": "Vì các sinh vật ở cuối chuỗi thức ăn thường bị bệnh.",
    "d": "Do diện tích bề mặt trái đất có hạn.",
    "correct": "Do sự thất thoát năng lượng qua mỗi bậc dinh dưỡng là rất lớn (khoảng 90%), năng lượng còn lại ở bậc cuối cùng không đủ duy trì một quần thể sinh vật.",
    "explain": "Hiệu suất sinh thái thấp (chỉ khoảng 10%) khiến năng lượng cạn kiệt rất nhanh khi lên các bậc dinh dưỡng cao hơn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Đặc điểm nào của hệ tuần hoàn ở Lớp Thú giúp chúng duy trì được thân nhiệt ổn định (động vật hằng nhiệt) tốt hơn Lớp Lưỡng cư?",
    "a": "Tim 3 ngăn có vách ngăn hụt.",
    "b": "Tim 4 ngăn hoàn toàn, máu nuôi cơ thể là máu đỏ tươi (giàu O2), không bị pha trộn.",
    "c": "Hệ tuần hoàn hở giúp máu lưu thông nhanh hơn.",
    "d": "Có mạng lưới mao mạch dày đặc ở da.",
    "correct": "Tim 4 ngăn hoàn toàn, máu nuôi cơ thể là máu đỏ tươi (giàu O2), không bị pha trộn.",
    "explain": "Sự phân tách hoàn toàn giữa máu giàu O2 và máu giàu CO2 giúp cung cấp năng lượng hiệu quả cho các phản ứng sinh nhiệt trong cơ thể."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Bào quan lục lạp và ti thể có điểm chung đặc biệt nào sau đây chứng minh giả thuyết chúng có nguồn gốc từ vi khuẩn cộng sinh?",
    "a": "Cả hai đều có kích thước bằng vi khuẩn.",
    "b": "Cả hai đều chứa ADN vòng riêng, ribosome riêng và có màng kép.",
    "c": "Cả hai đều chỉ xuất hiện ở tế bào thực vật.",
    "d": "Cả hai đều tham gia vào quá trình tiêu hóa của tế bào.",
    "correct": "Cả hai đều chứa ADN vòng riêng, ribosome riêng và có màng kép.",
    "explain": "Thuyết nội cộng sinh cho rằng ti thể và lục lạp vốn là các vi khuẩn nhân sơ sống cộng sinh trong tế bào tổ tiên, sau đó trở thành bào quan của tế bào nhân thực."
  },  
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong hiện tượng co nguyên sinh ở tế bào thực vật, tại sao màng sinh chất lại tách khỏi thành tế bào khi tế bào mất nước?",
    "a": "Do thành tế bào bị hòa tan bởi dung dịch ưu trương.",
    "b": "Do màng sinh chất có tính đàn hồi và co lại theo khối tế bào chất, trong khi thành tế bào bằng xenlulozơ cứng vững nên không co theo.",
    "c": "Do các protein trên màng sinh chất chủ động đẩy nước ra ngoài.",
    "d": "Do tế bào tự phá hủy màng để tiết kiệm năng lượng.",
    "correct": "Do màng sinh chất có tính đàn hồi và co lại theo khối tế bào chất, trong khi thành tế bào bằng xenlulozơ cứng vững nên không co theo.",
    "explain": "Thành tế bào thực vật có cấu trúc vững chắc giúp duy trì hình dạng. Khi mất nước, thể tích khối tế bào chất giảm làm màng sinh chất (vốn mềm dẻo) co lại và tách dần khỏi thành."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao các phân tử lớn như Protein hay Polysaccharide không thể đi qua màng sinh chất bằng các kênh protein hay kẽ hở giữa các phân tử lipid?",
    "a": "Vì chúng bị màng sinh chất đẩy ra do cùng điện tích.",
    "b": "Vì kích thước của chúng quá lớn so với đường kính của các kênh vận chuyển.",
    "c": "Vì chúng không tan trong nước.",
    "d": "Vì chúng chỉ được vận chuyển qua lưới nội chất.",
    "correct": "Vì kích thước của chúng quá lớn so với đường kính của các kênh vận chuyển.",
    "explain": "Các đại phân tử có kích thước vượt quá giới hạn của các kênh vận chuyển và khoảng cách giữa các lớp phospholipid, do đó chúng phải được vận chuyển bằng hình thức thực bào hoặc xuất bào."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Sự vận chuyển chủ động (active transport) qua màng sinh chất khác với vận chuyển thụ động ở điểm mấu chốt nào?",
    "a": "Vận chuyển chủ động không cần protein mang.",
    "b": "Vận chuyển chủ động diễn ra cùng chiều bậc thang nồng độ.",
    "c": "Vận chuyển chủ động tiêu tốn năng lượng ATP và có thể vận chuyển chất ngược chiều bậc thang nồng độ.",
    "d": "Vận chuyển chủ động chỉ xảy ra ở tế bào động vật.",
    "correct": "Vận chuyển chủ động tiêu tốn năng lượng ATP và có thể vận chuyển chất ngược chiều bậc thang nồng độ.",
    "explain": "Vận chuyển chủ động cho phép tế bào tích lũy các chất cần thiết ngay cả khi nồng độ bên ngoài thấp hơn bên trong, đổi lại tế bào phải chi trả năng lượng ATP."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Cơ chế nào giúp nước có thể vận chuyển ngược chiều trọng lực từ rễ lên đến tận ngọn những cây cao hàng chục mét?",
    "a": "Chỉ dựa vào áp suất rễ đẩy nước lên.",
    "b": "Chỉ dựa vào lực hút từ sự thoát hơi nước ở lá.",
    "c": "Sự kết hợp của áp suất rễ, lực liên kết giữa các phân tử nước với nhau và với thành mạch gỗ, cùng lực kéo từ thoát hơi nước.",
    "d": "Do cây có các máy bơm sinh học chủ động đẩy nước.",
    "correct": "Sự kết hợp của áp suất rễ, lực liên kết giữa các phân tử nước với nhau và với thành mạch gỗ, cùng lực kéo từ thoát hơi nước.",
    "explain": "Đây là thuyết dòng gắn kết - dòng kéo. Lực liên kết giữa các phân tử nước (hydrogen bond) tạo thành một cột nước liên tục, lực kéo từ lá là động lực chính."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong quá trình quang hợp, tại sao cường độ ánh sáng quá cao lại có thể làm giảm hiệu suất quang hợp (hiện tượng ức chế quang hợp)?",
    "a": "Vì ánh sáng mạnh làm đông đặc diệp lục.",
    "b": "Vì ánh sáng mạnh gây đóng khí khổng để tránh mất nước, dẫn đến thiếu CO2 cho pha tối.",
    "c": "Vì ánh sáng mạnh làm hỏng cấu trúc bộ máy quang hợp (quang phân li nước quá mạnh).",
    "d": "Cả b và c đều đúng.",
    "correct": "Cả b và c đều đúng.",
    "explain": "Ánh sáng quá mạnh vừa gây stress nhiệt/hủy hoại sắc tố, vừa khiến cây đóng khí khổng bảo vệ, làm gián đoạn nguồn CO2 cho quá trình tổng hợp đường."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Thực vật C4 và CAM có cơ chế cố định CO2 đặc biệt hơn thực vật C3. Mục đích chính của sự tiến hóa này là gì?",
    "a": "Để tăng tốc độ hô hấp tế bào.",
    "b": "Để quang hợp hiệu quả trong điều kiện nồng độ CO2 thấp, nhiệt độ cao và hạn chế mất nước.",
    "c": "Để không cần sử dụng lục lạp trong pha tối.",
    "d": "Để có thể quang hợp vào ban đêm mà không cần ánh sáng.",
    "correct": "Để quang hợp hiệu quả trong điều kiện nồng độ CO2 thấp, nhiệt độ cao và hạn chế mất nước.",
    "explain": "Các thực vật này có cơ chế tích trữ CO2 trung gian, giúp chúng duy trì quang hợp ngay cả khi khí khổng phải đóng một phần để tiết kiệm nước."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao các enzyme tiêu hóa (như pepsin) lại được tế bào tiết ra dưới dạng chưa hoạt động (tiền enzyme - pepsinogen)?",
    "a": "Để tiết kiệm năng lượng cho tế bào.",
    "b": "Để tránh việc enzyme tiêu hóa chính các cấu trúc protein của tế bào sản sinh ra nó.",
    "c": "Để enzyme có thể di chuyển nhanh hơn trong máu.",
    "d": "Để nồng độ enzyme không bị loãng.",
    "correct": "Để tránh việc enzyme tiêu hóa chính các cấu trúc protein của tế bào sản sinh ra nó.",
    "explain": "Enzyme thủy phân protein rất mạnh. Nếu hoạt động ngay trong tế bào, chúng sẽ phân hủy các bào quan. Chúng chỉ được kích hoạt khi đã vào trong khoang tiêu hóa (dạ dày)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong hệ tuần hoàn kín của động vật có xương sống, tại sao máu chảy trong động mạch lại có áp lực cao hơn nhiều so với trong tĩnh mạch?",
    "a": "Vì động mạch nằm gần bề mặt da hơn.",
    "b": "Vì động mạch nhận máu trực tiếp từ tâm thất khi tim co bóp mạnh, và thành động mạch có lớp cơ dày, đàn hồi.",
    "c": "Vì tĩnh mạch chứa nhiều van ngăn máu chảy ngược làm giảm áp lực.",
    "d": "Vì máu trong động mạch có nồng độ Oxy cao hơn nên nặng hơn.",
    "correct": "Vì động mạch nhận máu trực tiếp từ tâm thất khi tim co bóp mạnh, và thành động mạch có lớp cơ dày, đàn hồi.",
    "explain": "Sự co bóp của tim tạo ra áp lực lớn đẩy máu vào động mạch. Huyết áp giảm dần khi máu đi qua mao mạch và thấp nhất ở tĩnh mạch."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Côn trùng (như châu chấu) có hệ tuần hoàn hở. Vậy chúng vận chuyển khí Oxy tới các tế bào bằng cách nào?",
    "a": "Hòa tan Oxy vào máu rồi bơm đi khắp cơ thể.",
    "b": "Oxy khuếch tán trực tiếp qua da.",
    "c": "Thông qua hệ thống ống khí phân nhánh nhỏ tới tận từng tế bào, không phụ thuộc vào hệ tuần hoàn.",
    "d": "Nhờ các túi khí dự trữ Oxy ở chân.",
    "correct": "Thông qua hệ thống ống khí phân nhánh nhỏ tới tận từng tế bào, không phụ thuộc vào hệ tuần hoàn.",
    "explain": "Ở côn trùng, máu chỉ vận chuyển chất dinh dưỡng và chất thải. Hệ thống ống khí giúp trao đổi khí trực tiếp, đảm bảo cung cấp Oxy nhanh cho hoạt động bay lượn tốn năng lượng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Nếu một người bị thiếu sắt nghiêm trọng trong chế độ ăn, hệ cơ quan nào sẽ bị ảnh hưởng trực tiếp và sớm nhất?",
    "a": "Hệ xương khớp vì sắt cấu tạo nên xương.",
    "b": "Hệ tuần hoàn và hô hấp vì thiếu sắt dẫn đến thiếu Hemoglobin, giảm khả năng vận chuyển Oxy.",
    "c": "Hệ tiêu hóa vì sắt giúp co bóp dạ dày.",
    "d": "Hệ bài tiết vì thận cần sắt để lọc máu.",
    "correct": "Hệ tuần hoàn và hô hấp vì thiếu sắt dẫn đến thiếu Hemoglobin, giảm khả năng vận chuyển Oxy.",
    "explain": "Sắt là thành phần trung tâm của nhân Heme trong Hemoglobin (hồng cầu). Thiếu sắt gây thiếu máu, làm cơ thể suy nhược do thiếu Oxy cho hô hấp tế bào."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao rễ cây thực vật trên cạn khi bị ngập úng lâu ngày lại thường bị thối và chết?",
    "a": "Vì rễ cây hấp thụ quá nhiều nước gây vỡ tế bào.",
    "b": "Vì môi trường ngập nước thiếu Oxy, tế bào rễ phải hô hấp kị khí, sinh ra các chất độc (như ethanol) gây chết tế bào rễ.",
    "c": "Vì nước ngập làm trôi hết chất dinh dưỡng quanh rễ.",
    "d": "Vì vi khuẩn dưới nước tấn công rễ.",
    "correct": "Vì môi trường ngập nước thiếu Oxy, tế bào rễ phải hô hấp kị khí, sinh ra các chất độc (như ethanol) gây chết tế bào rễ.",
    "explain": "Tế bào rễ cần Oxy để hô hấp hiếu khí tạo ATP cho vận chuyển chủ động khoáng. Khi thiếu Oxy, hô hấp kị khí tạo ra sản phẩm phụ độc hại phá hủy mô rễ."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tế bào bạch cầu tiêu diệt vi khuẩn xâm nhập bằng cách 'thực bào'. Quá trình này tiêu tốn năng lượng và liên quan đến bào quan nào nhất?",
    "a": "Lưới nội chất hạt.",
    "b": "Màng sinh chất và Lysosome.",
    "c": "Ti thể và Trung thể.",
    "d": "Ribosome và Bộ máy Golgi.",
    "correct": "Màng sinh chất và Lysosome.",
    "explain": "Màng sinh chất biến dạng để bao lấy vi khuẩn, tạo túi thực bào. Sau đó túi này hòa hợp với Lysosome để enzyme thủy phân tiêu diệt vi khuẩn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong sự tiến hóa của hệ thần kinh, tại sao 'hình thức hệ thần kinh dạng ống' (ở Động vật có xương sống) lại ưu việt hơn 'dạng lưới' hay 'dạng chuỗi hạch'?",
    "a": "Vì hệ thần kinh dạng ống có kích thước lớn hơn.",
    "b": "Vì nó cho phép tập trung hóa các tế bào thần kinh, hình thành não bộ phát triển, giúp xử lý thông tin phức tạp và điều khiển hành vi tinh vi.",
    "c": "Vì hệ thần kinh dạng ống dẫn truyền xung thần kinh chậm hơn giúp con người suy nghĩ kỹ.",
    "d": "Vì hệ thần kinh dạng ống không bao giờ bị tổn thương.",
    "correct": "Vì nó cho phép tập trung hóa các tế bào thần kinh, hình thành não bộ phát triển, giúp xử lý thông tin phức tạp và điều khiển hành vi tinh vi.",
    "explain": "Sự tập trung thần kinh về phía đầu (đầu hóa) và sự phân hóa chức năng rõ rệt giúp sinh vật phản ứng nhanh, chính xác và thích nghi cao với môi trường."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Phụ nữ mang thai thường được khuyến cáo bổ sung Axit Folic (Vitamin B9). Thiếu hụt chất này ảnh hưởng đến quá trình nào của phôi thai?",
    "a": "Quá trình hình thành xương.",
    "b": "Quá trình đóng ống thần kinh và phân chia tế bào.",
    "c": "Quá trình hình thành hệ tiêu hóa.",
    "d": "Quá trình trao đổi chất qua nhau thai.",
    "correct": "Quá trình đóng ống thần kinh và phân chia tế bào.",
    "explain": "Axit Folic cần thiết cho tổng hợp nucleotide và phân chia tế bào. Thiếu hụt trong giai đoạn sớm của thai kỳ gây ra các dị tật ống thần kinh nghiêm trọng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Sự khác biệt về chiến lược sinh sản giữa cá (đẻ nhiều trứng, thụ tinh ngoài) và thú (đẻ ít con, thụ tinh trong, nuôi con) thể hiện điều gì?",
    "a": "Cá tiến hóa hơn thú vì đẻ được nhiều hơn.",
    "b": "Thú có tỉ lệ sống sót của con non cao hơn nhờ sự bảo vệ và chăm sóc, dù số lượng cá thể sinh ra ít hơn.",
    "c": "Thụ tinh ngoài an toàn hơn thụ tinh trong.",
    "d": "Động vật máu lạnh luôn đẻ nhiều hơn động vật máu nóng.",
    "correct": "Thú có tỉ lệ sống sót của con non cao hơn nhờ sự bảo vệ và chăm sóc, dù số lượng cá thể sinh ra ít hơn.",
    "explain": "Đây là hai chiến lược sinh tồn khác nhau. Thú đầu tư năng lượng vào việc nuôi dưỡng (chăm sóc hậu sản) để đảm bảo chất lượng thế hệ sau."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong cấu tạo của lá cây, lớp mô giậu (palisade mesophyll) nằm ngay sát biểu bì trên có đặc điểm gì phù hợp với chức năng quang hợp?",
    "a": "Tế bào xếp thưa thớt để khí CO2 dễ khuếch tán.",
    "b": "Tế bào hình cột, xếp sát nhau và chứa rất nhiều lục lạp để hấp thụ tối đa ánh sáng mặt trời.",
    "c": "Tế bào không có lục lạp nhưng có thành dày bảo vệ lá.",
    "d": "Chứa các lỗ khí khổng để trao đổi khí.",
    "correct": "Tế bào hình cột, xếp sát nhau và chứa rất nhiều lục lạp để hấp thụ tối đa ánh sáng mặt trời.",
    "explain": "Vị trí sát bề mặt trên giúp tiếp cận ánh sáng đầu tiên, cấu trúc xếp sít nhau tối ưu hóa diện tích bề mặt hấp thụ quang năng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao các loài chim di cư có thể bay liên tục hàng ngàn km mà không bị lạc đường (về mặt sinh học)?",
    "a": "Vì chúng có trí nhớ tuyệt vời về mọi cái cây chúng đi qua.",
    "b": "Nhờ khả năng cảm nhận từ trường Trái đất thông qua các thụ thể đặc biệt chứa tinh thể magnetit và định hướng theo thiên thể.",
    "c": "Vì chúng luôn bay theo chim đầu đàn.",
    "d": "Vì gió luôn thổi chúng về đúng hướng.",
    "correct": "Nhờ khả năng cảm nhận từ trường Trái đất thông qua các thụ thể đặc biệt chứa tinh thể magnetit và định hướng theo thiên thể.",
    "explain": "Định hướng sinh học là sự kết hợp phức tạp của 'la bàn' từ tính nội tại, vị trí mặt trời/ngôi sao và trí nhớ về bản đồ mùi hương/địa hình."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Hiện tượng 'hướng động' (tropic movement) ở thực vật, ví dụ rễ hướng nước, thân hướng sáng, được điều khiển chủ yếu bởi hormone nào?",
    "a": "Ethylene.",
    "b": "Auxin (IAA).",
    "c": "Cytokinin.",
    "d": "Axit Abscisic.",
    "correct": "Auxin (IAA).",
    "explain": "Auxin phân bố không đều ở hai phía của cơ quan (do tác động của ánh sáng hoặc trọng lực), kích thích sự kéo dài tế bào không đều, dẫn đến sự uốn cong."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Điều gì xảy ra với các protein trong cơ thể người nếu nhiệt độ cơ thể tăng quá cao (trên 42 độ C) trong thời gian dài?",
    "a": "Protein sẽ phân chia nhanh hơn để bù đắp.",
    "b": "Protein bị biến tính (mất cấu trúc không gian), dẫn đến mất chức năng sinh học và có thể gây tử vong.",
    "c": "Protein sẽ chuyển hóa thành đường để cung cấp năng lượng.",
    "d": "Protein sẽ trở nên bền vững hơn.",
    "correct": "Protein bị biến tính (mất cấu trúc không gian), dẫn đến mất chức năng sinh học và có thể gây tử vong.",
    "explain": "Cấu trúc bậc 3, 4 của protein rất nhạy cảm với nhiệt độ. Khi bị biến tính, các enzyme và protein cấu trúc không thể hoạt động, làm sụp đổ các quá trình chuyển hóa."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao việc lạm dụng kháng sinh lại dẫn đến sự hình thành các chủng vi khuẩn 'siêu kháng thuốc'?",
    "a": "Vì kháng sinh làm cho vi khuẩn trở nên thông minh hơn.",
    "b": "Vì kháng sinh tiêu diệt các vi khuẩn yếu, tạo môi trường thuận lợi cho các cá thể vi khuẩn có đột biến kháng thuốc sống sót và nhân bản (chọn lọc tự nhiên).",
    "c": "Vì kháng sinh làm yếu hệ miễn dịch của con người.",
    "d": "Vì vi khuẩn ăn kháng sinh để lớn lên.",
    "correct": "Vì kháng sinh tiêu diệt các vi khuẩn yếu, tạo môi trường thuận lợi cho các cá thể vi khuẩn có đột biến kháng thuốc sống sót và nhân bản (chọn lọc tự nhiên).",
    "explain": "Kháng sinh đóng vai trò là áp lực chọn lọc. Việc dùng không đủ liều hoặc dùng bừa bãi giúp vi khuẩn kháng thuốc chiếm ưu thế tuyệt đối."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong một hồ nước, nếu lượng tảo phát triển quá mức (hiện tượng nở hoa của tảo) sẽ dẫn đến cá bị chết hàng loạt. Nguyên nhân chính là gì?",
    "a": "Tảo tiết ra chất độc trực tiếp giết chết cá.",
    "b": "Vào ban đêm, tảo hô hấp tiêu thụ hết Oxy hòa tan trong nước; đồng thời khi tảo chết, vi khuẩn phân hủy chúng tiêu tốn rất nhiều Oxy, gây ngạt cho cá.",
    "c": "Tảo che lấp tầm nhìn làm cá không tìm được thức ăn.",
    "d": "Tảo làm nước quá nóng khiến cá không chịu được.",
    "correct": "Vào ban đêm, tảo hô hấp tiêu thụ hết Oxy hòa tan trong nước; đồng thời khi tảo chết, vi khuẩn phân hủy chúng tiêu tốn rất nhiều Oxy, gây ngạt cho cá.",
    "explain": "Đây là hiện tượng phú dưỡng (eutrophication). Sự mất cân bằng Oxy là nguyên nhân chính gây tử vong cho các loài động vật thủy sinh."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao một số loài thực vật (như cây bèo đất, cây nắp ấm) lại có khả năng bắt và tiêu hóa côn trùng dù chúng vẫn có diệp lục để quang hợp?",
    "a": "Vì chúng thích ăn thịt.",
    "b": "Vì chúng sống ở môi trường nghèo khoáng, đặc biệt là thiếu Đạm (Nitơ), nên cần bổ sung từ cơ thể côn trùng.",
    "c": "Vì chúng không thể quang hợp vào mùa đông.",
    "d": "Để ngăn chặn côn trùng ăn lá của chúng.",
    "correct": "Vì chúng sống ở môi trường nghèo khoáng, đặc biệt là thiếu Đạm (Nitơ), nên cần bổ sung từ cơ thể côn trùng.",
    "explain": "Bắt mồi là sự thích nghi thứ cấp để lấy chất dinh dưỡng thiết yếu (Nitơ, Phốt pho) từ nguồn hữu cơ khi môi trường đất quá nghèo nàn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Cấu tạo của dạ dày chim có điểm gì đặc biệt để bù đắp cho việc chúng không có răng để nhai thức ăn?",
    "a": "Dạ dày chim chứa axit rất mạnh hòa tan xương.",
    "b": "Dạ dày được chia thành dạ dày tuyến (tiết dịch vị) và dạ dày cơ (mề) có lớp cơ rất khỏe giúp nghiền nát thức ăn.",
    "c": "Chim có hai dạ dày giống nhau để chứa nhiều thức ăn.",
    "d": "Chim nhai thức ăn trong diều.",
    "correct": "Dạ dày được chia thành dạ dày tuyến (tiết dịch vị) và dạ dày cơ (mề) có lớp cơ rất khỏe giúp nghiền nát thức ăn.",
    "explain": "Mề chim thường chứa cả sỏi (do chim nuốt vào) đóng vai trò như những chiếc răng nghiền cơ học thức ăn trước khi tiêu hóa hóa học."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao động vật hằng nhiệt (máu nóng) như chim và thú thường cần lượng thức ăn nhiều hơn rất nhiều so với động vật biến nhiệt (máu lạnh) cùng kích cỡ?",
    "a": "Vì chúng lười vận động hơn.",
    "b": "Vì chúng cần một lượng lớn năng lượng để duy trì thân nhiệt ổn định cao hơn nhiệt độ môi trường thông qua các phản ứng chuyển hóa.",
    "c": "Vì hệ tiêu hóa của chúng kém hiệu quả.",
    "d": "Vì chúng có tuổi thọ dài hơn.",
    "correct": "Vì chúng cần một lượng lớn năng lượng để duy trì thân nhiệt ổn định cao hơn nhiệt độ môi trường thông qua các phản ứng chuyển hóa.",
    "explain": "Duy trì thân nhiệt là một quá trình tốn kém năng lượng. Đổi lại, động vật hằng nhiệt có thể hoạt động tích cực trong mọi điều kiện thời tiết."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong sự phân chia tế bào nhân thực, nếu các thoi vô sắc không hình thành, hệ quả trực tiếp là gì?",
    "a": "ADN không thể nhân đôi.",
    "b": "Các nhiễm sắc thể không thể phân ly đồng đều về hai cực của tế bào con.",
    "c": "Màng nhân không thể biến mất.",
    "d": "Tế bào sẽ bị vỡ.",
    "correct": "Các nhiễm sắc thể không thể phân ly đồng đều về hai cực của tế bào con.",
    "explain": "Thoi vô sắc (tạo từ vi ống) là bộ phận điều khiển sự vận chuyển vật chất di truyền. Không có thoi, tế bào có thể trở thành tế bào đa bội hoặc bị lỗi di truyền."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao thực vật ở vùng sa mạc thường thực hiện pha tối của quang hợp (chu trình Calvin) vào ban ngày nhưng lại lấy CO2 vào ban đêm?",
    "a": "Vì ban đêm không có ánh sáng để CO2 phản ứng.",
    "b": "Để tránh mất nước qua việc mở khí khổng vào ban ngày khi trời nóng gắt (Cơ chế CAM).",
    "c": "Vì ban đêm nồng độ CO2 cao hơn.",
    "d": "Vì ban ngày chúng phải bận tập trung vào việc hút nước.",
    "correct": "Để tránh mất nước qua việc mở khí khổng vào ban ngày khi trời nóng gắt (Cơ chế CAM).",
    "explain": "Thực vật CAM mở khí khổng ban đêm để lấy CO2 và dự trữ dưới dạng axit hữu cơ, sau đó đóng khí khổng ban ngày và dùng CO2 dự trữ để quang hợp khi có nắng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Cấu tạo 'bong bóng cá' ở cá xương có ý nghĩa gì trong sự thích nghi dưới nước?",
    "a": "Giúp cá hô hấp khi thiếu Oxy.",
    "b": "Giúp cá điều chỉnh tỉ trọng cơ thể để chìm xuống hoặc nổi lên một cách chủ động mà không cần tốn nhiều năng lượng bơi.",
    "c": "Dùng để dự trữ thức ăn.",
    "d": "Giúp cá nghe được âm thanh dưới nước.",
    "correct": "Giúp cá điều chỉnh tỉ trọng cơ thể để chìm xuống hoặc nổi lên một cách chủ động mà không cần tốn nhiều năng lượng bơi.",
    "explain": "Thay đổi lượng khí trong bong bóng làm thay đổi thể tích cơ thể, từ đó thay đổi lực đẩy Acsimet giúp cá đứng yên ở các độ sâu khác nhau."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Hệ thần kinh dạng chuỗi hạch (ở Giun đất, Côn trùng) có ưu điểm gì hơn so với hệ thần kinh dạng lưới (ở Thủy tức)?",
    "a": "Xung thần kinh đi chậm hơn giúp cơ thể phản ứng bình tĩnh.",
    "b": "Cho phép phản ứng cục bộ, chính xác và tiết kiệm năng lượng hơn khi chỉ có một phần cơ thể bị kích thích.",
    "c": "Giúp sinh vật không cảm thấy đau đớn.",
    "d": "Làm cho cơ thể trở nên cứng cáp hơn.",
    "correct": "Cho phép phản ứng cục bộ, chính xác và tiết kiệm năng lượng hơn khi chỉ có một phần cơ thể bị kích thích.",
    "explain": "Trong hệ mạng lưới, kích thích tại một điểm lan tỏa khắp cơ thể (phản ứng toàn thân). Hệ chuỗi hạch giúp điều khiển chính xác các phân đoạn cơ thể riêng biệt."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao nấm không được xếp vào giới Động vật dù chúng cũng là sinh vật dị dưỡng?",
    "a": "Vì nấm có kích thước nhỏ.",
    "b": "Vì nấm có thành tế bào bằng kitin và sống cố định, không có khả năng di chuyển chủ động như động vật.",
    "c": "Vì nấm sinh sản bằng bào tử.",
    "d": "Cả b và c đều đúng.",
    "correct": "Cả b và c đều đúng.",
    "explain": "Sự kết hợp của thành tế bào kitin, lối sống bám (cố định) và chu trình đời sống đặc trưng khiến nấm tách biệt hoàn toàn với động vật."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong chuỗi thức ăn, sinh vật tiêu thụ bậc 1 luôn là nhóm sinh vật nào?",
    "a": "Thực vật tự dưỡng.",
    "b": "Động vật ăn thực vật (herbivores).",
    "c": "Động vật ăn thịt (carnivores).",
    "d": "Vi sinh vật phân giải.",
    "correct": "Động vật ăn thực vật (herbivores).",
    "explain": "Mắt xích đầu tiên là sinh vật sản xuất. Sinh vật tiêu thụ bậc 1 là sinh vật trực tiếp sử dụng năng lượng từ sinh vật sản xuất."
  }, 
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao việc cá xương thực hiện cơ chế trao đổi khí 'ngược dòng' (máu chảy trong mao mạch mang ngược chiều với dòng nước) lại hiệu quả hơn so với cơ chế 'cùng dòng'?",
    "a": "Vì máu chảy ngược chiều sẽ tạo ra áp lực lớn hơn để hút Oxy.",
    "b": "Vì nó duy trì được sự chênh lệch nồng độ Oxy giữa nước và máu suốt dọc chiều dài mao mạch mang, giúp tối ưu hóa việc khuếch tán.",
    "c": "Vì nước lạnh hơn máu nên cần chảy ngược chiều để trao đổi nhiệt.",
    "d": "Vì cơ chế này giúp cá bơi nhanh hơn về phía trước.",
    "correct": "Vì nó duy trì được sự chênh lệch nồng độ Oxy giữa nước và máu suốt dọc chiều dài mao mạch mang, giúp tối ưu hóa việc khuếch tán.",
    "explain": "Cơ chế ngược dòng đảm bảo nước luôn có nồng độ Oxy cao hơn máu tại mọi điểm tiếp xúc, cho phép cá xương lấy được tới 80% lượng Oxy hòa tan trong nước."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong cấu trúc của ADN, tại sao các cặp bazơ nitơ luôn liên kết theo nguyên tắc bổ sung (A-T bằng 2 liên kết Hidro, G-X bằng 3 liên kết Hidro)?",
    "a": "Để ADN có thể dễ dàng bị phá hủy khi cần thiết.",
    "b": "Để đảm bảo khoảng cách giữa hai mạch đơn của ADN luôn ổn định và thông tin di truyền được sao chép chính xác.",
    "c": "Vì các bazơ nitơ này có cùng kích thước.",
    "d": "Để ADN có thể tan trong nước dễ dàng hơn.",
    "correct": "Để đảm bảo khoảng cách giữa hai mạch đơn của ADN luôn ổn định và thông tin di truyền được sao chép chính xác.",
    "explain": "Nguyên tắc bổ sung giữa một bazơ lớn (Purine) và một bazơ nhỏ (Pyrimidine) giữ cho đường kính chuỗi xoắn kép không đổi và là cơ sở cho sự tự nhân đôi ADN chính xác."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Hiện tượng 'thăng hoa' của cây trồng (guttation - ứ giọt) thường xuất hiện dưới dạng các giọt nước ở mép lá vào sáng sớm. Điều kiện ngoại cảnh nào thúc đẩy hiện tượng này?",
    "a": "Trời nắng gắt và gió mạnh.",
    "b": "Độ ẩm không khí rất cao, sự thoát hơi nước bị ngưng trệ trong khi áp suất rễ vẫn đẩy nước lên mạnh.",
    "c": "Cây đang bị thiếu nước trầm trọng.",
    "d": "Nhiệt độ môi trường xuống dưới 0 độ C.",
    "correct": "Độ ẩm không khí rất cao, sự thoát hơi nước bị ngưng trệ trong khi áp suất rễ vẫn đẩy nước lên mạnh.",
    "explain": "Khi không khí bão hòa hơi nước, nước không thể bay hơi qua khí khổng. Áp suất rễ đẩy nước lên quá mạnh khiến nước bị ép ra ngoài qua các thủy khổng ở mép lá."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao các loài thực vật ở vùng ngập mặn (như cây đước, cây mắm) lại có thể hút được nước từ môi trường có nồng độ muối cao hơn nhiều so với tế bào bình thường?",
    "a": "Vì chúng hút muối vào để làm giảm nồng độ dịch bào.",
    "b": "Nhờ duy trì nồng độ chất tan trong không bào cực cao (tạo môi trường ưu trương nội bào) và có các tuyến tiết muối dư thừa qua lá.",
    "c": "Vì rễ của chúng có màng lọc muối tuyệt đối.",
    "d": "Vì chúng chỉ sử dụng nước mưa rơi trên lá.",
    "correct": "Nhờ duy trì nồng độ chất tan trong không bào cực cao (tạo môi trường ưu trương nội bào) và có các tuyến tiết muối dư thừa qua lá.",
    "explain": "Để hút được nước từ môi trường mặn, áp suất thẩm thấu của rễ phải lớn hơn môi trường. Thực vật ngập mặn tích lũy chất hữu cơ và ion khoáng trong tế bào để đạt được điều này."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Bào quan nào chứa các enzyme oxy hóa giúp phân giải các axit béo và giải độc rượu bằng cách chuyển hóa chúng thành H2O2, sau đó thành nước?",
    "a": "Lysosome.",
    "b": "Peroxisome.",
    "c": "Không bào.",
    "d": "Lưới nội chất hạt.",
    "correct": "Peroxisome.",
    "explain": "Peroxisome đóng vai trò quan trọng trong việc bảo vệ tế bào khỏi các gốc tự do và tham gia vào quá trình chuyển hóa lipid phức tạp."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Xét về hiệu quả năng lượng, tại sao hô hấp hiếu khí (có Oxy) lại ưu việt hơn hẳn so với lên men kị khí?",
    "a": "Vì hô hấp hiếu khí diễn ra nhanh hơn.",
    "b": "Vì hô hấp hiếu khí phân giải hoàn toàn glucozo thành CO2 và nước, giải phóng tối đa năng lượng (khoảng 36-38 ATP), trong khi lên men chỉ tạo 2 ATP.",
    "c": "Vì lên men tạo ra các chất độc làm chết tế bào ngay lập tức.",
    "d": "Vì Oxy cung cấp năng lượng trực tiếp cho tế bào.",
    "correct": "Vì hô hấp hiếu khí phân giải hoàn toàn glucozo thành CO2 và nước, giải phóng tối đa năng lượng (khoảng 36-38 ATP), trong khi lên men chỉ tạo 2 ATP.",
    "explain": "Sự có mặt của Oxy cho phép chuỗi chuyền electron hoạt động trong ti thể, giúp khai thác triệt để năng lượng hóa học trong các liên kết của glucozo."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Điều gì sẽ xảy ra với tế bào hồng cầu người nếu được đưa vào môi trường nước biển (có nồng độ muối khoảng 3,5%)?",
    "a": "Tế bào sẽ trương phồng và vỡ ra (tiêu huyết).",
    "b": "Tế bào sẽ bị mất nước, co rúm lại và biến dạng.",
    "c": "Tế bào vẫn giữ nguyên hình dạng vì có màng nhân bảo vệ.",
    "d": "Tế bào sẽ phân chia nhanh chóng để bù đắp nồng độ.",
    "correct": "Tế bào sẽ bị mất nước, co rúm lại và biến dạng.",
    "explain": "Nước biển là môi trường ưu trương đối với hồng cầu (đẳng trương là 0,9%). Theo quy luật thẩm thấu, nước từ trong tế bào sẽ đi ra ngoài môi trường làm tế bào co lại."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong sự tiến hóa của giới Động vật, hệ thần kinh dạng ống có nguồn gốc từ lá phôi nào?",
    "a": "Nội bì.",
    "b": "Trung bì.",
    "c": "Ngoại bì.",
    "d": "Cả ba lá phôi.",
    "correct": "Ngoại bì.",
    "explain": "Hệ thần kinh và biểu bì da đều được hình thành từ lớp lá phôi ngoài (ngoại bì) trong quá trình phát triển phôi sớm."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Loài sinh vật nào dưới đây được coi là 'sinh vật chỉ thị' cho môi trường không khí sạch, vì chúng rất nhạy cảm với ô nhiễm khí lưu huỳnh đioxit (SO2)?",
    "a": "Nấm rơm.",
    "b": "Địa y.",
    "c": "Rêu tường.",
    "d": "Tảo lục.",
    "correct": "Địa y.",
    "explain": "Địa y hấp thụ nước và chất dinh dưỡng trực tiếp từ không khí. Do không có lớp biểu bì bảo vệ, chúng dễ dàng bị tiêu diệt bởi các khí độc như SO2, nên nơi nào có địa y phát triển chứng tỏ không khí trong lành."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao các loài thú ăn cỏ (như trâu, bò) có thể tiêu hóa được xenlulozơ trong khi chúng không tự sản sinh ra enzyme cellulase?",
    "a": "Nhờ chúng nhai đi nhai lại nhiều lần làm nát xenlulozơ.",
    "b": "Nhờ sự hỗ trợ của các vi sinh vật (vi khuẩn, động vật nguyên sinh) sống cộng sinh trong hệ tiêu hóa (như dạ cỏ).",
    "c": "Nhờ axit dạ dày cực mạnh hòa tan được gỗ.",
    "d": "Vì chúng ăn kèm với các loại nấm có sẵn cellulase.",
    "correct": "Nhờ sự hỗ trợ của các vi sinh vật (vi khuẩn, động vật nguyên sinh) sống cộng sinh trong hệ tiêu hóa (như dạ cỏ).",
    "explain": "Mối quan hệ cộng sinh giữa thú nhai lại và vi sinh vật cho phép chúng khai thác nguồn năng lượng dồi dào từ thực vật mà đa số động vật khác không làm được."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Khái niệm 'Dòng năng lượng trong hệ sinh thái' tuân theo quy luật nhiệt động lực học nào?",
    "a": "Năng lượng được bảo toàn tuyệt đối từ bậc dưỡng thấp lên bậc dưỡng cao.",
    "b": "Năng lượng truyền một chiều từ sinh vật sản xuất qua các bậc dinh dưỡng và bị thất thoát dần qua nhiệt và chất thải.",
    "c": "Năng lượng được tái tuần hoàn hoàn toàn giống như vật chất.",
    "d": "Sinh vật tiêu thụ bậc cao tạo ra nhiều năng lượng hơn sinh vật sản xuất.",
    "correct": "Năng lượng truyền một chiều từ sinh vật sản xuất qua các bậc dinh dưỡng và bị thất thoát dần qua nhiệt và chất thải.",
    "explain": "Khác với vật chất được tuần hoàn, năng lượng đi vào hệ sinh thái dưới dạng ánh sáng và đi ra dưới dạng nhiệt, không thể tái sử dụng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Sự khác biệt chính về chức năng giữa Ribosome tự do trong tế bào chất và Ribosome gắn trên lưới nội chất hạt là gì?",
    "a": "Ribosome tự do tổng hợp protein cho tế bào, Ribosome hạt tổng hợp protein để tiết ra ngoài hoặc cấu tạo màng.",
    "b": "Ribosome hạt tổng hợp nhanh hơn.",
    "c": "Ribosome tự do chỉ có ở vi khuẩn.",
    "d": "Không có sự khác biệt về chức năng.",
    "correct": "Ribosome tự do tổng hợp protein cho tế bào, Ribosome hạt tổng hợp protein để tiết ra ngoài hoặc cấu tạo màng.",
    "explain": "Đây là sự phân hóa chức năng giúp tế bào quản lý các loại protein khác nhau một cách hiệu quả."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Hiện tượng 'tự tỉa thưa' ở thực vật khi trồng quá dày là kết quả của mối quan hệ nào?",
    "a": "Cạnh tranh cùng loài.",
    "b": "Cạnh tranh khác loài.",
    "c": "Hỗ trợ cùng loài.",
    "d": "Ức chế - cảm nhiễm.",
    "correct": "Cạnh tranh cùng loài.",
    "explain": "Khi mật độ quá cao, các cá thể cùng loài tranh giành ánh sáng và dinh dưỡng. Những cá thể yếu sẽ bị chết, giúp quần thể duy trì mật độ phù hợp với sức chứa môi trường."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao các tế bào cơ tim lại chứa số lượng ti thể nhiều hơn đáng kể so với tế bào biểu bì da?",
    "a": "Để tim có thể co bóp mạnh mẽ và liên tục mà không bị mỏi nhờ nguồn ATP dồi dào.",
    "b": "Để tim có màu đỏ đậm hơn.",
    "c": "Để chống lại các bệnh về tim mạch.",
    "d": "Để tim không bị đóng băng khi trời lạnh.",
    "correct": "Để tim có thể co bóp mạnh mẽ và liên tục mà không bị mỏi nhờ nguồn ATP dồi dào.",
    "explain": "Mật độ ti thể phản ánh mức độ hoạt động chuyển hóa của tế bào. Cơ tim cần năng lượng cực lớn để duy trì nhịp đập suốt đời."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Cấu trúc 'Nút xoang nhĩ' ở tim thú đóng vai trò gì trong hệ tuần hoàn?",
    "a": "Dẫn máu từ tĩnh mạch về tim.",
    "b": "Là trung tâm phát nhịp tự động, điều khiển nhịp đập của tim không phụ thuộc vào kích thích bên ngoài.",
    "c": "Ngăn máu chảy ngược từ tâm thất về tâm nhĩ.",
    "d": "Lọc các tạp chất trong máu trước khi vào tim.",
    "correct": "Là trung tâm phát nhịp tự động, điều khiển nhịp đập của tim không phụ thuộc vào kích thích bên ngoài.",
    "explain": "Tính tự động của tim cho phép nó duy trì sự sống ngay cả khi hệ thần kinh trung ương gặp sự cố tạm thời."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao đột biến gen xảy ra ở tế bào sinh dưỡng (soma) thường không di truyền được cho thế hệ sau ở động vật hữu tính?",
    "a": "Vì tế bào sinh dưỡng không tham gia vào quá trình thụ tinh tạo giao tử.",
    "b": "Vì đột biến gen luôn là có hại.",
    "c": "Vì cơ thể sẽ tự loại bỏ các tế bào đột biến.",
    "d": "Vì gen đột biến ở tế bào sinh dưỡng sẽ biến mất khi cơ thể chết.",
    "correct": "Vì tế bào sinh dưỡng không tham gia vào quá trình thụ tinh tạo giao tử.",
    "explain": "Chỉ có đột biến xảy ra ở dòng tế bào sinh dục (tạo ra trứng hoặc tinh trùng) mới có khả năng truyền sang đời con qua con đường sinh sản hữu tính."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong chu kỳ tế bào, 'Điểm kiểm soát' (Checkpoint) G1/S có vai trò gì quan trọng nhất?",
    "a": "Kiểm tra xem thoi vô sắc đã gắn vào nhiễm sắc thể chưa.",
    "b": "Kiểm tra kích thước tế bào và các sai sót ADN trước khi bắt đầu sao chép vật chất di truyền.",
    "c": "Đảm bảo tế bào đã chia đôi hoàn toàn.",
    "d": "Kích thích tế bào chết ngay lập tức.",
    "correct": "Kiểm tra kích thước tế bào và các sai sót ADN trước khi bắt đầu sao chép vật chất di truyền.",
    "explain": "Nếu ADN bị hỏng, điểm kiểm soát này sẽ ngăn tế bào tiến vào pha S để sửa chữa, phòng ngừa việc nhân bản các lỗi gen dẫn đến ung thư."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Thực vật hạt kín thường có cấu trúc 'Thụ tinh kép'. Sản phẩm của quá trình này bao gồm những gì?",
    "a": "Hợp tử (2n) và vỏ hạt.",
    "b": "Hợp tử (2n) phát triển thành phôi và tế bào tam bội (3n) phát triển thành nội nhũ.",
    "c": "Hai hợp tử (2n) giống hệt nhau.",
    "d": "Hạt và quả.",
    "correct": "Hợp tử (2n) phát triển thành phôi và tế bào tam bội (3n) phát triển thành nội nhũ.",
    "explain": "Thụ tinh kép đảm bảo cây chỉ đầu tư năng lượng tạo nội nhũ (dinh dưỡng) khi trứng đã được thụ tinh thành công."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao các động vật ở vùng cực (như gấu trắng, cá voi) thường có lớp mỡ dưới da rất dày?",
    "a": "Để dự trữ thức ăn cho mùa đông.",
    "b": "Vừa là nguồn dự trữ năng lượng, vừa là lớp cách nhiệt hiệu quả chống lại sự mất nhiệt vào môi trường nước/không khí lạnh giá.",
    "c": "Để giúp chúng nổi tốt hơn trên mặt nước.",
    "d": "Để làm tăng kích thước cơ thể dọa kẻ thù.",
    "correct": "Vừa là nguồn dự trữ năng lượng, vừa là lớp cách nhiệt hiệu quả chống lại sự mất nhiệt vào môi trường nước/không khí lạnh giá.",
    "explain": "Lipid dẫn nhiệt rất kém, đóng vai trò như một lớp áo khoác sinh học bảo vệ thân nhiệt cho động vật hằng nhiệt vùng lạnh."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong cơ thể người, tại sao các mạch máu ở chân lại có các van một chiều trong khi mạch máu ở đầu thì không?",
    "a": "Để máu chảy nhanh hơn về phía đầu.",
    "b": "Để ngăn máu chảy ngược xuống dưới do tác dụng của trọng lực khi máu từ chân trở về tim.",
    "c": "Vì mạch máu ở chân chịu áp lực lớn từ tim hơn.",
    "d": "Để lọc các chất thải ở chân.",
    "correct": "Để ngăn máu chảy ngược xuống dưới do tác dụng của trọng lực khi máu từ chân trở về tim.",
    "explain": "Hệ tĩnh mạch chi dưới phải vận chuyển máu ngược chiều trọng lực. Sự suy yếu của các van này dẫn đến bệnh suy giãn tĩnh mạch."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Vi khuẩn kháng thuốc (như MRSA) có khả năng truyền gen kháng kháng sinh cho các vi khuẩn khác loài thông qua cơ chế nào?",
    "a": "Sinh sản hữu tính.",
    "b": "Sự tiếp hợp (conjugation) truyền các đoạn ADN vòng (plasmid).",
    "c": "Sự phân đôi thông thường.",
    "d": "Sự biến thái hoàn toàn.",
    "correct": "Sự tiếp hợp (conjugation) truyền các đoạn ADN vòng (plasmid).",
    "explain": "Đây là hình thức truyền tin di truyền theo chiều ngang, giúp các đặc tính thích nghi (như kháng thuốc) lan truyền cực nhanh trong quần thể vi sinh vật."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong một quần thể thực vật, nếu một gen đột biến làm mất khả năng hình thành lớp cutin trên bề mặt lá, cây đó sẽ gặp khó khăn gì lớn nhất?",
    "a": "Không thể thực hiện quang hợp.",
    "b": "Mất kiểm soát thoát hơi nước và dễ bị héo chết ngay cả khi đất vẫn ẩm.",
    "c": "Không thể hấp thụ khí CO2.",
    "d": "Rễ cây không thể mọc dài ra.",
    "correct": "Mất kiểm soát thoát hơi nước và dễ bị héo chết ngay cả khi đất vẫn ẩm.",
    "explain": "Lớp cutin là rào cản ngăn nước bay hơi tự do qua bề mặt tế bào biểu bì, buộc nước phải thoát có kiểm soát qua khí khổng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Nhóm sinh vật nào sau đây đóng vai trò 'sinh vật tiên phong' trong quá trình diễn thế sinh thái trên một hòn đảo mới hình thành từ núi lửa?",
    "a": "Cây gỗ lớn.",
    "b": "Địa y và rêu.",
    "c": "Cỏ dại.",
    "d": "Các loài chim biển.",
    "correct": "Địa y và rêu.",
    "explain": "Các sinh vật này có khả năng sống trên đá trọc, tiết axit phân giải đá thành đất, tạo tiền đề cho các loài thực vật bậc cao đến sau."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Hormone thực vật nào chịu trách nhiệm chính trong việc kích thích nảy mầm của hạt và phá vỡ trạng thái ngủ nghỉ của củ?",
    "a": "Auxin.",
    "b": "Gibberellin (GA).",
    "c": "Ethylene.",
    "d": "Axit Abscisic (ABA).",
    "correct": "Gibberellin (GA).",
    "explain": "Gibberellin kích thích enzyme phân giải tinh bột thành đường cung cấp cho phôi mầm. Axit Abscisic có tác dụng ngược lại là gây ngủ nghỉ."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao nồng độ Oxy trong phế nang phổi người luôn thấp hơn nồng độ Oxy trong không khí hít vào?",
    "a": "Vì phổi hấp thụ Oxy quá nhanh.",
    "b": "Vì không khí mới hít vào bị trộn lẫn với 'khoảng chết' chứa không khí cũ giàu CO2 còn dư lại trong đường dẫn khí.",
    "c": "Vì Oxy biến thành nước ngay trong phổi.",
    "d": "Do cơ chế chọn lọc của niêm mạc mũi.",
    "correct": "Vì không khí mới hít vào bị trộn lẫn với 'khoảng chết' chứa không khí cũ giàu CO2 còn dư lại trong đường dẫn khí.",
    "explain": "Phổi của động vật có vú là túi cụt, sự trao đổi khí không triệt để bằng hệ thống hô hấp của chim (dòng chảy một chiều)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Đặc điểm nào chứng minh thực vật Hạt kín có mức độ tiến hóa cao nhất trong giới Thực vật?",
    "a": "Có hệ mạch dẫn hoàn thiện và thụ tinh kép, hạt được quả bao bọc bảo vệ.",
    "b": "Có kích thước khổng lồ.",
    "c": "Sống được ở dưới nước.",
    "d": "Có khả năng di chuyển chậm.",
    "correct": "Có hệ mạch dẫn hoàn thiện và thụ tinh kép, hạt được quả bao bọc bảo vệ.",
    "explain": "Sự kết hợp giữa bảo vệ nòi giống tối ưu và vận chuyển dinh dưỡng hiệu quả giúp chúng thống trị mọi sinh cảnh trên cạn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Điều gì xảy ra với năng lượng trong hệ sinh thái sau khi đi qua bậc dinh dưỡng cuối cùng?",
    "a": "Năng lượng biến mất hoàn toàn vào hư không.",
    "b": "Năng lượng tỏa ra môi trường dưới dạng nhiệt thông qua hô hấp và phân giải.",
    "c": "Năng lượng quay trở lại Mặt Trời.",
    "d": "Năng lượng ngưng tụ thành vật chất vô cơ.",
    "correct": "Năng lượng tỏa ra môi trường dưới dạng nhiệt thông qua hô hấp và phân giải.",
    "explain": "Theo định luật bảo toàn năng lượng, năng lượng không mất đi mà chuyển sang dạng nhiệt năng có giá trị thấp không thể tái sử dụng để làm công sinh học."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao ti thể và lục lạp lại có thể tổng hợp được một số protein riêng cho mình mà không cần sự hỗ trợ của nhân tế bào?",
    "a": "Vì chúng có kích thước lớn.",
    "b": "Vì chúng sở hữu ADN vòng và hệ thống Ribosome riêng giống như vi khuẩn.",
    "c": "Vì chúng lấy protein từ môi trường bên ngoài.",
    "d": "Vì chúng có khả năng biến CO2 thành protein.",
    "correct": "Vì chúng sở hữu ADN vòng và hệ thống Ribosome riêng giống như vi khuẩn.",
    "explain": "Đây là bằng chứng mạnh mẽ nhất ủng hộ Thuyết Nội cộng sinh, cho thấy tổ tiên của chúng là các tế bào nhân sơ sống tự do."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Khi nồng độ Glucose trong máu người giảm xuống (đói), cơ thể sẽ ưu tiên sử dụng nguồn dự trữ nào để duy trì sự sống?",
    "a": "Protein của cơ bắp.",
    "b": "Glycogen dự trữ ở gan và cơ.",
    "c": "Lớp mỡ dưới da.",
    "d": "Xương.",
    "correct": "Glycogen dự trữ ở gan và cơ.",
    "explain": "Glycogen là dạng polymer dự trữ của glucozo dễ dàng được thủy phân để cung cấp năng lượng nhanh chóng cho máu."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Đặc điểm nào sau đây phân biệt cơ bản nhất giữa Động vật có xương sống và Động vật không xương sống?",
    "a": "Khả năng di chuyển.",
    "b": "Sự có mặt của dây sống hoặc cột sống chứa tủy sống và bộ xương trong.",
    "c": "Kích thước cơ thể.",
    "d": "Hình thức sinh sản.",
    "correct": "Sự có mặt của dây sống hoặc cột sống chứa tủy sống và bộ xương trong.",
    "explain": "Cột sống không chỉ bảo vệ trung tâm thần kinh mà còn tạo khung nâng đỡ cho cơ thể phát triển kích thước lớn và vận động phức tạp."
  },
  
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao các enzyme (chất xúc tác sinh học) lại có tính đặc hiệu rất cao, mỗi loại enzyme thường chỉ xúc tác cho một phản ứng nhất định?",
    "a": "Vì enzyme có kích thước rất lớn so với cơ chất.",
    "b": "Do cấu trúc không gian của 'trung tâm hoạt động' ở enzyme tương thích khớp hoàn toàn với cấu trúc của cơ chất (mô hình chìa khóa - ổ khóa).",
    "c": "Vì enzyme chỉ hoạt động ở nhiệt độ cơ thể người.",
    "d": "Do enzyme được cấu tạo từ các phân tử lipid đặc biệt.",
    "correct": "Do cấu trúc không gian của 'trung tâm hoạt động' ở enzyme tương thích khớp hoàn toàn với cấu trúc của cơ chất (mô hình chìa khóa - ổ khóa).",
    "explain": "Tính đặc hiệu của enzyme quyết định bởi sự khớp nối chính xác giữa trung tâm hoạt động và cơ chất, giúp nhận diện và biến đổi đúng chất cần thiết trong hàng ngàn phản ứng của tế bào."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Hiện tượng 'kháng thuốc kháng sinh' ở vi khuẩn minh chứng rõ nhất cho quy luật nào của sinh học hiện đại?",
    "a": "Quy luật di truyền của Mendel.",
    "b": "Sự biến đổi của môi trường làm phát sinh đột biến mới ở vi khuẩn.",
    "c": "Chọn lọc tự nhiên: Môi trường có kháng sinh đã loại bỏ các cá thể yếu và giữ lại những cá thể có đột biến kháng thuốc có sẵn.",
    "d": "Vi khuẩn tự rèn luyện cơ thể để chống lại thuốc.",
    "correct": "Chọn lọc tự nhiên: Môi trường có kháng sinh đã loại bỏ các cá thể yếu và giữ lại những cá thể có đột biến kháng thuốc có sẵn.",
    "explain": "Thuốc kháng sinh đóng vai trò là nhân tố chọn lọc. Đột biến kháng thuốc có thể xuất hiện ngẫu nhiên, khi có thuốc, những vi khuẩn này sống sót, nhân bản và truyền gen kháng thuốc cho thế hệ sau."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Sự khác biệt căn bản giữa 'Vận động hướng động' (như cây hướng sáng) và 'Vận động ứng động' (như lá cây trinh nữ khép lại) là gì?",
    "a": "Hướng động diễn ra nhanh hơn ứng động.",
    "b": "Hướng động phụ thuộc vào hướng của tác nhân kích thích, còn ứng động không phụ thuộc vào hướng kích thích.",
    "c": "Hướng động chỉ có ở rễ, ứng động chỉ có ở lá.",
    "d": "Ứng động tiêu tốn nhiều ATP hơn hướng động.",
    "correct": "Hướng động phụ thuộc vào hướng của tác nhân kích thích, còn ứng động không phụ thuộc vào hướng kích thích.",
    "explain": "Hướng động là phản ứng của cơ quan thực vật hướng tới hoặc tránh xa kích thích có hướng (ánh sáng, trọng lực). Ứng động là phản ứng trước các kích thích không định hướng (nhiệt độ, va chạm)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Trong cơ thể người, nồng độ Glucose trong máu luôn được giữ ổn định ở mức khoảng 0,1%. Cơ chế nào đóng vai trò chủ đạo trong việc này?",
    "a": "Hệ tuần hoàn bơm máu nhanh hơn khi đói.",
    "b": "Cơ chế điều hòa ngược (Negative Feedback) với sự phối hợp của các hormone Insulin và Glucagon từ tuyến tụy.",
    "c": "Do dạ dày luôn dự trữ một lượng thức ăn cố định.",
    "d": "Do thận hấp thụ lại toàn bộ đường không cho thoát ra ngoài.",
    "correct": "Cơ chế điều hòa ngược (Negative Feedback) với sự phối hợp của các hormone Insulin và Glucagon từ tuyến tụy.",
    "explain": "Khi đường huyết tăng, Insulin giúp chuyển glucose vào tế bào và dự trữ ở gan. Khi đường huyết giảm, Glucagon giúp phân giải glycogen dự trữ ở gan thành glucose đưa vào máu."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Cánh của chim và cánh của các loài côn trùng (như bướm) được gọi là các cơ quan gì trong tiến hóa?",
    "a": "Cơ quan tương đồng (Homologous).",
    "b": "Cơ quan tương tự (Analogous).",
    "c": "Cơ quan thoái hóa.",
    "d": "Cơ quan cùng nguồn gốc.",
    "correct": "Cơ quan tương tự (Analogous).",
    "explain": "Đây là những cơ quan có nguồn gốc khác nhau nhưng có cùng chức năng (bay) và hình thái tương tự nhau do thích nghi với cùng một môi trường sống (hiện tượng tiến hóa đồng quy)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Hiện tượng 'khuyếch đại sinh học' (Biological Magnification) có nghĩa là gì trong chuỗi thức ăn bị ô nhiễm?",
    "a": "Kích thước các sinh vật ngày càng to hơn khi lên bậc dinh dưỡng cao hơn.",
    "b": "Nồng độ các chất độc hại không phân hủy (như thuốc trừ sâu, kim loại nặng) tích tụ tăng dần qua mỗi bậc dinh dưỡng của chuỗi thức ăn.",
    "c": "Số lượng cá thể tăng lên ở cuối chuỗi thức ăn.",
    "d": "Các loài sinh vật biến đổi gen để ăn chất độc.",
    "correct": "Nồng độ các chất độc hại không phân hủy (như thuốc trừ sâu, kim loại nặng) tích tụ tăng dần qua mỗi bậc dinh dưỡng của chuỗi thức ăn.",
    "explain": "Vì sinh vật bậc cao phải ăn một lượng lớn sinh vật bậc thấp để duy trì năng lượng, nên lượng chất độc không đào thải được từ bậc thấp sẽ tập trung nồng độ cực cao ở sinh vật đầu chuỗi (ví dụ: con người)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Nhóm vi khuẩn Extremophiles có khả năng sống ở những môi trường cực đoan (suối nước nóng 100 độ C, hồ muối mặn chát). Đặc điểm nào giúp chúng tồn tại được?",
    "a": "Chúng có vỏ bọc bằng kim loại.",
    "b": "Enzyme và màng tế bào của chúng có cấu trúc rất bền vững, không bị biến tính bởi nhiệt độ hay áp suất cực cao.",
    "c": "Chúng không có màng sinh chất.",
    "d": "Chúng luôn ở trạng thái ngủ nghỉ đóng bào tử.",
    "correct": "Enzyme và màng tế bào của chúng có cấu trúc rất bền vững, không bị biến tính bởi nhiệt độ hay áp suất cực cao.",
    "explain": "Sự tiến hóa trong cấu trúc protein và thành phần lipid màng giúp nhóm vi khuẩn này duy trì hoạt động chuyển hóa trong những điều kiện mà protein của sinh vật thường sẽ bị phá hủy ngay lập tức."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Sự khác biệt về cấu tạo hạt giữa cây Một lá mầm (Lúa, Ngô) và cây Hai lá mầm (Đỗ, Xoài) liên quan đến vị trí dự trữ chất dinh dưỡng là gì?",
    "a": "Cây Một lá mầm dự trữ ở lá mầm, cây Hai lá mầm dự trữ ở nội nhũ.",
    "b": "Cây Một lá mầm dự trữ ở nội nhũ, cây Hai lá mầm thường dự trữ ở hai lá mầm rất dày.",
    "c": "Cả hai đều dự trữ chất dinh dưỡng ở vỏ hạt.",
    "d": "Cây Một lá mầm không có chất dự trữ.",
    "correct": "Cây Một lá mầm dự trữ ở nội nhũ, cây Hai lá mầm thường dự trữ ở hai lá mầm rất dày.",
    "explain": "Ở hạt đỗ, nội nhũ bị hấp thụ hết vào hai lá mầm trong quá trình phát triển hạt. Ở hạt ngô, lá mầm nhỏ đóng vai trò chuyển tiếp dinh dưỡng từ nội nhũ lớn sang phôi."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Tại sao quá trình giảm phân (Meiosis) lại tạo ra các tế bào con có bộ nhiễm sắc thể giảm đi một nửa và khác nhau về mặt di truyền?",
    "a": "Do các tế bào con bị thiếu năng lượng nên không thể nhân đôi ADN.",
    "b": "Do có sự phân ly độc lập của các cặp nhiễm sắc thể tương đồng và hiện tượng trao đổi chéo giữa các nhiễm sắc thể ở kì đầu I.",
    "c": "Do tế bào mẹ bị phân hủy trong quá trình chia tách.",
    "d": "Vì đó là sai sót ngẫu nhiên của tế bào.",
    "correct": "Do có sự phân ly độc lập của các cặp nhiễm sắc thể tương đồng và hiện tượng trao đổi chéo giữa các nhiễm sắc thể ở kì đầu I.",
    "explain": "Giảm phân tạo ra sự đa dạng di truyền vô tận cho các giao tử (trứng, tinh trùng), là cơ sở cho biến dị tổ hợp giúp sinh vật thích nghi và tiến hóa."
  },
  {
    "subject": "Sinh học",
    "difficulty": "extreme",
    "content": "Sự gia tăng nồng độ khí CO2 trong khí quyển gây ra hiện tượng 'Axit hóa đại dương'. Hệ quả sinh học nghiêm trọng nhất của việc này là gì?",
    "a": "Làm nước biển nóng lên làm cá bị luộc chín.",
    "b": "Làm giảm nồng độ ion Carbonate (CO3 2-) trong nước, khiến các sinh vật có vỏ vôi (san hô, tôm, ốc) khó hình thành khung xương và vỏ, đe dọa toàn bộ hệ sinh thái biển.",
    "c": "Làm nước biển có vị chua khiến cá không uống được.",
    "d": "Làm tăng lượng muối trong biển.",
    "correct": "Làm giảm nồng độ ion Carbonate (CO3 2-) trong nước, khiến các sinh vật có vỏ vôi (san hô, tôm, ốc) khó hình thành khung xương và vỏ, đe dọa toàn bộ hệ sinh thái biển.",
    "explain": "Khi CO2 hòa tan nhiều vào nước biển sẽ tạo ra axit carbonic (H2CO3), axit này làm giảm pH và phản ứng với các ion carbonate tự do, ngăn cản quá trình vôi hóa của sinh vật biển."
  }
]