[
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong giả thuyết nội cộng sinh, đặc điểm cấu trúc nào của ti thể là bằng chứng thuyết phục nhất về nguồn gốc vi khuẩn của nó?",
    "a": "Có khả năng tổng hợp toàn bộ các loại protein.",
    "b": "Sở hữu ADN vòng trần và hệ ribosome 70S riêng.",
    "c": "Có hệ thống màng kép và kích thước tương tự nhân.",
    "d": "Phân chia phụ thuộc hoàn toàn vào nhân tế bào chủ.",
    "correct": "b",
    "explain": "ADN vòng trần và ribosome 70S là đặc điểm di truyền đặc trưng của vi khuẩn (tế bào nhân sơ), khác biệt với ADN thẳng và ribosome 80S của tế bào nhân thực."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Tại sao tế bào nhân thực có kích thước lớn hơn nhưng tốc độ trao đổi chất trên một đơn vị khối lượng lại thấp hơn tế bào nhân sơ?",
    "a": "Do màng sinh chất dày hơn làm cản trở vận chuyển.",
    "b": "Do hệ thống các bào quan chiếm quá nhiều thể tích.",
    "c": "Do tỉ lệ diện tích bề mặt trên thể tích (S/V) nhỏ.",
    "d": "Do nhân tế bào tiêu tốn quá nhiều năng lượng ATP.",
    "correct": "c",
    "explain": "Khi kích thước tế bào tăng, thể tích (nhu cầu chất) tăng nhanh hơn diện tích bề mặt (khả năng trao đổi), làm giảm hiệu suất trao đổi chất tổng thể."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong cấu trúc màng sinh chất động vật, cholesterol đóng vai trò gì trong việc duy trì tính ổn định trước biến động nhiệt độ?",
    "a": "Giúp màng lỏng hơn khi nhiệt độ môi trường tăng cao.",
    "b": "Làm màng cứng chắc hơn khi nhiệt độ môi trường giảm.",
    "c": "Ngăn cản sự vận chuyển thụ động của các ion qua màng.",
    "d": "Duy trì độ linh động ổn định khi nhiệt độ thay đổi.",
    "correct": "d",
    "explain": "Cholesterol hoạt động như một 'đệm nhiệt độ': ngăn màng quá lỏng khi nóng (bằng cách cản trở chuyển động) và ngăn đông đặc khi lạnh (bằng cách ngăn đóng gói chặt)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Khi tế bào thực vật bị mất nước trong môi trường ưu trương, áp suất trương nước (turgor pressure) sẽ biến đổi như thế nào?",
    "a": "Giảm dần về không gây ra hiện tượng co nguyên sinh.",
    "b": "Tăng lên nhanh chóng do nước thẩm thấu vào không bào.",
    "c": "Giữ nguyên không đổi nhờ thành tế bào cellulose cứng.",
    "d": "Biến động liên tục không theo một quy luật nhất định.",
    "correct": "a",
    "explain": "Nước thoát ra ngoài làm thể tích nguyên sinh chất giảm, màng sinh chất tách khỏi thành tế bào, khiến áp suất trương nước giảm mạnh."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Tính đặc hiệu tuyệt đối của một enzyme đối với cơ chất của nó được quyết định chủ yếu bởi yếu tố cấu trúc phân tử nào?",
    "a": "Trình tự các axit amin nằm ở vùng ngoại vi enzyme.",
    "b": "Cấu hình không gian tương thích tại trung tâm hoạt động.",
    "c": "Số lượng các liên kết hydro trong cấu trúc bậc hai.",
    "d": "Độ bền vững của các cầu nối disulfide trong phân tử.",
    "correct": "b",
    "explain": "Mô hình 'khớp cảm ứng' hoặc 'chìa khóa - ổ khóa' giải thích rằng chỉ cơ chất có hình dạng khớp với trung tâm hoạt động mới có thể liên kết và phản ứng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong quá trình hóa thẩm thấu tại ti thể, năng lượng từ dòng proton (H+) được sử dụng trực tiếp cho hoạt động sinh hóa nào?",
    "a": "Vận chuyển điện tử đến chất nhận cuối cùng là oxy.",
    "b": "Bơm các ion H+ từ chất nền vào xoang gian màng ti.",
    "c": "Kích hoạt enzyme ATP synthase tổng hợp phân tử ATP.",
    "d": "Phân giải axit pyruvic thành CO2 và các gốc axetyl.",
    "correct": "c",
    "explain": "Dòng proton chảy xuôi chiều gradient nồng độ qua kênh ATP synthase tạo động lực quay tuabin enzyme để gắn nhóm phosphate vào ADP."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Chức năng sinh lý quan trọng nhất của không bào co bóp ở các loài động vật nguyên sinh sống trong môi trường nước ngọt là gì?",
    "a": "Bơm nước thừa ra ngoài để cân bằng áp suất thẩm thấu.",
    "b": "Tiêu hóa các loại thức ăn rắn kích thước lớn thu được.",
    "c": "Dự trữ các chất dinh dưỡng cần thiết cho sự sinh sản.",
    "d": "Giúp cơ thể di chuyển linh hoạt trong môi trường nước.",
    "correct": "a",
    "explain": "Nước ngọt là môi trường nhược trương, nước liên tục thẩm thấu vào tế bào. Không bào co bóp phải bơm nước ra liên tục để tránh vỡ tế bào."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Protein Leghemoglobin trong nốt sần rễ cây họ Đậu hỗ trợ vi khuẩn cố định đạm thông qua cơ chế hóa sinh đặc biệt nào?",
    "a": "Xúc tác trực tiếp cho phản ứng bẻ gãy liên kết nitơ.",
    "b": "Cung cấp năng lượng ATP cho vi khuẩn hoạt động mạnh mẽ.",
    "c": "Vận chuyển đường từ lá xuống nuôi dưỡng quần thể khuẩn.",
    "d": "Liên kết chặt với oxy để tạo môi trường yếm khí cục bộ.",
    "correct": "d",
    "explain": "Enzyme nitrogenase rất nhạy cảm và bị bất hoạt bởi oxy. Leghemoglobin giúp 'nhốt' oxy lại, đảm bảo môi trường yếm khí cho quá trình cố định đạm."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Ưu điểm lớn nhất của hệ tuần hoàn kín so với hệ tuần hoàn hở ở các động vật hoạt động tích cực có kích thước lớn là gì?",
    "a": "Máu không tiếp xúc trực tiếp với các tế bào cơ thể.",
    "b": "Duy trì áp lực máu cao giúp vận chuyển chất nhanh hơn.",
    "c": "Thể tích máu lưu thông trong cơ thể luôn được bảo toàn.",
    "d": "Thành mạch máu có khả năng trao đổi khí rất hiệu quả.",
    "correct": "b",
    "explain": "Áp lực cao trong hệ kín giúp máu đi xa và nhanh đến các mô, đáp ứng nhu cầu oxy và dinh dưỡng cao của động vật lớn, hoạt động nhiều."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Cơ chế trao đổi khí ngược dòng tại mang cá xương giúp tối ưu hóa hiệu suất hấp thụ oxy nhờ nguyên lý vật lý nào?",
    "a": "Tăng diện tích bề mặt tiếp xúc giữa các phiến mang cá.",
    "b": "Giảm khoảng cách khuếch tán khí qua màng tế bào mang.",
    "c": "Duy trì chênh lệch nồng độ oxy liên tục dọc mạch máu.",
    "d": "Tăng tốc độ dòng nước chảy qua mang nhờ nắp mang đóng.",
    "correct": "c",
    "explain": "Dòng nước và máu chảy ngược chiều đảm bảo nước luôn có nồng độ oxy cao hơn máu tại mọi điểm tiếp xúc, giúp khuếch tán xảy ra liên tục."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Điểm kiểm soát G2/M trong chu kỳ tế bào đóng vai trò then chốt trong việc ngăn chặn các lỗi di truyền bằng cách nào?",
    "a": "Kiểm tra xem ADN đã nhân đôi hoàn tất và không bị lỗi.",
    "b": "Đảm bảo tế bào đã đạt kích thước tối đa để phân chia.",
    "c": "Xác nhận các thoi vô sắc đã gắn vào tâm động nhiễm sắc.",
    "d": "Kiểm soát nồng độ các chất dinh dưỡng trong tế bào chất.",
    "correct": "a",
    "explain": "Nếu ADN chưa nhân đôi xong hoặc bị hư hỏng, điểm G2/M sẽ chặn tế bào bước vào nguyên phân để tránh tạo ra các tế bào con bị lỗi gen."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Đặc điểm hóa sinh nào khiến Nấm được xếp vào nhóm có quan hệ họ hàng gần gũi với Động vật hơn là với Thực vật?",
    "a": "Sống dị dưỡng và có khả năng di chuyển ở dạng bào tử.",
    "b": "Cấu tạo đa bào và có hệ thống sợi nấm phát triển mạnh.",
    "c": "Sinh sản bằng bào tử và thích nghi với nơi có độ ẩm.",
    "d": "Thành tế bào chứa kitin và dự trữ năng lượng glycogen.",
    "correct": "d",
    "explain": "Kitin (có ở vỏ tôm cua) và Glycogen (đường dự trữ ở gan động vật) là những đặc điểm đặc trưng của động vật, không tìm thấy ở thực vật."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Tại sao trong quá trình nhân đôi ADN, mạch ra chậm (lagging strand) lại phải được tổng hợp một cách gián đoạn?",
    "a": "Do mạch khuôn mẫu có cấu trúc xoắn kép quá chặt chẽ.",
    "b": "Do enzyme polymerase chỉ tổng hợp theo chiều 5' đến 3'.",
    "c": "Do thiếu hụt các nucleotide tự do trong môi trường nhân.",
    "d": "Do enzyme tháo xoắn hoạt động không đồng bộ ở hai mạch.",
    "correct": "b",
    "explain": "Vì hai mạch ADN đối song song mà enzyme chỉ chạy một chiều (5'-3'), nên trên mạch khuôn 5'-3', enzyme phải tổng hợp từng đoạn ngắn ngược chiều tháo xoắn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong điều hòa chuyển hóa, cơ chế ức chế ngược (feedback inhibition) mang lại lợi ích kinh tế nào cho tế bào?",
    "a": "Ngăn chặn sự lãng phí nguyên liệu khi sản phẩm dư thừa.",
    "b": "Tăng tốc độ phản ứng để tạo ra nhiều sản phẩm hơn nữa.",
    "c": "Loại bỏ các enzyme đã bị già cỗi hoặc mất chức năng xúc.",
    "d": "Chuyển hóa sản phẩm thừa thành năng lượng dự trữ dài hạn.",
    "correct": "a",
    "explain": "Khi sản phẩm cuối cùng tích tụ đủ, nó quay lại ức chế enzyme đầu chuỗi, giúp tế bào ngừng sản xuất, tiết kiệm năng lượng và vật chất."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Hệ thống túi khí ở chim hỗ trợ quá trình hô hấp kép hiệu quả như thế nào trong hoạt động bay lượn tốn năng lượng?",
    "a": "Làm giảm trọng lượng riêng giúp chim bay nhẹ nhàng hơn.",
    "b": "Giúp tản nhiệt nhanh chóng từ cơ bắp ra ngoài môi trường.",
    "c": "Đảm bảo dòng khí qua phổi luôn giàu oxy và đi một chiều.",
    "d": "Dự trữ một lượng lớn khí oxy dùng khi bay lên độ cao.",
    "correct": "c",
    "explain": "Túi khí hoạt động như cái bơm, đẩy không khí giàu oxy qua phổi liên tục cả khi hít vào lẫn thở ra, tối ưu hóa hấp thụ oxy."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Nguyên nhân chính dẫn đến hiện tượng cá chết hàng loạt vào ban đêm tại các hồ nước bị phú dưỡng (ô nhiễm hữu cơ) là gì?",
    "a": "Nồng độ độc tố do tảo tiết ra tăng cao trong bóng tối.",
    "b": "Sự thay đổi nhiệt độ nước đột ngột giữa ngày và đêm lạnh.",
    "c": "Sự cạnh tranh thức ăn gay gắt giữa các loài cá trong hồ.",
    "d": "Sự suy giảm oxy hòa tan do hô hấp của tảo và vi sinh vật.",
    "correct": "d",
    "explain": "Ban đêm tảo ngừng quang hợp mà chỉ hô hấp (hút oxy), cộng với vi khuẩn phân giải xác hữu cơ tiêu thụ oxy mạnh, gây tình trạng thiếu oxy cục bộ."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Sự hình thành hạt ở thực vật Hạt kín mang lại ưu thế sinh tồn nào vượt trội so với cây sinh sản bằng bào tử?",
    "a": "Hạt có khả năng phát tán nhờ gió đi xa hơn các bào tử.",
    "b": "Phôi trong hạt được cung cấp dinh dưỡng và bảo vệ tốt hơn.",
    "c": "Hạt có thể nảy mầm ngay lập tức mà không cần nước và ấm.",
    "d": "Số lượng hạt tạo ra luôn nhiều hơn số lượng các bào tử.",
    "correct": "b",
    "explain": "Hạt chứa phôi đã phát triển một phần, kèm theo nội nhũ (thức ăn dự trữ) và vỏ cứng, giúp cây con có tỉ lệ sống sót cao hơn nhiều so với bào tử."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Rễ thở (pneumatophores) ở các loài cây rừng ngập mặn là sự thích nghi đặc biệt nhằm giải quyết vấn đề môi trường nào?",
    "a": "Thiếu hụt khí oxy trong lớp bùn ngập nước quanh năm.",
    "b": "Nồng độ muối quá cao trong nước biển gây mất nước rễ.",
    "c": "Sự tấn công của các loài động vật ăn rễ sống dưới nước.",
    "d": "Sự thiếu hụt ánh sáng mặt trời do tán lá dày che khuất.",
    "correct": "a",
    "explain": "Đất ngập nước thường yếm khí (thiếu oxy). Rễ thở mọc ngược lên mặt nước để lấy oxy trực tiếp từ không khí cung cấp cho hệ rễ dưới bùn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Vì sao bệnh máu khó đông (gen lặn trên X) lại phổ biến ở nam giới hơn rất nhiều so với ở nữ giới?",
    "a": "Nam giới có hormone testosterone kích thích gen gây bệnh.",
    "b": "Nữ giới có sức đề kháng miễn dịch tốt hơn đối với bệnh.",
    "c": "Nam giới chỉ cần một alen lặn trên X là biểu hiện bệnh.",
    "d": "Nhiễm sắc thể Y chứa các gen làm tăng mức độ nghiêm trọng.",
    "correct": "c",
    "explain": "Nam giới là XY (dị giao tử), chỉ cần 1 alen lặn trên X là biểu hiện. Nữ giới là XX, cần cả 2 alen lặn mới biểu hiện bệnh."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Bao Myelin bao quanh sợi trục thần kinh giúp tăng tốc độ truyền xung điện nhờ cơ chế vật lý nào?",
    "a": "Tăng đường kính sợi trục để giảm điện trở của tế bào chất.",
    "b": "Cung cấp thêm năng lượng ATP cho các bơm ion hoạt động mạnh.",
    "c": "Ngăn cản sự rò rỉ ion qua màng tại các vị trí được bao bọc.",
    "d": "Kích thích tạo ra nhiều chất dẫn truyền thần kinh ở xináp.",
    "correct": "c",
    "explain": "Myelin cách điện, ngăn dòng ion đi qua màng, buộc xung điện phải 'nhảy' qua các eo Ranvier (dẫn truyền nhảy cóc), làm tăng tốc độ truyền."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Enzyme Telomerase giúp các tế bào gốc và tế bào ung thư duy trì khả năng phân chia vô hạn bằng cách nào?",
    "a": "Ngăn chặn các sai sót xảy ra trong quá trình nhân đôi ADN.",
    "b": "Tái tạo lại các đoạn ADN đầu mút bị mất sau mỗi lần phân bào.",
    "c": "Kích thích tế bào vượt qua các điểm kiểm soát của chu kỳ.",
    "d": "Ức chế hoạt động của các gen gây chết tế bào theo chương trình.",
    "correct": "b",
    "explain": "Sau mỗi lần phân chia, đầu mút NST (telomere) bị ngắn lại. Telomerase giúp kéo dài lại đoạn này, ngăn tế bào bị lão hóa và chết."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Đặc điểm nào của enzyme phiên mã ngược khiến virus HIV có khả năng biến đổi và kháng thuốc cực kỳ nhanh chóng?",
    "a": "Thiếu cơ chế sửa sai dẫn đến tỉ lệ đột biến gen rất cao.",
    "b": "Hoạt động nhanh hơn nhiều so với các enzyme của tế bào chủ.",
    "c": "Có khả năng tổng hợp ADN từ bất kỳ khuôn mẫu ARN ngẫu nhiên.",
    "d": "Bền vững trước các tác nhân hóa học và nhiệt độ môi trường.",
    "correct": "a",
    "explain": "Reverse Transcriptase của HIV không có khả năng sửa lỗi (proofreading), do đó nó tạo ra vô số biến thể di truyền sau mỗi lần nhân lên."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Lực liên kết hydro giữa các phân tử nước (tính cộng hưởng) đóng vai trò gì trong dòng mạch gỗ của cây cao?",
    "a": "Giúp nước bám chặt vào thành mạch gỗ để chống lại trọng lực.",
    "b": "Tạo áp suất rễ mạnh đẩy nước từ dưới đất lên thân cây cao.",
    "c": "Duy trì cột nước liên tục không bị đứt gãy dưới lực kéo lớn.",
    "d": "Làm giảm nhiệt độ của nước giúp cây không bị nóng quá mức.",
    "correct": "c",
    "explain": "Lực liên kết hydro giúp các phân tử nước 'nắm tay nhau' tạo thành một dây nước liền mạch, cho phép lá kéo nước từ rễ lên mà không bị đứt."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong truyền tin tế bào qua thụ thể G-protein, phân tử cAMP đóng vai trò là chất truyền tin thứ hai với nhiệm vụ gì?",
    "a": "Khuếch đại tín hiệu và kích hoạt chuỗi phản ứng enzyme trong.",
    "b": "Trực tiếp đi vào nhân để tác động lên quá trình phiên mã gen.",
    "c": "Vận chuyển tín hiệu từ thụ thể màng vào lysosome để phân hủy.",
    "d": "Mở các kênh ion trên màng tế bào để thay đổi điện thế màng.",
    "correct": "a",
    "explain": "cAMP được tạo ra số lượng lớn, lan tỏa nhanh trong tế bào chất, kích hoạt các kinase (như PKA) để tạo ra đáp ứng sinh lý mạnh mẽ."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Hormone ADH điều hòa cân bằng nước của cơ thể thông qua việc tác động lên cấu trúc nào của đơn vị thận?",
    "a": "Làm giãn các tiểu động mạch đến cầu thận để tăng tốc độ lọc.",
    "b": "Tăng tính thấm đối với nước ở ống lượn xa và ống góp của thận.",
    "c": "Kích thích bơm Na+ hoạt động mạnh ở nhánh lên của quai Henle.",
    "d": "Ức chế cảm giác khát nước ở vùng dưới đồi của não bộ trung ương.",
    "correct": "b",
    "explain": "ADH chèn các kênh nước (aquaporin) vào màng tế bào ống góp, giúp nước được tái hấp thụ từ nước tiểu về máu, làm cô đặc nước tiểu."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Cơ chế 'nhân nồng độ ngược dòng' tại quai Henle có ý nghĩa sinh tồn quan trọng nào đối với động vật trên cạn?",
    "a": "Tạo môi trường ưu trương ở tủy thận để tái hấp thụ nước tối đa.",
    "b": "Loại bỏ nhanh chóng các chất độc hại ra khỏi cơ thể qua bài tiết.",
    "c": "Giữ cho nồng độ pH của máu luôn ổn định ở mức sinh lý bình thường.",
    "d": "Tăng cường khả năng lọc máu của thận để loại bỏ urê dư thừa.",
    "correct": "a",
    "explain": "Cơ chế này tạo ra gradient nồng độ muối cao trong tủy thận, là động lực để rút nước từ ống góp trở lại cơ thể, giúp tiết kiệm nước."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Con đường lan truyền gen kháng kháng sinh phổ biến và nhanh nhất giữa các loài vi khuẩn khác nhau là gì?",
    "a": "Sự phân chia tế bào trực phân tạo ra các thế hệ con cháu.",
    "b": "Đột biến gen ngẫu nhiên xảy ra trong quá trình nhân đôi ADN.",
    "c": "Sự tiếp hợp và truyền plasmid chứa gen kháng thuốc qua cầu chất.",
    "d": "Sự xâm nhập của virus thực khuẩn thể mang theo đoạn gen kháng.",
    "correct": "c",
    "explain": "Tiếp hợp (conjugation) cho phép vi khuẩn truyền trực tiếp các vòng ADN nhỏ (plasmid) mang gen kháng thuốc cho vi khuẩn khác loài."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Tại sao trong kỹ thuật PCR cần sử dụng enzyme Taq polymerase được tách chiết từ vi khuẩn suối nước nóng?",
    "a": "Vì nó có tốc độ tổng hợp ADN nhanh hơn các enzyme thông thường.",
    "b": "Vì nó có khả năng tự sửa lỗi sao chép chính xác hơn enzyme khác.",
    "c": "Vì nó hoạt động được ở nhiệt độ thấp giúp bảo vệ mẫu ADN gốc.",
    "d": "Vì nó chịu được nhiệt độ cao ở bước biến tính tách mạch ADN kép.",
    "correct": "d",
    "explain": "PCR cần nhiệt độ ~95 độ C để tách hai mạch ADN. Enzyme bình thường sẽ bị hỏng, nhưng Taq polymerase chịu nhiệt vẫn hoạt động tốt."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Người có nhóm máu AB được coi là 'người nhận phổ thông' trong truyền máu (hồng cầu) vì lý do miễn dịch nào?",
    "a": "Hồng cầu của họ không có kháng nguyên A và B trên bề mặt màng.",
    "b": "Huyết tương của họ không chứa kháng thể chống lại kháng nguyên A, B.",
    "c": "Hệ miễn dịch của họ bị ức chế nên không phản ứng với máu lạ.",
    "d": "Máu của họ có khả năng trung hòa mọi loại kháng thể của người cho.",
    "correct": "b",
    "explain": "Vì không có kháng thể anti-A và anti-B trong huyết tương, người nhóm AB sẽ không gây ngưng kết hồng cầu khi nhận máu từ các nhóm khác."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Hệ thống Ubiquitin-Proteasome trong tế bào chất thực hiện chức năng quan trọng nào đối với các protein?",
    "a": "Gắn nhãn và phân giải các protein bị hỏng hoặc không còn cần thiết.",
    "b": "Sửa chữa các cấu trúc bậc cao của protein bị biến tính do nhiệt.",
    "c": "Vận chuyển protein từ lưới nội chất đến bộ máy Golgi để hoàn thiện.",
    "d": "Tổng hợp các đoạn peptide tín hiệu để định vị protein trong tế bào.",
    "correct": "a",
    "explain": "Ubiquitin đóng vai trò là 'nhãn dán' đánh dấu protein lỗi, sau đó Proteasome (thùng rác tế bào) sẽ nghiền nát chúng thành axit amin."
  },
  
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong cấu trúc xoắn kép của ADN, yếu tố vật lý nào đóng vai trò chính yếu nhất giúp ổn định cấu trúc chồng xếp của các cặp base?",
    "a": "Lực liên kết hydro giữa các cặp base bổ sung.",
    "b": "Lực liên kết cộng hóa trị phosphodiester bền.",
    "c": "Tương tác kị nước giữa các mặt phẳng base.",
    "d": "Lực hút tĩnh điện giữa các nhóm phosphate.",
    "correct": "c",
    "explain": "Mặc dù liên kết hydro giúp định hướng đặc hiệu, nhưng tương tác chồng xếp (kị nước) giữa các mặt phẳng base mới là lực chính giữ ổn định cấu trúc xoắn trong môi trường nước."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Tại sao thực vật C4 lại không xảy ra hiện tượng hô hấp sáng gây lãng phí năng lượng như thực vật C3 khi cường độ ánh sáng cao?",
    "a": "Nhờ enzyme PEP-carboxylase có ái lực cao với CO2 và không gắn với O2.",
    "b": "Nhờ khả năng đóng khí khổng hoàn toàn vào ban ngày để ngăn O2 xâm nhập.",
    "c": "Nhờ cấu trúc lục lạp đặc biệt không chứa enzyme Rubisco trong mô giậu.",
    "d": "Nhờ quá trình quang phân ly nước bị ức chế mạnh mẽ khi trời nắng gắt.",
    "correct": "a",
    "explain": "PEP-carboxylase chỉ cố định CO2 mà không cố định O2, giúp cây C4 tránh được phản ứng oxy hóa chất nền của Rubisco (hô hấp sáng) ngay cả khi nồng độ CO2 thấp."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong cơ chế vận chuyển thụ động, tốc độ khuếch tán của một chất qua kênh protein sẽ đạt trạng thái bão hòa khi yếu tố nào xảy ra?",
    "a": "Nồng độ chất tan bên ngoài tế bào thấp hơn bên trong.",
    "b": "Năng lượng ATP trong tế bào bị cạn kiệt hoàn toàn.",
    "c": "Tất cả các protein kênh trên màng đều đang hoạt động.",
    "d": "Nhiệt độ môi trường giảm xuống dưới mức sinh lý học.",
    "correct": "c",
    "explain": "Khác với khuếch tán đơn giản, khuếch tán qua kênh/chất mang bị giới hạn bởi số lượng protein vận chuyển. Khi tất cả protein đều 'bận', tốc độ sẽ đạt Vmax."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Hệ thống 'đai Caspary' ở tế bào nội bì rễ cây có chức năng sinh học quan trọng nào đối với dòng vận chuyển nước và khoáng?",
    "a": "Tạo lực đẩy chủ động để bơm nước từ rễ lên thân cây.",
    "b": "Ngăn chặn dòng nước đi qua con đường gian bào tự do.",
    "c": "Hấp thụ thêm nước từ môi trường đất vào trong mạch gỗ.",
    "d": "Lọc sạch các vi khuẩn gây hại trước khi vào mạch rây.",
    "correct": "b",
    "explain": "Đai Caspary không thấm nước buộc dòng khoáng chất phải đi xuyên qua màng sinh chất (con đường tế bào chất), giúp cây kiểm soát chọn lọc các chất đi vào."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong quá trình truyền tin qua synapse, ion Ca2+ đóng vai trò then chốt nào trong việc giải phóng chất dẫn truyền thần kinh?",
    "a": "Trực tiếp mang tín hiệu điện đi qua khe hở synapse hẹp.",
    "b": "Kích hoạt sự phân giải các túi chứa chất trung gian hóa.",
    "c": "Kích thích các túi màng hòa nhập vào màng trước synapse.",
    "d": "Ngăn chặn sự tái hấp thu chất dẫn truyền về màng trước.",
    "correct": "c",
    "explain": "Khi xung điện đến, kênh Ca2+ mở, Ca2+ tràn vào làm các túi chứa chất dẫn truyền (như Acetylcholine) dung hợp với màng tế bào và giải phóng nội dung ra khe synapse."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Hiện tượng 'biến động mã' (Wobble) ở vị trí thứ ba của bộ ba mã hóa (codon) mang lại ý nghĩa tiết kiệm nào cho tế bào?",
    "a": "Giảm số lượng loại tARN cần thiết để đọc hết 61 mã bộ ba.",
    "b": "Giảm thiểu sai sót trong quá trình sao chép ADN nhiễm sắc.",
    "c": "Tăng tốc độ trượt của ribosome trên phân tử ARN thông tin.",
    "d": "Ngăn chặn sự hình thành các cấu trúc bậc hai trên mARN.",
    "correct": "a",
    "explain": "Do sự kết cặp lỏng lẻo ở vị trí thứ 3, một loại tARN có thể nhận diện nhiều codon đồng nghĩa khác nhau, giúp tế bào không cần đủ 61 loại tARN."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Tại sao các loài thú sống ở vùng cực (như gấu trắng) thường có kích thước cơ thể lớn hơn các loài họ hàng sống ở vùng nhiệt đới?",
    "a": "Để tích trữ được lượng mỡ dự phòng nhiều hơn cho mùa đông.",
    "b": "Để có bộ xương vững chắc hơn giúp di chuyển trên băng tuyết.",
    "c": "Để dễ dàng săn bắt các con mồi có kích thước lớn ở vùng cực.",
    "d": "Để giảm tỉ lệ diện tích bề mặt trên thể tích giúp giữ nhiệt.",
    "correct": "d",
    "explain": "Theo quy tắc Bergmann: Kích thước lớn làm giảm tỉ lệ S/V (diện tích/thể tích), giúp hạn chế sự thất thoát nhiệt lượng cơ thể ra môi trường lạnh giá."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong kĩ thuật di truyền, plasmid được sử dụng làm thể truyền (vector) nhờ vào đặc tính sinh học ưu việt nào dưới đây?",
    "a": "Là phân tử ADN thẳng có khả năng tích hợp nhanh vào gen chủ.",
    "b": "Là phân tử ADN vòng có khả năng tự nhân đôi độc lập với gen.",
    "c": "Là phân tử ARN bền vững không bị enzyme của tế bào phân hủy.",
    "d": "Là protein đặc biệt có thể mang gen xâm nhập qua màng tế bào.",
    "correct": "b",
    "explain": "Plasmid là ADN vòng nằm ngoài NST, có điểm khởi đầu sao chép riêng (ori) nên có thể nhân lên số lượng lớn trong tế bào vật chủ một cách độc lập."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Hormone Glucagon do tuyến tụy tiết ra thực hiện chức năng điều hòa đường huyết thông qua cơ chế tác động chủ yếu nào?",
    "a": "Kích thích tế bào cơ tăng cường hấp thu glucose từ dòng máu.",
    "b": "Ức chế quá trình phân giải lipid dự trữ trong các mô mỡ thừa.",
    "c": "Kích thích gan phân giải glycogen dự trữ thành glucose vào máu.",
    "d": "Thúc đẩy quá trình tổng hợp protein từ các axit amin tự do.",
    "correct": "c",
    "explain": "Glucagon là hormone đối kháng Insulin. Khi đường huyết thấp, nó kích thích gan chuyển hóa Glycogen thành Glucose để giải phóng vào máu."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Cơ chế 'cắt nối thay thế' (alternative splicing) tiền mARN ở sinh vật nhân thực mang lại lợi ích tiến hóa to lớn nào?",
    "a": "Tạo ra nhiều loại protein khác nhau từ một gen cấu trúc duy nhất.",
    "b": "Loại bỏ hoàn toàn các đột biến gen xảy ra trong quá trình sao chép.",
    "c": "Tăng độ bền vững của phân tử mARN trước các enzyme phân giải ARN.",
    "d": "Giúp quá trình dịch mã diễn ra nhanh hơn nhờ rút ngắn mạch mARN.",
    "correct": "a",
    "explain": "Bằng cách chọn các exon khác nhau để giữ lại, một gen có thể mã hóa cho nhiều phiên bản protein (isoform) khác nhau tùy thuộc vào loại mô và giai đoạn phát triển."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Sự hiện diện của lớp cutin dày trên biểu bì lá của thực vật sống ở vùng khô hạn nhằm mục đích thích nghi chủ yếu nào?",
    "a": "Phản xạ ánh sáng mặt trời gay gắt để tránh làm cháy lá cây.",
    "b": "Hạn chế sự thoát hơi nước qua bề mặt lá ngoài các khí khổng.",
    "c": "Ngăn chặn sự xâm nhập của các loài côn trùng gây hại cho lá.",
    "d": "Tăng cường độ cứng cho lá để chống chịu sức gió bão sa mạc.",
    "correct": "b",
    "explain": "Cutin là sáp không thấm nước. Lớp cutin dày buộc nước phải thoát ra chủ yếu qua khí khổng (nơi cây có thể chủ động đóng mở), giúp tiết kiệm nước."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong chu trình Krebs, phân tử Axit Oxaloaxetic đóng vai trò gì trong việc duy trì sự hoạt động liên tục của chu trình?",
    "a": "Là chất nhận nhóm Acetyl-CoA đầu tiên để tái tạo axit Citric.",
    "b": "Là sản phẩm cuối cùng được đào thải ra ngoài ti thể ngay lập.",
    "c": "Là enzyme xúc tác cho phản ứng khử carboxyl của axit Pyruvic.",
    "d": "Là nguồn cung cấp năng lượng trực tiếp để tổng hợp phân tử ATP.",
    "correct": "a",
    "explain": "Oxaloaxetic (4C) kết hợp với Acetyl-CoA (2C) tạo thành Citric (6C), khởi đầu chu trình. Cuối chu trình, Oxaloaxetic được tái tạo để bắt đầu vòng mới."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Tại sao các tế bào hồng cầu của người không có nhân và các bào quan như ti thể khi đã biệt hóa thành dạng trưởng thành?",
    "a": "Để giảm trọng lượng giúp chúng di chuyển nhanh hơn trong máu.",
    "b": "Để ngăn chặn sự phân chia tế bào không kiểm soát gây ung thư.",
    "c": "Để tối ưu hóa không gian chứa Hemoglobin giúp vận chuyển oxy.",
    "d": "Để tránh việc tiêu thụ oxy mà chúng đang vận chuyển đi nuôi cơ.",
    "correct": "c",
    "explain": "Việc loại bỏ nhân và ti thể giúp hồng cầu trở thành 'túi chứa' Hemoglobin tối đa, đồng thời ngăn hồng cầu tự tiêu thụ oxy (chúng hô hấp kị khí)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Vai trò của enzyme Helicase trong quá trình nhân đôi ADN là thực hiện chức năng cơ học nào đối với phân tử ADN kép?",
    "a": "Cắt đứt liên kết cộng hóa trị trên mạch đường - phosphate bền.",
    "b": "Tháo xoắn và phá vỡ các liên kết hydro để tách hai mạch đơn ra.",
    "c": "Gắn các đoạn mồi ARN vào mạch khuôn để khởi đầu sự tổng hợp.",
    "d": "Nối các đoạn Okazaki lại với nhau để tạo thành mạch hoàn chỉnh.",
    "correct": "b",
    "explain": "Helicase hoạt động như một cái 'dây kéo', trượt dọc theo ADN và dùng năng lượng ATP để tách đôi hai mạch đơn, tạo chạc ba sao chép."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Hiện tượng 'tự thực' (Autophagy) của tế bào được kích hoạt mạnh mẽ nhất trong điều kiện sinh lý bất lợi nào dưới đây?",
    "a": "Khi tế bào đang phân chia mạnh mẽ và cần nhiều vật liệu mới.",
    "b": "Khi tế bào bị thiếu hụt dinh dưỡng và cần tái chế nội bào quan.",
    "c": "Khi tế bào bị nhiễm virus và cần tiêu diệt tác nhân xâm nhập.",
    "d": "Khi tế bào tích lũy quá nhiều năng lượng dưới dạng mỡ dự trữ.",
    "correct": "b",
    "explain": "Khi đói, tế bào tự 'ăn' các thành phần của chính mình (bào quan già, protein hỏng) thông qua lysosome để lấy axit amin và năng lượng duy trì sự sống."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong hệ sinh thái, tại sao chuỗi thức ăn trên cạn thường ngắn hơn chuỗi thức ăn dưới nước (đại dương)?",
    "a": "Do hiệu suất chuyển hóa năng lượng của động vật trên cạn thấp hơn.",
    "b": "Do sinh vật sản xuất trên cạn có kích thước lớn và khó tiêu hóa.",
    "c": "Do động vật trên cạn tiêu tốn nhiều năng lượng để chống trọng lực.",
    "d": "Do môi trường trên cạn khắc nghiệt hơn môi trường nước ổn định.",
    "correct": "c",
    "explain": "Động vật trên cạn tốn nhiều năng lượng cho việc duy trì thân nhiệt và nâng đỡ cơ thể (chống trọng lực), làm năng lượng thất thoát nhanh hơn qua mỗi bậc."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Cơ chế 'bảo thủ' (semiconservative) trong quá trình nhân đôi ADN đảm bảo tính chính xác di truyền nhờ nguyên tắc nào?",
    "a": "Mỗi phân tử ADN con giữ lại một mạch cũ và tổng hợp một mạch mới.",
    "b": "Mỗi phân tử ADN con được tổng hợp hoàn toàn mới từ các nucleotide.",
    "c": "Phân tử ADN mẹ được bảo tồn nguyên vẹn sau khi quá trình kết thúc.",
    "d": "Các đoạn ADN con được lắp ghép ngẫu nhiên từ các đoạn ADN mẹ cũ.",
    "correct": "a",
    "explain": "Nguyên tắc bán bảo toàn giúp giảm thiểu sai sót: mạch cũ đóng vai trò là khuôn mẫu chính xác để tổng hợp mạch bổ sung mới."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Tại sao một số loài vi khuẩn cổ (Archaea) có thể sống trong môi trường nước sôi 100°C mà protein không bị biến tính?",
    "a": "Do chúng có lớp vỏ cách nhiệt cực tốt bao quanh tế bào chất.",
    "b": "Do protein của chúng có cấu trúc cuộn chặt và nhiều liên kết.",
    "c": "Do chúng liên tục tổng hợp protein mới để thay thế protein hỏng.",
    "d": "Do chúng không sử dụng protein để thực hiện các chức năng sống.",
    "correct": "b",
    "explain": "Protein của vi khuẩn chịu nhiệt có nhiều liên kết ion, cầu nối disulfide và lõi kị nước chặt chẽ, giúp cấu trúc không gian bền vững trước nhiệt độ cao."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Sự khác biệt về thế năng nước (water potential) giữa đất và rễ cây là động lực chính cho quá trình nào dưới đây?",
    "a": "Vận chuyển chủ động các ion khoáng từ đất vào lông hút.",
    "b": "Dòng nước thẩm thấu thụ động từ đất vào bên trong rễ cây.",
    "c": "Thoát hơi nước qua khí khổng để làm mát bề mặt lá cây.",
    "d": "Đẩy dòng mạch gỗ di chuyển ngược chiều trọng lực lên cao.",
    "correct": "b",
    "explain": "Nước luôn di chuyển từ nơi có thế năng nước cao (đất ẩm) sang nơi có thế năng nước thấp hơn (tế bào rễ chứa nhiều chất tan) một cách thụ động."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong quá trình giảm phân, sự tiếp hợp và trao đổi chéo giữa các nhiễm sắc thể tương đồng xảy ra ở giai đoạn nào?",
    "a": "Kỳ đầu của giảm phân I.",
    "b": "Kỳ giữa của giảm phân I.",
    "c": "Kỳ đầu của giảm phân II.",
    "d": "Kỳ sau của giảm phân II.",
    "correct": "a",
    "explain": "Tại kỳ đầu I, các NST tương đồng bắt cặp chính xác; sự trao đổi đoạn (crossing-over) tạo ra các tổ hợp gen mới (biến dị tổ hợp)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Tại sao thuốc kháng sinh Penicillin lại có tác dụng diệt khuẩn mạnh đối với vi khuẩn Gram dương hơn là Gram âm?",
    "a": "Do Gram dương có thành peptidoglycan dày và nằm ngay bề mặt ngoài.",
    "b": "Do Gram dương không có khả năng sinh enzyme phân giải thuốc kháng.",
    "c": "Do Gram âm có màng tế bào chất dày hơn ngăn cản thuốc thâm nhập.",
    "d": "Do Gram âm sinh sản chậm hơn nên ít chịu tác động của thuốc hơn.",
    "correct": "a",
    "explain": "Penicillin tấn công vào quá trình tổng hợp thành peptidoglycan. Gram âm có lớp màng ngoài (outer membrane) bảo vệ, ngăn thuốc tiếp cận thành."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong cơ chế điều hòa Operon Lac, chất cảm ứng Allolactose thực hiện chức năng kích hoạt phiên mã bằng cách nào?",
    "a": "Gắn vào vùng khởi động để giúp enzyme polymerase bám chặt hơn.",
    "b": "Gắn vào protein ức chế làm nó thay đổi cấu hình và rời khỏi ADN.",
    "c": "Phân giải protein ức chế thành các axit amin để loại bỏ cản trở.",
    "d": "Gắn trực tiếp vào gen cấu trúc để khởi động quá trình phiên mã.",
    "correct": "b",
    "explain": "Allolactose liên kết với protein ức chế (LacI), làm protein này mất khả năng bám vào vùng vận hành (Operator), từ đó 'mở khóa' cho gen hoạt động."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Cơ chế 'bẫy ion' trong không bào của tế bào thực vật giúp cây chịu đựng được môi trường đất nhiễm mặn nhờ vào đâu?",
    "a": "Bơm các ion Na+ độc hại từ tế bào chất vào chứa trong không bào.",
    "b": "Đẩy toàn bộ ion Na+ ra khỏi rễ trở lại môi trường đất xung quanh.",
    "c": "Biến đổi ion Na+ thành các hợp chất hữu cơ không gây độc hại cây.",
    "d": "Sử dụng ion Na+ thay thế cho ion K+ trong các phản ứng sinh hóa.",
    "correct": "a",
    "explain": "Cây chịu mặn dùng năng lượng để 'nhốt' Na+ vào không bào (khu vực cách ly), giữ cho nồng độ Na+ trong tế bào chất thấp để không ức chế enzyme."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong quá trình truyền tin tế bào, tại sao các thụ thể nội bào (trong chất) chỉ dành cho các hormone loại steroid?",
    "a": "Vì steroid có kích thước nhỏ nên dễ dàng lọt qua các kênh protein.",
    "b": "Vì steroid có bản chất lipid nên khuếch tán được qua màng tế bào.",
    "c": "Vì steroid tích điện dương nên bị màng tế bào tích điện âm hút vào.",
    "d": "Vì steroid không bị phân hủy bởi các enzyme nằm trên màng tế bào.",
    "correct": "b",
    "explain": "Màng sinh chất là lớp lipid kép. Chỉ các chất kị nước (tan trong lipid) như steroid mới đi xuyên qua màng để gặp thụ thể bên trong."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Hiện tượng 'Di nhập gen' (Gene flow) có tác động tích cực nào đối với sự tồn vong của một quần thể sinh vật nhỏ?",
    "a": "Làm tăng sự đồng nhất di truyền giúp quần thể ổn định hơn trước.",
    "b": "Cung cấp các alen mới làm tăng đa dạng di truyền cho quần thể đó.",
    "c": "Ngăn chặn sự xâm nhập của các cá thể lạ mang mầm bệnh nguy hiểm.",
    "d": "Thúc đẩy quá trình giao phối cận huyết để giữ lại các gen quý giá.",
    "correct": "b",
    "explain": "Quần thể nhỏ dễ bị suy giảm đa dạng di truyền. Di nhập gen mang đến các biến dị mới, giúp quần thể có thêm nguyên liệu để thích nghi."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Vai trò của cấu trúc 'mũ 5'' (5' cap) được gắn vào đầu phân tử mARN sơ khai của sinh vật nhân thực là gì?",
    "a": "Đánh dấu vị trí kết thúc quá trình dịch mã cho ribosome nhận biết.",
    "b": "Bảo vệ mARN khỏi bị phân hủy và giúp ribosome gắn vào để dịch mã.",
    "c": "Giúp enzyme cắt bỏ các đoạn intron không mã hóa ra khỏi phân tử.",
    "d": "Làm khuôn mẫu để tổng hợp mạch ADN bổ sung trong phiên mã ngược.",
    "correct": "b",
    "explain": "Mũ 5' (Guanine bị methyl hóa) là tín hiệu nhận diện cho ribosome và bảo vệ đầu 5' của mARN khỏi sự tấn công của các enzyme exonuclease."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Tại sao ti thể của người mẹ lại được di truyền nguyên vẹn cho tất cả các con mà không có sự đóng góp của bố?",
    "a": "Do ti thể của tinh trùng nằm ở đuôi và bị bỏ lại khi thụ tinh.",
    "b": "Do hệ gen của ti thể bố bị gen của mẹ ức chế không biểu hiện.",
    "c": "Do ti thể của bố có cấu trúc khác biệt không tương thích với mẹ.",
    "d": "Do tế bào trứng tiết ra chất độc tiêu diệt toàn bộ ti thể bố.",
    "correct": "a",
    "explain": "Khi thụ tinh, chỉ có nhân của tinh trùng xâm nhập vào trứng. Các bào quan (bao gồm ti thể) nằm ở cổ và đuôi tinh trùng thường không đi vào."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong hệ sinh thái rừng mưa nhiệt đới, tại sao phần lớn chất dinh dưỡng lại nằm trong sinh khối chứ không phải trong đất?",
    "a": "Do tốc độ phân giải xác thực vật diễn ra rất chậm trong rừng.",
    "b": "Do đất rừng mưa thường xuyên bị ngập nước nên nghèo dinh dưỡng.",
    "c": "Do tốc độ phân giải nhanh và rễ cây hấp thụ lại khoáng ngay lập tức.",
    "d": "Do vi khuẩn cố định đạm hoạt động kém hiệu quả trong môi trường này.",
    "correct": "c",
    "explain": "Nhiệt ẩm cao làm vi sinh vật phân giải xác hữu cơ cực nhanh. Rễ cây chằng chịt hấp thụ khoáng ngay khi nó vừa được giải phóng, đất rất nghèo."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Cơ chế 'cảm ứng mật độ' (Quorum sensing) ở vi khuẩn cho phép chúng thực hiện hành vi tập thể nào dưới đây?",
    "a": "Hình thành màng sinh học (biofilm) khi số lượng cá thể đủ đông.",
    "b": "Di chuyển tản mạn ra xa nhau để tìm kiếm nguồn thức ăn mới lạ.",
    "c": "Tăng tốc độ phân chia tế bào khi mật độ quần thể còn thưa thớt.",
    "d": "Trao đổi chất dinh dưỡng trực tiếp giữa các tế bào cạnh nhau.",
    "correct": "a",
    "explain": "Vi khuẩn tiết ra tín hiệu hóa học. Khi mật độ cao, nồng độ tín hiệu đủ lớn để kích hoạt đồng loạt các gen tạo màng nhầy hoặc độc tố."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Chức năng chính của các 'điểm nóng' (hotspots) đa dạng sinh học trên Trái Đất được các nhà bảo tồn xác định là gì?",
    "a": "Nơi có khí hậu ổn định nhất để bảo quản các mẫu vật di truyền.",
    "b": "Khu vực chứa nhiều loài đặc hữu nhưng đang bị đe dọa nghiêm trọng.",
    "c": "Vùng đất rộng lớn chưa từng chịu sự tác động của con người hiện đại.",
    "d": "Nơi có năng suất sinh học cao nhất cung cấp thực phẩm cho con người.",
    "correct": "b",
    "explain": "Hotspot là nơi có tính đa dạng sinh học cực cao (đặc biệt là loài đặc hữu) nhưng đã mất đi phần lớn môi trường sống gốc, cần ưu tiên bảo vệ."
  },
  
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong quá trình phiên mã ở sinh vật nhân thực, các yếu tố phiên mã (transcription factors) đóng vai trò gì quan trọng nhất?",
    "a": "Trực tiếp tháo xoắn ADN để enzyme polymerase có thể hoạt động.",
    "b": "Nhận diện vùng khởi động và giúp enzyme polymerase gắn vào ADN.",
    "c": "Cắt bỏ các đoạn intron ra khỏi phân tử mARN ngay khi tổng hợp.",
    "d": "Tổng hợp đoạn mồi ARN cần thiết để bắt đầu quá trình phiên mã.",
    "correct": "b",
    "explain": "Enzyme ARN polymerase ở sinh vật nhân thực không thể tự nhận diện vùng khởi động (promoter); nó cần một phức hệ các protein gọi là yếu tố phiên mã dẫn đường."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Tại sao một số loài vi khuẩn có thể cố định nitơ tự do từ không khí trong khi thực vật và động vật hoàn toàn không thể làm được?",
    "a": "Do chúng có enzyme nitrogenase chứa phức hệ sắt-molybdenum đặc biệt.",
    "b": "Do chúng sống trong môi trường đất giàu khoáng chất hơn các loài khác.",
    "c": "Do chúng có khả năng tạo ra năng lượng ATP cao gấp nhiều lần thực vật.",
    "d": "Do màng tế bào của chúng cho phép khí nitơ thẩm thấu qua dễ dàng hơn.",
    "correct": "a",
    "explain": "Chỉ enzyme nitrogenase mới có khả năng bẻ gãy liên kết ba cực kỳ bền vững của phân tử N2 để tạo thành NH3, dạng mà sinh vật có thể sử dụng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Hiện tượng 'thống trị ngọn' (apical dominance) ở thực vật được điều khiển chủ yếu bởi sự tương tác đối kháng giữa hai loại hormone nào?",
    "a": "Auxin (ức chế chồi bên) và Cytokinin (kích thích chồi bên).",
    "b": "Gibberellin (kích thích thân) và Ethylene (kích thích rụng).",
    "c": "Axit Abscisic (gây ngủ) và Gibberellin (phá vỡ trạng thái ngủ).",
    "d": "Auxin (kích thích rễ) và Ethylene (kích thích quả chín sớm).",
    "correct": "a",
    "explain": "Auxin sản sinh ở đỉnh ngọn di chuyển xuống ức chế chồi bên. Cytokinin từ rễ di chuyển lên kích thích chồi bên. Tỉ lệ này quyết định hình thái cây."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Cơ chế nào giúp kháng thể (antibody) nhận diện đặc hiệu một loại kháng nguyên nhất định trong hàng triệu loại kháng nguyên khác nhau?",
    "a": "Sự thay đổi cấu trúc của vùng hằng định trên chuỗi nặng.",
    "b": "Sự đa dạng của trình tự axit amin tại vùng biến đổi (V).",
    "c": "Khả năng thay đổi hình dạng linh hoạt của toàn bộ phân tử.",
    "d": "Sự kết hợp ngẫu nhiên với các protein bổ thể trong máu.",
    "correct": "b",
    "explain": "Vùng biến đổi ở đầu chữ Y của kháng thể có trình tự axit amin cực kỳ đa dạng, tạo nên các 'khe' không gian chỉ khớp duy nhất với một kháng nguyên cụ thể."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong chu trình nitơ, nhóm vi khuẩn phản nitrat hóa (denitrifying bacteria) thực hiện quá trình chuyển hóa nào gây thất thoát đạm trong đất?",
    "a": "Chuyển hóa amoni (NH4+) thành nitrit (NO2-) và nitrat (NO3-).",
    "b": "Chuyển hóa nitrat (NO3-) thành khí nitơ (N2) trả lại khí quyển.",
    "c": "Phân giải xác sinh vật hữu cơ để giải phóng amoni (NH4+) vào đất.",
    "d": "Cố định khí nitơ (N2) từ không khí thành các hợp chất chứa nitơ.",
    "correct": "b",
    "explain": "Trong điều kiện kị khí (đất ngập úng), vi khuẩn này dùng NO3- làm chất nhận electron thay cho oxy, giải phóng N2 dạng khí bay mất khỏi đất."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Tại sao các tế bào ung thư thường có xu hướng chuyển sang sử dụng quá trình lên men (hiệu ứng Warburg) ngay cả khi có đủ oxy?",
    "a": "Để tạo ra các sản phẩm trung gian cần thiết cho tổng hợp sinh khối nhanh.",
    "b": "Vì ti thể của tế bào ung thư đã bị phá hủy hoàn toàn không hoạt động.",
    "c": "Vì quá trình lên men tạo ra nhiều năng lượng ATP hơn hô hấp hiếu khí.",
    "d": "Để tạo ra môi trường kiềm giúp bảo vệ tế bào khỏi hệ thống miễn dịch.",
    "correct": "a",
    "explain": "Mặc dù tạo ít ATP, nhưng đường phân cung cấp sườn carbon để tổng hợp nucleotide, axit amin và lipid phục vụ cho sự phân chia tế bào thần tốc."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong cấu trúc bậc 3 của protein, loại liên kết nào đóng vai trò quan trọng nhất trong việc ổn định lõi kị nước của phân tử?",
    "a": "Liên kết hydro giữa các nhóm trong bộ khung polypeptide.",
    "b": "Liên kết ion giữa các nhóm R tích điện trái dấu bề mặt.",
    "c": "Tương tác Van der Waals giữa các nhóm R không phân cực.",
    "d": "Cầu nối disulfide giữa các gốc cysteine ở xa nhau.",
    "correct": "c",
    "explain": "Các axit amin kị nước có xu hướng tụ lại vào bên trong phân tử protein để tránh nước, tương tác Van der Waals giữ chúng lại với nhau, ổn định cấu trúc."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Đặc điểm nào của hệ tuần hoàn ở côn trùng giúp chúng duy trì hoạt động bay liên tục mà không phụ thuộc vào tốc độ dòng máu?",
    "a": "Tim có khả năng co bóp với tần số cao hơn nhiều so với thú.",
    "b": "Máu chứa các sắc tố hô hấp có ái lực với oxy cực kỳ mạnh.",
    "c": "Hệ thống ống khí dẫn oxy trực tiếp đến từng tế bào cơ bay.",
    "d": "Cơ bay có khả năng hoạt động yếm khí trong thời gian dài.",
    "correct": "c",
    "explain": "Ở côn trùng, hệ tuần hoàn chỉ vận chuyển dinh dưỡng. Oxy được cung cấp qua hệ thống ống khí (tracheal system) độc lập, đảm bảo oxy tới cơ cực nhanh."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Khi nồng độ CO2 trong máu tăng cao, trung khu hô hấp ở hành não sẽ phản ứng như thế nào để điều hòa cân bằng nội môi?",
    "a": "Kích thích tim đập chậm lại để giảm lượng CO2 đến phổi.",
    "b": "Tăng nhịp thở và độ sâu hô hấp để đào thải CO2 ra ngoài.",
    "c": "Ức chế hoạt động của cơ hoành để giữ CO2 lại trong máu.",
    "d": "Kích thích thận tái hấp thụ ion H+ để trung hòa axit máu.",
    "correct": "b",
    "explain": "CO2 tăng làm giảm pH máu và dịch não tủy. Trung khu hô hấp phát hiện pH giảm sẽ kích thích tăng thông khí để thải CO2, nâng pH trở lại bình thường."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Cơ chế 'Sửa sai' (Proofreading) của enzyme DNA Polymerase trong quá trình nhân đôi ADN được thực hiện nhờ hoạt tính nào?",
    "a": "Hoạt tính exonuclease theo chiều 3' đến 5' để cắt bỏ nucleotide sai.",
    "b": "Hoạt tính polymerase theo chiều 5' đến 3' để tổng hợp mạch mới.",
    "c": "Hoạt tính helicase để tháo xoắn ADN tại vị trí có nucleotide lỗi.",
    "d": "Hoạt tính ligase để nối lại các đoạn ADN sau khi đã sửa chữa xong.",
    "correct": "a",
    "explain": "Khi gắn sai nucleotide, enzyme sẽ lùi lại, dùng hoạt tính exonuclease 3'-5' để cắt bỏ nó trước khi tiếp tục tổng hợp, giảm tỉ lệ đột biến xuống cực thấp."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Tại sao các loài thực vật ngập mặn thường có áp suất thẩm thấu trong tế bào rễ cao hơn rất nhiều so với cây trồng thông thường?",
    "a": "Để ngăn chặn muối độc hại từ nước biển xâm nhập vào rễ.",
    "b": "Để có thể hút được nước từ môi trường nước biển ưu trương.",
    "c": "Để tích lũy nước ngọt dự trữ cho các giai đoạn thủy triều rút.",
    "d": "Để tạo độ cứng cho rễ giúp cây đứng vững trên nền bùn lầy.",
    "correct": "b",
    "explain": "Nước di chuyển từ thế năng cao đến thấp. Để lấy nước từ nước biển (nồng độ muối cao), tế bào rễ phải tích lũy chất tan để có nồng độ cao hơn nữa."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong kỹ thuật di truyền, tại sao người ta thường dùng gen chỉ thị (như gen kháng kháng sinh) gắn kèm vào vector chuyển gen?",
    "a": "Để tiêu diệt các tế bào vi khuẩn tạp nhiễm trong môi trường nuôi.",
    "b": "Để nhận biết và chọn lọc các tế bào đã nhận được ADN tái tổ hợp.",
    "c": "Để tăng cường khả năng nhân bản của plasmid bên trong tế bào chủ.",
    "d": "Để kích thích tế bào chủ sản xuất protein mục tiêu với số lượng lớn.",
    "correct": "b",
    "explain": "Quá trình chuyển gen hiệu suất thấp. Chỉ những tế bào nhận được plasmid (có gen kháng thuốc) mới sống được trên môi trường chứa kháng sinh, giúp sàng lọc."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Sự kiện nào trong giảm phân là nguyên nhân chính dẫn đến hội chứng Down (3 nhiễm sắc thể số 21) ở người?",
    "a": "Đột biến cấu trúc làm lặp đoạn trên nhiễm sắc thể số 21.",
    "b": "Rối loạn phân ly của cặp nhiễm sắc thể 21 trong giảm phân.",
    "c": "Sự thụ tinh giữa một trứng bình thường và hai tinh trùng.",
    "d": "Trao đổi chéo không cân giữa các nhiễm sắc thể tương đồng.",
    "correct": "b",
    "explain": "Nếu cặp NST 21 không phân ly, sẽ tạo ra giao tử có 2 NST 21. Khi thụ tinh với giao tử bình thường (1 NST 21) sẽ tạo hợp tử 3 NST 21 (Trisomy 21)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Vai trò của NADH và FADH2 được tạo ra trong chu trình Krebs đối với quá trình hô hấp tế bào là gì?",
    "a": "Cung cấp năng lượng trực tiếp cho các phản ứng sinh tổng hợp.",
    "b": "Vận chuyển electron và proton đến chuỗi chuyền điện tử màng.",
    "c": "Kích hoạt các enzyme phân giải đường glucose trong tế bào chất.",
    "d": "Trung hòa các gốc tự do oxy hóa được tạo ra trong quá trình.",
    "correct": "b",
    "explain": "Chúng là các chất mang điện tử giàu năng lượng. Khi đi vào chuỗi chuyền điện tử, năng lượng của chúng được dùng để tạo gradient H+ tổng hợp ATP."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Tại sao các loài động vật hằng nhiệt (nóng) sống ở vùng lạnh thường có tai, đuôi và chi nhỏ hơn đồng loại ở vùng nóng (Quy tắc Allen)?",
    "a": "Để giảm diện tích bề mặt tiếp xúc, hạn chế mất nhiệt cơ thể.",
    "b": "Để dễ dàng di chuyển và ẩn nấp trong môi trường có nhiều tuyết.",
    "c": "Để tập trung dinh dưỡng nuôi phần thân mình quan trọng hơn.",
    "d": "Để giảm thiểu nguy cơ bị tê cóng và hoại tử các bộ phận xa tim.",
    "correct": "a",
    "explain": "Các bộ phận nhô ra làm tăng diện tích bề mặt tản nhiệt. Ở vùng lạnh, việc thu nhỏ chúng giúp giữ ấm cơ thể hiệu quả hơn."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Cơ chế nào giúp tế bào thực vật nhận biết và phản ứng với tín hiệu ánh sáng để điều hướng sinh trưởng (hướng sáng)?",
    "a": "Sự phân hủy của diệp lục ở phía được chiếu sáng làm cây cong.",
    "b": "Sự di chuyển của auxin từ phía sáng sang phía tối của thân cây.",
    "c": "Sự gia tăng tốc độ quang hợp ở các tế bào nằm về phía ánh sáng.",
    "d": "Sự đóng mở khí khổng không đồng đều giữa hai mặt của lá cây.",
    "correct": "b",
    "explain": "Auxin sợ ánh sáng nên di chuyển sang phía tối. Nồng độ auxin cao ở phía tối kích thích tế bào dãn dài nhanh hơn, làm cây uốn cong về phía sáng."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong hệ sinh thái, tại sao năng suất sơ cấp (tổng lượng chất hữu cơ cây tạo ra) ở đại dương lại thấp hơn ở vùng nước ven bờ?",
    "a": "Do cường độ ánh sáng mặt trời ở đại dương yếu hơn vùng ven bờ.",
    "b": "Do nhiệt độ nước ở đại dương quá thấp kìm hãm sự phát triển tảo.",
    "c": "Do thiếu hụt các chất dinh dưỡng khoáng thiết yếu (như Sắt, Nitơ).",
    "d": "Do nồng độ muối quá cao làm hạn chế khả năng quang hợp của tảo.",
    "correct": "c",
    "explain": "Đại dương mở thường nghèo khoáng chất (sa mạc biển) vì xác sinh vật chìm xuống đáy sâu, không tuần hoàn lại tầng mặt, hạn chế sự phát triển của tảo."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Hợp chất 2,3-BPG (Bisphosphoglycerate) trong hồng cầu có tác dụng gì đối với khả năng vận chuyển oxy của Hemoglobin?",
    "a": "Làm tăng ái lực của Hemoglobin với oxy, giúp lấy oxy ở phổi tốt hơn.",
    "b": "Làm giảm ái lực của Hemoglobin với oxy, giúp nhả oxy ở mô tốt hơn.",
    "c": "Bảo vệ Hemoglobin không bị oxy hóa thành Methemoglobin mất chức năng.",
    "d": "Giúp Hemoglobin gắn kết chặt chẽ hơn với khí CO2 để đào thải ra ngoài.",
    "correct": "b",
    "explain": "2,3-BPG chèn vào giữa phân tử Hemoglobin, làm ổn định trạng thái căng (T-state), khiến nó dễ nhả oxy ra cho các mô đang cần (đặc biệt khi leo núi cao)."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Tại sao một gen ở sinh vật nhân sơ (vi khuẩn) có thể phiên mã và dịch mã đồng thời, còn ở sinh vật nhân thực thì không?",
    "a": "Do sinh vật nhân sơ có tốc độ tổng hợp protein nhanh hơn rất nhiều.",
    "b": "Do ở nhân sơ không có màng nhân ngăn cách ADN với ribosome.",
    "c": "Do ribosome của nhân sơ có cấu trúc đơn giản hơn ribosome nhân thực.",
    "d": "Do mARN của nhân sơ bền vững hơn mARN của sinh vật nhân thực.",
    "correct": "b",
    "explain": "Ở nhân sơ, ADN nằm trong tế bào chất nên ribosome có thể bám vào mARN ngay khi nó đang được tổng hợp. Ở nhân thực, màng nhân ngăn cách hai quá trình này."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Vai trò của dòng điện tử không vòng (non-cyclic) trong pha sáng quang hợp là tạo ra những sản phẩm nào cung cấp cho pha tối?",
    "a": "Chỉ tạo ra năng lượng ATP để phục vụ chu trình Calvin.",
    "b": "Tạo ra cả ATP và NADPH, đồng thời giải phóng khí Oxy.",
    "c": "Tạo ra NADPH và Oxy nhưng không tổng hợp được ATP.",
    "d": "Tạo ra đường Glucose trực tiếp từ năng lượng ánh sáng.",
    "correct": "b",
    "explain": "Dòng điện tử đi từ nước qua PSII và PSI đến NADP+, tạo ra lực khử NADPH và gradient proton để tổng hợp ATP, cung cấp năng lượng và nguyên liệu cho pha tối."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong cơ chế co cơ vân, ion Canxi (Ca2+) liên kết với protein nào để làm lộ vị trí hoạt động trên sợi Actin?",
    "a": "Liên kết với Myosin để kích hoạt đầu phân tử này.",
    "b": "Liên kết với Troponin làm dịch chuyển sợi Tropomyosin.",
    "c": "Liên kết trực tiếp với Actin để tạo cầu nối ngang.",
    "d": "Liên kết với ATP để cung cấp năng lượng cho sự co.",
    "correct": "b",
    "explain": "Bình thường Tropomyosin che vị trí liên kết. Ca2+ gắn vào Troponin làm phức hệ này đổi hình dạng, kéo Tropomyosin ra, cho phép Myosin gắn vào Actin."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Hiện tượng 'Di truyền ngoại nhân' (qua tế bào chất) có đặc điểm nào khác biệt so với di truyền qua nhiễm sắc thể nhân?",
    "a": "Kết quả lai thuận và lai nghịch là hoàn toàn giống nhau.",
    "b": "Đời con luôn mang kiểu hình giống với kiểu hình của mẹ.",
    "c": "Các tính trạng luôn phân ly theo tỉ lệ Mendel điển hình.",
    "d": "Gen di truyền ngoại nhân không bao giờ bị đột biến đổi.",
    "correct": "b",
    "explain": "Do tinh trùng hầu như không đóng góp tế bào chất, hợp tử nhận toàn bộ ti thể/lục lạp từ trứng của mẹ. Do đó, tính trạng ngoại nhân di truyền theo dòng mẹ."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Tại sao thuốc trừ sâu sinh học (dùng vi khuẩn/nấm) lại được coi là thân thiện với môi trường hơn thuốc hóa học?",
    "a": "Vì chúng có phổ tác động rộng, tiêu diệt được mọi loại côn trùng.",
    "b": "Vì chúng có tính đặc hiệu cao, ít gây hại cho sinh vật không đích.",
    "c": "Vì chúng tồn tại vĩnh viễn trong môi trường đất mà không phân hủy.",
    "d": "Vì chúng làm tăng độ phì nhiêu của đất trồng một cách nhanh chóng.",
    "correct": "b",
    "explain": "Thuốc sinh học thường chỉ tấn công một nhóm sâu bệnh cụ thể (ví dụ: vi khuẩn Bt), không giết hại ong, thiên địch và không để lại dư lượng độc hại."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong quá trình thụ tinh ở động vật, phản ứng vỏ (cortical reaction) có vai trò ngăn chặn hiện tượng nào?",
    "a": "Ngăn chặn sự xâm nhập của nhiều tinh trùng cùng lúc (đa thụ tinh).",
    "b": "Ngăn chặn sự phá hủy của các enzyme tiêu hóa từ đầu tinh trùng.",
    "c": "Ngăn chặn hợp tử di chuyển ra khỏi ống dẫn trứng quá sớm.",
    "d": "Ngăn chặn sự phân chia tế bào trước khi vật chất di truyền hòa hợp.",
    "correct": "a",
    "explain": "Phản ứng vỏ làm cứng màng trong suốt và phá hủy thụ thể tinh trùng, đảm bảo chỉ có duy nhất một tinh trùng kết hợp với trứng để tạo hợp tử lưỡng bội."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Cấu trúc bậc 2 của ARN t (tARN) có dạng hình lá sấy ba thùy được duy trì bởi loại liên kết hóa học nào?",
    "a": "Liên kết cộng hóa trị bền vững giữa các nucleotide liền kề.",
    "b": "Liên kết hydro giữa các bazơ nitơ bổ sung trên cùng một mạch.",
    "c": "Liên kết kị nước giữa các nhóm đường ribose trong phân tử.",
    "d": "Liên kết ion giữa các nhóm phosphate tích điện âm mạnh mẽ.",
    "correct": "b",
    "explain": "Mạch đơn ARN tự gấp lại, các vùng bổ sung (A-U, G-X) liên kết hydro với nhau tạo thành các thùy và vòng, tạo nên hình dạng đặc trưng của tARN."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Tại sao sự đa dạng di truyền trong một quần thể lại là yếu tố then chốt giúp loài đó tránh khỏi nguy cơ tuyệt chủng?",
    "a": "Giúp quần thể có khả năng sinh sản nhanh hơn để bù đắp số lượng.",
    "b": "Cung cấp nguyên liệu cho chọn lọc tự nhiên khi môi trường thay đổi.",
    "c": "Làm giảm sự cạnh tranh nguồn thức ăn giữa các cá thể cùng loài.",
    "d": "Ngăn chặn sự xâm nhập của các loài ngoại lai vào trong lãnh thổ.",
    "correct": "b",
    "explain": "Môi trường luôn biến động. Đa dạng di truyền đảm bảo luôn có một số cá thể mang gen thích nghi sống sót và khôi phục quần thể sau thảm họa."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong kĩ thuật lai tế bào sinh dưỡng (xử lý bằng PEG hoặc virus), kết quả tạo ra là loại tế bào nào?",
    "a": "Tế bào đơn bội mang bộ nhiễm sắc thể của một trong hai loài.",
    "b": "Tế bào lai mang bộ nhiễm sắc thể lưỡng bội của cả hai loài gốc.",
    "c": "Tế bào ung thư có khả năng phân chia vô hạn trong môi trường.",
    "d": "Tế bào gốc toàn năng có thể biệt hóa thành mọi loại mô cơ thể.",
    "correct": "b",
    "explain": "Dung hợp hai tế bào trần (khác loài) tạo ra tế bào lai chứa nhân của cả hai, mang đặc điểm di truyền tổ hợp của hai loài xa nhau."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Hormone Ethylene ở thực vật có vai trò chính trong việc điều khiển quá trình sinh lý nào sau đây?",
    "a": "Kích thích sự phân chia tế bào ở mô phân sinh đỉnh và rễ.",
    "b": "Thúc đẩy quá trình chín của quả và sự rụng của lá, hoa già.",
    "c": "Kéo dài thân cây thông qua việc làm giãn thành tế bào cellulose.",
    "d": "Giữ cho hạt ở trạng thái ngủ nghỉ để tránh nảy mầm trái mùa.",
    "correct": "b",
    "explain": "Ethylene là hormone dạng khí, kích thích enzyme phân giải thành tế bào và tổng hợp đường/sắc tố, làm quả mềm, ngọt và đổi màu khi chín."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Trong cấu trúc của virus cúm, vai trò của gai Glycoprotein (Hemagglutinin và Neuraminidase) trên vỏ ngoài là gì?",
    "a": "Bảo vệ vật chất di truyền của virus khỏi các tác nhân oxy hóa.",
    "b": "Giúp virus nhận diện, bám vào và xâm nhập tế bào vật chủ đích.",
    "c": "Xúc tác cho quá trình sao chép ARN của virus bên trong tế bào.",
    "d": "Cung cấp năng lượng cho virus di chuyển trong dịch cơ thể người.",
    "correct": "b",
    "explain": "Hemagglutinin giúp virus bám vào thụ thể tế bào chủ để xâm nhập. Neuraminidase giúp virus con thoát ra khỏi tế bào sau khi nhân lên."
  },
  {
    "subject": "Sinh học",
    "difficulty": "boss-extreme",
    "content": "Tại sao các nhà khoa học lại quan tâm đến việc bảo tồn các giống cây trồng địa phương cổ truyền (giống bản địa)?",
    "a": "Vì chúng cho năng suất cao hơn nhiều so với các giống cao sản mới.",
    "b": "Vì chúng chứa nguồn gen quý về khả năng chống chịu sâu bệnh, hạn hán.",
    "c": "Vì chúng có thời gian sinh trưởng ngắn giúp tăng vụ trong năm canh tác.",
    "d": "Vì chúng có hình thức đẹp mắt phù hợp với nhu cầu xuất khẩu hàng hóa.",
    "correct": "b",
    "explain": "Giống bản địa tuy năng suất thấp nhưng đã thích nghi lâu dài với điều kiện khắc nghiệt, chứa các gen chống chịu quý giá để lai tạo giống mới."
  }
]