[
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một học sinh dùng thước có độ chia nhỏ nhất (ĐCNN) là 1mm để đo chiều dài một cuốn sách. Kết quả đo nào sau đây được ghi đúng quy tắc nhất?",
    "a": "24 cm",
    "b": "24,0 cm",
    "c": "24,00 cm",
    "d": "240 mm",
    "correct": "24,0 cm",
    "explain": "Kết quả đo phải được ghi theo ĐCNN của dụng cụ. ĐCNN là 1mm = 0,1cm. Do đó kết quả phải có một chữ số thập phân sau dấu phẩy (tương ứng với hàng phần mười của cm)."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Để đo thể tích của một hòn đá cuội có hình dạng bất kỳ và không thấm nước, người ta sử dụng bình chia độ và bình tràn. Bình chia độ ban đầu chứa 50cm³ nước. Sau khi thả hòn đá vào bình tràn (đã chứa đầy nước), lượng nước tràn ra chảy vào bình chia độ làm mực nước dâng lên đến vạch 85cm³. Thể tích của hòn đá là bao nhiêu?",
    "a": "85 cm³",
    "b": "35 cm³",
    "c": "50 cm³",
    "d": "135 cm³",
    "correct": "35 cm³",
    "explain": "Lượng nước tràn ra từ bình tràn chính là thể tích của hòn đá. Lượng nước này chảy vào bình chia độ. Thể tích nước tăng thêm trong bình chia độ là: 85 - 50 = 35 cm³."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một lò xo có chiều dài tự nhiên là 10cm. Khi treo một quả nặng 100g thì lò xo dài 12cm. Nếu treo thêm một quả nặng 50g nữa (tổng cộng 150g) vào lò xo đó thì chiều dài của lò xo lúc này là bao nhiêu? (Giả sử lò xo chưa bị hỏng).",
    "a": "13 cm",
    "b": "14 cm",
    "c": "15 cm",
    "d": "12,5 cm",
    "correct": "13 cm",
    "explain": "Độ dãn của lò xo tỉ lệ thuận với trọng lượng vật treo. 100g làm lò xo dãn 2cm (12-10). Vậy 50g sẽ làm lò xo dãn 1cm. Tổng độ dãn khi treo 150g là 3cm. Chiều dài lúc này: 10 + 3 = 13cm."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao lốp xe ô tô, xe máy, xe đạp thường phải khía rãnh (gai lốp)?",
    "a": "Để tăng diện tích tiếp xúc giúp xe đi nhanh hơn.",
    "b": "Để tăng ma sát lăn giúp xe tiết kiệm nhiên liệu.",
    "c": "Để tăng ma sát nghỉ giúp xe bám đường tốt hơn và thoát nước khi trời mưa.",
    "d": "Để giảm ma sát trượt giúp xe không bị mòn lốp.",
    "correct": "Để tăng ma sát nghỉ giúp xe bám đường tốt hơn và thoát nước khi trời mưa.",
    "explain": "Các rãnh giúp tăng độ bám (ma sát) giữa bánh xe và mặt đường, đặc biệt khi đường ướt, rãnh giúp thoát nước để tránh hiện tượng trượt nước."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một nhà du hành vũ trụ có khối lượng 70kg khi ở trên Trái Đất. Biết lực hút của Mặt Trăng chỉ bằng 1/6 lực hút của Trái Đất. Khi lên Mặt Trăng, khối lượng và trọng lượng của người đó thay đổi thế nào?",
    "a": "Khối lượng giảm 6 lần, trọng lượng giảm 6 lần.",
    "b": "Khối lượng không đổi (70kg), trọng lượng giảm 6 lần.",
    "c": "Khối lượng tăng 6 lần, trọng lượng không đổi.",
    "d": "Cả khối lượng và trọng lượng đều không đổi.",
    "correct": "Khối lượng không đổi (70kg), trọng lượng giảm 6 lần.",
    "explain": "Khối lượng là lượng chất chứa trong vật nên không đổi ở mọi vị trí. Trọng lượng là độ lớn lực hút, do lực hút Mặt Trăng yếu hơn nên trọng lượng giảm."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Khi nung nóng một vòng kim loại, bán kính trong và bán kính ngoài của vòng kim loại thay đổi như thế nào?",
    "a": "Bán kính ngoài tăng, bán kính trong giảm.",
    "b": "Cả hai bán kính đều giảm.",
    "c": "Cả hai bán kính đều tăng.",
    "d": "Bán kính ngoài giữ nguyên, bán kính trong tăng.",
    "correct": "Cả hai bán kính đều tăng.",
    "explain": "Sự nở vì nhiệt xảy ra theo mọi hướng. Chu vi của vòng kim loại tăng lên, kéo theo cả đường kính trong và đường kính ngoài đều tăng lên (lỗ rỗng bên trong cũng nở ra)."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Hai thỏi kim loại A và B có cùng khối lượng. Biết khối lượng riêng của A bằng 0,8 lần khối lượng riêng của B. Tỷ số thể tích của thỏi A so với thỏi B là bao nhiêu?",
    "a": "VA = 0,8 VB",
    "b": "VA = 1,25 VB",
    "c": "VA = VB",
    "d": "VA = 0,64 VB",
    "correct": "VA = 1,25 VB",
    "explain": "Ta có V = m/D. Vì m bằng nhau nên V tỉ lệ nghịch với D. DA = 0,8 DB => VA = (1/0,8) VB = 1,25 VB."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Trong các trường hợp sau, trường hợp nào lực ma sát đóng vai trò là lực có lợi và giúp vật chuyển động?",
    "a": "Lực ma sát giữa đĩa và xích xe đạp.",
    "b": "Lực ma sát giữa chân người và mặt đất khi đi bộ.",
    "c": "Lực ma sát giữa trục quạt và ổ bi.",
    "d": "Lực ma sát trượt khi kéo lê tủ gỗ trên sàn.",
    "correct": "Lực ma sát giữa chân người và mặt đất khi đi bộ.",
    "explain": "Khi đi bộ, chân đạp về phía sau, lực ma sát nghỉ giữa chân và đất hướng về phía trước giúp người tiến lên. Nếu không có ma sát này (như đi trên băng), ta sẽ bị trượt chân tại chỗ."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao đường đèo qua núi thường ngoằn ngoèo, uốn lượn chứ không làm thẳng dốc từ chân núi lên đỉnh núi?",
    "a": "Để tăng chiều dài quãng đường, giảm độ dốc, giúp xe lên núi cần ít lực kéo hơn.",
    "b": "Để giảm chiều dài quãng đường đi.",
    "c": "Để tăng ma sát giữa xe và mặt đường.",
    "d": "Để tránh gió mạnh trên núi.",
    "correct": "Để tăng chiều dài quãng đường, giảm độ dốc, giúp xe lên núi cần ít lực kéo hơn.",
    "explain": "Đây là ứng dụng của mặt phẳng nghiêng. Độ dốc càng nhỏ (quãng đường đi càng dài) thì lực cần thiết để nâng vật lên càng nhỏ."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một bình chia độ chứa nước ở vạch 60ml. Thả chìm hoàn toàn một quả cầu sắt vào thì mực nước dâng lên vạch 100ml. Biết khối lượng riêng của sắt là 7800 kg/m³. Khối lượng của quả cầu sắt là bao nhiêu?",
    "a": "312 g",
    "b": "31,2 g",
    "c": "780 g",
    "d": "468 g",
    "correct": "312 g",
    "explain": "Thể tích quả cầu: V = 100 - 60 = 40ml = 40 cm³. Khối lượng m = D.V = 7,8 g/cm³ * 40 cm³ = 312g. (Lưu ý đổi đơn vị D từ kg/m³ sang g/cm³: 7800 kg/m³ = 7,8 g/cm³)."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Khi nhiệt kế thủy ngân bị vỡ, người ta thường dùng bột lưu huỳnh rắc lên thủy ngân rơi vãi. Mục đích chính của việc này là gì?",
    "a": "Để thấm hút thủy ngân lỏng.",
    "b": "Để phản ứng hóa học với thủy ngân tạo thành hợp chất rắn khó bay hơi, tránh ngộ độc.",
    "c": "Để làm đông đặc thủy ngân ngay lập tức.",
    "d": "Để che phủ mùi hôi của thủy ngân.",
    "correct": "Để phản ứng hóa học với thủy ngân tạo thành hợp chất rắn khó bay hơi, tránh ngộ độc.",
    "explain": "Thủy ngân rất độc và dễ bay hơi. Lưu huỳnh phản ứng với thủy ngân tạo thành HgS dạng rắn, không bay hơi, giúp thu gom an toàn."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Băng kép (hai thanh kim loại khác nhau tán chặt vào nhau) hoạt động dựa trên hiện tượng vật lý nào?",
    "a": "Sự nóng chảy của kim loại.",
    "b": "Sự dãn nở vì nhiệt giống nhau của các chất rắn.",
    "c": "Sự dãn nở vì nhiệt khác nhau của các chất rắn khác nhau.",
    "d": "Sự dẫn nhiệt kém của kim loại.",
    "correct": "Sự dãn nở vì nhiệt khác nhau của các chất rắn khác nhau.",
    "explain": "Khi bị nung nóng, hai kim loại dãn nở khác nhau làm băng kép bị cong về phía thanh kim loại dãn nở ít hơn. Ứng dụng làm rơ-le nhiệt."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Trong hệ Mặt Trời, hành tinh nào có nhiệt độ bề mặt nóng nhất, dù không phải là hành tinh gần Mặt Trời nhất?",
    "a": "Sao Thủy.",
    "b": "Sao Kim.",
    "c": "Sao Hỏa.",
    "d": "Sao Mộc.",
    "correct": "Sao Kim.",
    "explain": "Sao Kim có bầu khí quyển rất dày chứa chủ yếu khí CO2 gây hiệu ứng nhà kính cực mạnh, giữ nhiệt làm nhiệt độ bề mặt cao hơn cả Sao Thủy."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một người đang đứng yên trên xe buýt đang chuyển động. Nếu xe buýt đột ngột phanh gấp, người đó sẽ bị ngã về phía nào và tại sao?",
    "a": "Ngã về phía sau do quán tính.",
    "b": "Ngã về phía trước do quán tính.",
    "c": "Ngã sang bên phải do lực ma sát.",
    "d": "Không bị ngã nếu đứng vững.",
    "correct": "Ngã về phía trước do quán tính.",
    "explain": "Khi xe phanh gấp, chân người dừng lại cùng xe do ma sát, nhưng phần thân trên vẫn tiếp tục chuyển động về phía trước theo quán tính nên người bị chúi về trước."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao các nước ở vùng hàn đới (rất lạnh) thường dùng nhiệt kế rượu thay vì nhiệt kế thủy ngân để đo nhiệt độ ngoài trời?",
    "a": "Vì rượu rẻ tiền hơn thủy ngân.",
    "b": "Vì rượu dãn nở vì nhiệt tốt hơn thủy ngân.",
    "c": "Vì nhiệt độ đông đặc của rượu thấp hơn nhiều so với thủy ngân.",
    "d": "Vì rượu có màu đỏ dễ nhìn hơn.",
    "correct": "Vì nhiệt độ đông đặc của rượu thấp hơn nhiều so với thủy ngân.",
    "explain": "Thủy ngân đông đặc ở khoảng -39°C, trong khi rượu đông đặc ở nhiệt độ thấp hơn nhiều (-114°C), nên đo được nhiệt độ môi trường cực lạnh mà thủy ngân đã bị đông cứng."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Thả một quả trứng tươi vào cốc nước lọc, trứng chìm. Làm thế nào để quả trứng nổi lên mặt nước mà không cần thay đổi quả trứng?",
    "a": "Đun nóng cốc nước.",
    "b": "Hòa tan thêm thật nhiều muối ăn vào nước.",
    "c": "Cho thêm nước lạnh vào cốc.",
    "d": "Khuấy mạnh nước trong cốc.",
    "correct": "Hòa tan thêm thật nhiều muối ăn vào nước.",
    "explain": "Trứng chìm do trọng lượng riêng của trứng lớn hơn nước lọc. Hòa tan muối làm tăng trọng lượng riêng của nước. Khi d_nước > d_trứng thì trứng sẽ nổi."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một vật nặng 2kg đặt trên mặt bàn nằm ngang. Vật chịu tác dụng của những lực nào và các lực đó có đặc điểm gì?",
    "a": "Chỉ chịu tác dụng của trọng lực 20N.",
    "b": "Chịu tác dụng của trọng lực và lực ma sát.",
    "c": "Chịu tác dụng của trọng lực hướng xuống và phản lực của bàn hướng lên, hai lực này cân bằng nhau.",
    "d": "Chịu tác dụng của trọng lực lớn hơn phản lực của bàn.",
    "correct": "Chịu tác dụng của trọng lực hướng xuống và phản lực của bàn hướng lên, hai lực này cân bằng nhau.",
    "explain": "Vật đứng yên nên chịu tác dụng của hai lực cân bằng: Trọng lực (P) và phản lực (N). P = N = 10.m = 20N."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao khi rót nước nóng vào cốc thủy tinh dày thì dễ vỡ hơn so với cốc thủy tinh mỏng?",
    "a": "Vì thủy tinh dày chịu lực kém hơn.",
    "b": "Vì sự dãn nở vì nhiệt ở lớp trong và lớp ngoài của cốc dày diễn ra không đều, gây ra lực làm nứt cốc.",
    "c": "Vì cốc mỏng tỏa nhiệt nhanh hơn.",
    "d": "Vì cốc dày chứa được nhiều nước nóng hơn.",
    "correct": "Vì sự dãn nở vì nhiệt ở lớp trong và lớp ngoài của cốc dày diễn ra không đều, gây ra lực làm nứt cốc.",
    "explain": "Thủy tinh dẫn nhiệt kém. Với cốc dày, lớp trong nóng lên nở ra nhanh chóng trong khi lớp ngoài chưa kịp nóng và nở ra, sự ngăn cản nở gây ra ứng suất làm vỡ cốc."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Biết 10 lít cát có khối lượng 15kg; 10 lít nước có khối lượng 10kg. Phát biểu nào sau đây đúng về khối lượng riêng?",
    "a": "Khối lượng riêng của cát nhỏ hơn của nước.",
    "b": "Khối lượng riêng của cát bằng 1,5 lần khối lượng riêng của nước.",
    "c": "Khối lượng riêng của nước lớn hơn của cát.",
    "d": "Không thể so sánh vì thể tích bằng nhau.",
    "correct": "Khối lượng riêng của cát bằng 1,5 lần khối lượng riêng của nước.",
    "explain": "Cùng thể tích V, tỉ lệ khối lượng chính là tỉ lệ khối lượng riêng. D_cát / D_nước = m_cát / m_nước = 15/10 = 1,5."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Để đưa một thùng phuy nặng 200kg từ mặt đất lên xe tải cao 1m, người ta dùng một tấm ván dài 4m làm mặt phẳng nghiêng. Bỏ qua ma sát, lực kéo vật lên là bao nhiêu?",
    "a": "2000 N",
    "b": "500 N",
    "c": "1000 N",
    "d": "200 N",
    "correct": "500 N",
    "explain": "Dùng mặt phẳng nghiêng thiệt về đường đi bao nhiêu lần thì lợi về lực bấy nhiêu lần. l/h = 4/1 = 4 lần. Vậy lực kéo giảm 4 lần so với trọng lượng. P = 2000N => F = 2000/4 = 500N."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Năng lượng hóa thạch (than đá, dầu mỏ) có nguồn gốc sâu xa từ đâu?",
    "a": "Nhiệt năng từ tâm Trái Đất.",
    "b": "Năng lượng hạt nhân.",
    "c": "Năng lượng Mặt Trời.",
    "d": "Năng lượng thủy triều.",
    "correct": "Năng lượng Mặt Trời.",
    "explain": "Than đá, dầu mỏ là xác thực vật/động vật cổ đại. Thực vật quang hợp nhờ ánh sáng Mặt Trời để lớn lên. Do đó nguồn gốc năng lượng là từ Mặt Trời."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Khi quan sát bầu trời đêm, ta thấy các ngôi sao dường như di chuyển từ Đông sang Tây. Nguyên nhân thực sự là gì?",
    "a": "Do các ngôi sao quay quanh Trái Đất từ Đông sang Tây.",
    "b": "Do Trái Đất tự quay quanh trục của nó từ Tây sang Đông.",
    "c": "Do Trái Đất quay quanh Mặt Trời.",
    "d": "Do gió trong vũ trụ thổi các ngôi sao đi.",
    "correct": "Do Trái Đất tự quay quanh trục của nó từ Tây sang Đông.",
    "explain": "Chuyển động của các vì sao là chuyển động nhìn thấy (biểu kiến), do Trái Đất tự quay theo chiều ngược lại (Tây sang Đông)."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao kéo cắt kim loại thường có tay cầm dài hơn lưỡi kéo, trong khi kéo cắt giấy lại có tay cầm ngắn hơn lưỡi kéo?",
    "a": "Để tiết kiệm vật liệu làm kéo.",
    "b": "Kéo cắt kim loại cần lực lớn nên tay cầm dài để tăng đòn bẩy (lợi về lực); kéo cắt giấy cần cắt nhanh nên lưỡi dài (lợi về đường đi).",
    "c": "Do thói quen thiết kế của nhà sản xuất.",
    "d": "Để kéo cắt kim loại trông mạnh mẽ hơn.",
    "correct": "Kéo cắt kim loại cần lực lớn nên tay cầm dài để tăng đòn bẩy (lợi về lực); kéo cắt giấy cần cắt nhanh nên lưỡi dài (lợi về đường đi).",
    "explain": "Áp dụng nguyên tắc đòn bẩy: Muốn lực cắt lớn (F2 lớn) thì cánh tay đòn lực tác dụng (d1 - tay cầm) phải lớn hơn cánh tay đòn vật cản (d2 - lưỡi kéo)."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Nước đá thường tan ở 0°C. Tuy nhiên, vào mùa đông ở các nước ôn đới, người ta thấy nước ở dưới đáy các hồ sâu vẫn ở trạng thái lỏng dù nhiệt độ không khí âm hàng chục độ. Tại sao?",
    "a": "Vì lớp băng trên mặt hồ cách nhiệt.",
    "b": "Vì nước có khối lượng riêng lớn nhất ở 4°C, nước 4°C chìm xuống đáy và được bảo vệ bởi lớp nước lạnh hơn (nhẹ hơn) và băng ở bên trên.",
    "c": "Vì dưới đáy hồ có núi lửa.",
    "d": "Cả A và B đều đúng.",
    "correct": "Cả A và B đều đúng.",
    "explain": "Đây là sự nở vì nhiệt đặc biệt của nước. Nước nặng nhất ở 4°C nên chìm xuống đáy. Lớp băng và nước lạnh <4°C nổi bên trên tạo lớp cách nhiệt bảo vệ."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Nếu dùng một ròng rọc động để nâng một vật nặng 50kg lên cao, bỏ qua ma sát và trọng lượng ròng rọc, thì lực kéo cần thiết ít nhất là bao nhiêu?",
    "a": "500 N",
    "b": "250 N",
    "c": "50 N",
    "d": "1000 N",
    "correct": "250 N",
    "explain": "Ròng rọc động giúp lợi 2 lần về lực. Trọng lượng vật P = 500N. Lực kéo F = P/2 = 250N."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Hiện tượng nhật thực toàn phần xảy ra khi nào và ở đâu?",
    "a": "Khi Trái Đất nằm giữa Mặt Trời và Mặt Trăng, quan sát được ở vùng bóng tối của Trái Đất.",
    "b": "Khi Mặt Trăng nằm giữa Mặt Trời và Trái Đất, quan sát được ở vùng bóng tối của Mặt Trăng in trên Trái Đất.",
    "c": "Khi Mặt Trời nằm giữa Trái Đất và Mặt Trăng.",
    "d": "Xảy ra vào ban đêm khi trăng tròn.",
    "correct": "Khi Mặt Trăng nằm giữa Mặt Trời và Trái Đất, quan sát được ở vùng bóng tối của Mặt Trăng in trên Trái Đất.",
    "explain": "Nhật thực xảy ra khi Mặt Trăng che khuất Mặt Trời. Vùng bóng tối (umbra) trên Trái Đất sẽ thấy nhật thực toàn phần."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một lò xo có chiều dài tự nhiên 20cm. Treo lò xo thẳng đứng, đầu dưới móc quả cân 50g thì lò xo dài 22cm. Hỏi nếu treo quả cân 150g thì lò xo dài bao nhiêu? (Trong giới hạn đàn hồi).",
    "a": "24 cm",
    "b": "25 cm",
    "c": "26 cm",
    "d": "30 cm",
    "correct": "26 cm",
    "explain": "50g làm lò xo dãn 2cm. Do độ dãn tỉ lệ với khối lượng treo nên 150g (gấp 3 lần 50g) sẽ làm dãn 2 x 3 = 6cm. Chiều dài l = 20 + 6 = 26cm."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao khi đun nước, ta không nên đổ nước thật đầy ấm?",
    "a": "Vì tốn nhiên liệu.",
    "b": "Vì nước nóng lên nở ra, thể tích tăng lên sẽ bị tràn ra ngoài gây nguy hiểm.",
    "c": "Vì nước sẽ lâu sôi hơn.",
    "d": "Vì ấm sẽ bị nứt.",
    "correct": "Vì nước nóng lên nở ra, thể tích tăng lên sẽ bị tràn ra ngoài gây nguy hiểm.",
    "explain": "Chất lỏng nở vì nhiệt nhiều hơn chất rắn (ấm). Khi đun sôi, thể tích nước tăng đáng kể so với thể tích ấm nên dễ bị tràn."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một khối gỗ hình lập phương cạnh 10cm có khối lượng 600g. Biết khối lượng riêng của nước là 1000 kg/m³. Khi thả khối gỗ vào nước, nó sẽ nổi hay chìm?",
    "a": "Chìm xuống đáy.",
    "b": "Lơ lửng trong nước.",
    "c": "Nổi trên mặt nước.",
    "d": "Không xác định được.",
    "correct": "Nổi trên mặt nước.",
    "explain": "Thể tích V = 1000 cm³. D_gỗ = 600g / 1000 cm³ = 0,6 g/cm³ = 600 kg/m³. Vì D_gỗ < D_nước (600 < 1000) nên gỗ nổi."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Trong quá trình dao động của con lắc đơn (quả nặng treo vào dây và đung đưa), năng lượng chuyển hóa như thế nào?",
    "a": "Chỉ có động năng, không có thế năng.",
    "b": "Động năng và thế năng hấp dẫn liên tục chuyển hóa qua lại lẫn nhau.",
    "c": "Năng lượng liên tục sinh ra thêm.",
    "d": "Thế năng luôn tăng, động năng luôn giảm.",
    "correct": "Động năng và thế năng hấp dẫn liên tục chuyển hóa qua lại lẫn nhau.",
    "explain": "Khi vật lên cao: Động năng -> Thế năng. Khi vật xuống thấp: Thế năng -> Động năng. Tổng cơ năng bảo toàn (nếu bỏ qua ma sát)."
  },
  
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao người ta không dùng nước để làm chất lỏng trong nhiệt kế đo nhiệt độ khí quyển ở các vùng hàn đới (rất lạnh)?",
    "a": "Vì nước có màu trong suốt khó nhìn.",
    "b": "Vì nước bay hơi nhanh.",
    "c": "Vì nước dãn nở vì nhiệt không đều (có sự nở bất thường từ 0°C đến 4°C) và đông đặc ở 0°C làm vỡ nhiệt kế.",
    "d": "Vì nước quá rẻ tiền.",
    "correct": "Vì nước dãn nở vì nhiệt không đều (có sự nở bất thường từ 0°C đến 4°C) và đông đặc ở 0°C làm vỡ nhiệt kế.",
    "explain": "Nước có tính chất kỳ lạ: từ 0°C đến 4°C nó co lại khi nóng lên. Ngoài ra, nước đóng băng ở 0°C nên không đo được nhiệt độ âm."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một chiếc tàu thủy đi từ cửa sông (nước ngọt) ra biển (nước mặn). Trạng thái nổi của tàu thay đổi như thế nào?",
    "a": "Tàu chìm xuống một chút.",
    "b": "Tàu nổi lên một chút.",
    "c": "Tàu giữ nguyên độ cao.",
    "d": "Tàu bị lật.",
    "correct": "Tàu nổi lên một chút.",
    "explain": "Trọng lượng riêng của nước biển lớn hơn nước sông. Để cân bằng với trọng lượng tàu (không đổi), thể tích phần chìm trong nước biển sẽ nhỏ hơn trong nước sông -> Tàu nổi lên."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao khi đun nước sôi, ta thấy sương mù (khói trắng) bay lên từ vòi ấm, nhưng ngay sát miệng vòi lại không nhìn thấy gì?",
    "a": "Vì sát miệng vòi không có hơi nước.",
    "b": "Vì sát miệng vòi hơi nước quá nóng nên chưa ngưng tụ; ra xa gặp không khí lạnh hơi nước mới ngưng tụ thành các hạt nước nhỏ li ti (sương mù).",
    "c": "Vì mắt ta bị lóa.",
    "d": "Vì sát miệng vòi hơi nước di chuyển quá nhanh.",
    "correct": "Vì sát miệng vòi hơi nước quá nóng nên chưa ngưng tụ; ra xa gặp không khí lạnh hơi nước mới ngưng tụ thành các hạt nước nhỏ li ti (sương mù).",
    "explain": "Hơi nước ở thể khí trong suốt không nhìn thấy được. Cái ta nhìn thấy là 'sương mù' do hơi nước ngưng tụ. Ngay tại vòi nhiệt độ cao nên nước vẫn ở thể hơi."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một người dùng hệ thống ròng rọc gồm 1 ròng rọc động và 1 ròng rọc cố định để nâng vật nặng 400N. Bỏ qua ma sát và trọng lượng ròng rọc, người đó phải kéo dây một đoạn bao nhiêu để vật lên cao 2m?",
    "a": "1m",
    "b": "2m",
    "c": "4m",
    "d": "8m",
    "correct": "4m",
    "explain": "Ròng rọc động lợi 2 lần về lực thì thiệt 2 lần về đường đi. Muốn vật lên 2m thì phải kéo dây một đoạn s = 2.h = 4m."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao vào những ngày trời nồm ẩm, sàn nhà lát gạch men thường bị 'đổ mồ hôi' (đọng nước)?",
    "a": "Do nước từ dưới đất thấm lên.",
    "b": "Do hơi nước trong không khí bão hòa tiếp xúc với mặt sàn lạnh nên bị ngưng tụ lại thành giọt lỏng.",
    "c": "Do sàn nhà tự tiết ra nước.",
    "d": "Do lau nhà chưa khô.",
    "correct": "Do hơi nước trong không khí bão hòa tiếp xúc với mặt sàn lạnh nên bị ngưng tụ lại thành giọt lỏng.",
    "explain": "Đây là hiện tượng ngưng tụ. Nhiệt độ mặt sàn thấp hơn nhiệt độ điểm sương của không khí ẩm khiến hơi nước chuyển sang thể lỏng."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Khi thả một cục nước đá vào cốc nước đầy, nước có tràn ra ngoài không? Sau khi đá tan hết, mực nước trong cốc thay đổi thế nào?",
    "a": "Nước tràn ra ngay; sau khi tan mực nước giảm xuống.",
    "b": "Nước tràn ra ngay; sau khi tan mực nước giữ nguyên (vẫn đầy miệng cốc).",
    "c": "Nước không tràn; sau khi tan mực nước tăng lên.",
    "d": "Nước tràn ra ngay; sau khi tan mực nước tăng thêm.",
    "correct": "Nước tràn ra ngay; sau khi tan mực nước giữ nguyên (vẫn đầy miệng cốc).",
    "explain": "Khi thả đá, nước tràn ra bằng thể tích phần chìm của đá (Lực đẩy Acsimet). Khi đá tan thành nước, thể tích nước tạo thành đúng bằng thể tích phần chìm ban đầu, nên mực nước không đổi."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Trong Hệ Mặt Trời, tại sao đuôi của sao chổi luôn hướng về phía ngược lại với Mặt Trời?",
    "a": "Do gió trên Trái Đất thổi.",
    "b": "Do lực hấp dẫn của các hành tinh khác hút đuôi nó.",
    "c": "Do áp suất ánh sáng và gió Mặt Trời (bức xạ hạt) thổi dạt vật chất của sao chổi ra phía sau.",
    "d": "Do sao chổi bay rất nhanh nên đuôi bị tạt lại sau.",
    "correct": "Do áp suất ánh sáng và gió Mặt Trời (bức xạ hạt) thổi dạt vật chất của sao chổi ra phía sau.",
    "explain": "Gió Mặt Trời là luồng hạt mang điện tích phóng ra từ Mặt Trời, thổi bụi khí của sao chổi bay về hướng đối diện."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Hai bình A và B giống hệt nhau, bình A chứa nước, bình B chứa rượu. Đun nóng cả hai bình đến cùng một nhiệt độ. Mực chất lỏng trong bình nào dâng cao hơn? (Biết rượu dãn nở vì nhiệt nhiều hơn nước).",
    "a": "Bình A (Nước).",
    "b": "Bình B (Rượu).",
    "c": "Bằng nhau.",
    "d": "Không xác định được.",
    "correct": "Bình B (Rượu).",
    "explain": "Các chất lỏng khác nhau dãn nở vì nhiệt khác nhau. Rượu nở nhiều hơn nước nên thể tích tăng nhiều hơn, mực chất lỏng dâng cao hơn."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Khi đi xe đạp xuống dốc, dù không đạp nhưng xe vẫn đi nhanh dần. Sự chuyển hóa năng lượng ở đây là gì?",
    "a": "Động năng chuyển hóa thành Thế năng.",
    "b": "Thế năng hấp dẫn chuyển hóa thành Động năng.",
    "c": "Nhiệt năng chuyển hóa thành Động năng.",
    "d": "Hóa năng chuyển hóa thành Cơ năng.",
    "correct": "Thế năng hấp dẫn chuyển hóa thành Động năng.",
    "explain": "Xe ở trên cao (Thế năng lớn) chuyển động xuống thấp (Thế năng giảm), phần thế năng giảm đó chuyển thành Động năng làm tăng tốc độ xe."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao đinh vít (ốc vít) lại có các rãnh xoắn ốc quanh thân?",
    "a": "Để làm đẹp.",
    "b": "Rãnh xoắn ốc hoạt động như một mặt phẳng nghiêng quấn quanh trụ, giúp vít đi vào vật liệu dễ dàng hơn và bám chắc hơn.",
    "c": "Để tăng ma sát trượt.",
    "d": "Để giảm khối lượng của đinh.",
    "correct": "Rãnh xoắn ốc hoạt động như một mặt phẳng nghiêng quấn quanh trụ, giúp vít đi vào vật liệu dễ dàng hơn và bám chắc hơn.",
    "explain": "Nguyên lý máy cơ đơn giản: Biến chuyển động quay thành chuyển động tịnh tiến với lực lớn hơn nhờ nguyên tắc mặt phẳng nghiêng."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một người nhìn thấy tia chớp trước rồi 3 giây sau mới nghe thấy tiếng sấm. Biết tốc độ âm thanh trong không khí khoảng 340 m/s. Khoảng cách từ người đó đến nơi xảy ra sét đánh là bao nhiêu?",
    "a": "340 m",
    "b": "1020 m",
    "c": "680 m",
    "d": "3 km",
    "correct": "1020 m",
    "explain": "Ánh sáng đi cực nhanh (coi như tức thời). Âm thanh đi chậm hơn. Khoảng cách = Vận tốc x Thời gian = 340 x 3 = 1020 m."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao khi luộc trứng ở trên đỉnh núi cao (nơi áp suất khí quyển thấp), trứng rất khó chín dù nước đã sôi sùng sục?",
    "a": "Vì gió trên núi làm nguội trứng.",
    "b": "Vì áp suất thấp làm nhiệt độ sôi của nước giảm xuống dưới 100°C, không đủ nhiệt để trứng chín nhanh.",
    "c": "Vì nước trên núi lạnh hơn.",
    "d": "Vì lửa trên núi cháy yếu hơn.",
    "correct": "Vì áp suất thấp làm nhiệt độ sôi của nước giảm xuống dưới 100°C, không đủ nhiệt để trứng chín nhanh.",
    "explain": "Nhiệt độ sôi phụ thuộc vào áp suất mặt thoáng. Áp suất giảm -> Nhiệt độ sôi giảm. Nước sôi ở 80-90°C thì không đủ nhiệt lượng làm chín protein trong trứng nhanh như ở đồng bằng."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Hai lực F1 = 30N và F2 = 40N cùng tác dụng lên một vật. Nếu hai lực này cùng phương nhưng ngược chiều, thì hợp lực tác dụng lên vật là bao nhiêu?",
    "a": "70 N",
    "b": "10 N",
    "c": "50 N",
    "d": "35 N",
    "correct": "10 N",
    "explain": "Hai lực ngược chiều thì hợp lực có độ lớn bằng hiệu hai lực: F = |F1 - F2| = |30 - 40| = 10N."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao các tấm pin mặt trời thường được lắp nghiêng về phía Nam (ở Bắc bán cầu) hoặc phía Bắc (ở Nam bán cầu)?",
    "a": "Để tránh mưa đọng.",
    "b": "Để đón được lượng ánh sáng mặt trời vuông góc nhiều nhất trong ngày.",
    "c": "Để làm mát tấm pin.",
    "d": "Để tránh bụi bẩn.",
    "correct": "Để đón được lượng ánh sáng mặt trời vuông góc nhiều nhất trong ngày.",
    "explain": "Để tối ưu hiệu suất, tấm pin cần hứng nắng trực tiếp. Do vị trí Mặt Trời di chuyển trên bầu trời lệch về đường xích đạo, nên cần lắp nghiêng để đón nắng."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Khi trộn 50cm³ rượu vào 50cm³ nước, thể tích hỗn hợp thu được sẽ là bao nhiêu?",
    "a": "Đúng bằng 100 cm³.",
    "b": "Lớn hơn 100 cm³.",
    "c": "Nhỏ hơn 100 cm³ (khoảng 95-97 cm³).",
    "d": "Bằng 50 cm³.",
    "correct": "Nhỏ hơn 100 cm³ (khoảng 95-97 cm³).",
    "explain": "Giữa các phân tử có khoảng cách. Khi trộn lẫn, các phân tử rượu xen vào khoảng cách giữa các phân tử nước và ngược lại, làm thể tích tổng bị co lại."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Càng lên cao không khí càng loãng (khối lượng riêng giảm). Vậy áp suất khí quyển thay đổi thế nào theo độ cao?",
    "a": "Càng lên cao áp suất khí quyển càng tăng.",
    "b": "Càng lên cao áp suất khí quyển càng giảm.",
    "c": "Áp suất khí quyển không đổi theo độ cao.",
    "d": "Áp suất tăng rồi giảm.",
    "correct": "Càng lên cao áp suất khí quyển càng giảm.",
    "explain": "Áp suất khí quyển do trọng lượng của cột không khí gây ra. Lên cao, cột không khí bên trên ngắn đi và loãng hơn nên áp suất giảm mạnh."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao quai ấm đun nước thường bọc nhựa hoặc gỗ, trong khi thân ấm làm bằng nhôm hoặc inox?",
    "a": "Nhôm dẫn nhiệt tốt để đun nhanh, nhựa/gỗ dẫn nhiệt kém (cách nhiệt) để cầm không bị bỏng.",
    "b": "Nhôm rẻ tiền, nhựa đắt tiền.",
    "c": "Để trang trí cho đẹp.",
    "d": "Nhựa bền hơn nhôm.",
    "correct": "Nhôm dẫn nhiệt tốt để đun nhanh, nhựa/gỗ dẫn nhiệt kém (cách nhiệt) để cầm không bị bỏng.",
    "explain": "Ứng dụng tính chất dẫn nhiệt và cách nhiệt của các vật liệu khác nhau trong đời sống."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một vật hình hộp chữ nhật đặc có kích thước 2cm x 5cm x 10cm, khối lượng 270g. Tính khối lượng riêng của vật liệu làm hộp?",
    "a": "2,7 g/cm³",
    "b": "2700 kg/m³",
    "c": "Cả A và B đều đúng.",
    "d": "27 g/cm³",
    "correct": "Cả A và B đều đúng.",
    "explain": "Thể tích V = 2x5x10 = 100 cm³. D = m/V = 270/100 = 2,7 g/cm³. Đổi đơn vị: 2,7 g/cm³ = 2700 kg/m³ (Nhôm)."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao khi nhảy từ trên cao xuống, người ta phải gập gối khi chân chạm đất?",
    "a": "Để tạo dáng đẹp.",
    "b": "Để tăng thời gian va chạm, giúp giảm lực tác động lên chân và cột sống, tránh chấn thương.",
    "c": "Để tăng ma sát với mặt đất.",
    "d": "Để giảm khối lượng cơ thể.",
    "correct": "Để tăng thời gian va chạm, giúp giảm lực tác động lên chân và cột sống, tránh chấn thương.",
    "explain": "Gập gối giúp kéo dài thời gian giảm tốc độ từ v xuống 0. Theo định luật xung lượng, thời gian tương tác càng dài thì lực tác dụng càng nhỏ."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Mặt Trăng luôn hướng một mặt về phía Trái Đất. Điều này chứng tỏ điều gì về chuyển động của Mặt Trăng?",
    "a": "Mặt Trăng không tự quay quanh trục của nó.",
    "b": "Thời gian Mặt Trăng tự quay quanh trục đúng bằng thời gian nó quay quanh Trái Đất (Khóa thủy triều).",
    "c": "Mặt Trăng quay quanh trục cực nhanh.",
    "d": "Trái Đất đứng yên.",
    "correct": "Thời gian Mặt Trăng tự quay quanh trục đúng bằng thời gian nó quay quanh Trái Đất (Khóa thủy triều).",
    "explain": "Hiện tượng khóa thủy triều khiến chu kỳ tự quay và chu kỳ quỹ đạo trùng khớp (khoảng 27,3 ngày), nên ta chỉ thấy 1 mặt."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một đòn bẩy có điểm tựa O. Treo vật nặng m1 = 2kg cách O một đoạn d1 = 10cm. Muốn đòn bẩy thăng bằng, phải treo vật nặng m2 = 1kg ở vị trí cách O bao xa (d2)?",
    "a": "5 cm",
    "b": "10 cm",
    "c": "20 cm",
    "d": "15 cm",
    "correct": "20 cm",
    "explain": "Quy tắc đòn bẩy: m1.d1 = m2.d2. => 2kg * 10cm = 1kg * d2 => d2 = 20cm."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao trong tủ lạnh, ngăn đá thường được bố trí ở phía trên cùng?",
    "a": "Để dễ lấy đá.",
    "b": "Để không khí lạnh (nặng hơn) chìm xuống dưới làm mát toàn bộ tủ, dòng đối lưu không khí nóng bốc lên trên gặp ngăn đá lại được làm lạnh.",
    "c": "Vì máy nén khí nằm ở trên.",
    "d": "Để tránh trẻ em nghịch.",
    "correct": "Để không khí lạnh (nặng hơn) chìm xuống dưới làm mát toàn bộ tủ, dòng đối lưu không khí nóng bốc lên trên gặp ngăn đá lại được làm lạnh.",
    "explain": "Sự đối lưu không khí: Khí lạnh có khối lượng riêng lớn hơn nên chìm xuống, khí nóng nhẹ hơn bay lên. Đặt ngăn đá ở trên giúp làm lạnh đều tự nhiên."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một vật được móc vào lực kế, khi treo ngoài không khí lực kế chỉ 5N. Khi nhúng chìm hoàn toàn vật vào nước, lực kế chỉ 3N. Lực đẩy Ác-si-mét tác dụng lên vật là bao nhiêu?",
    "a": "2 N",
    "b": "3 N",
    "c": "5 N",
    "d": "8 N",
    "correct": "2 N",
    "explain": "Lực đẩy Ác-si-mét bằng độ giảm trọng lượng của vật khi nhúng trong chất lỏng: FA = P_kk - P_nuoc = 5 - 3 = 2N."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao Mặt Trời là nguồn năng lượng sơ cấp cho hầu hết các hoạt động trên Trái Đất, nhưng lại KHÔNG phải là nguồn gốc của Năng lượng Địa nhiệt?",
    "a": "Vì năng lượng địa nhiệt đến từ gió.",
    "b": "Vì năng lượng địa nhiệt xuất phát từ sự phân rã phóng xạ và nhiệt dư thừa trong lòng Trái Đất từ thuở sơ khai.",
    "c": "Vì năng lượng địa nhiệt đến từ Mặt Trăng.",
    "d": "Vì Mặt Trời không chiếu sáng vào ban đêm.",
    "correct": "Vì năng lượng địa nhiệt xuất phát từ sự phân rã phóng xạ và nhiệt dư thừa trong lòng Trái Đất từ thuở sơ khai.",
    "explain": "Năng lượng gió, nước, hóa thạch, sinh khối đều gián tiếp từ Mặt Trời. Riêng địa nhiệt và hạt nhân có nguồn gốc từ bản thân Trái Đất."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Khi nén khí trong một xilanh kín, nhiệt độ của khí tăng lên. Nguyên nhân là gì?",
    "a": "Do ma sát giữa pít-tông và xilanh.",
    "b": "Do công của lực nén đã chuyển hóa thành nhiệt năng (nội năng) của khí.",
    "c": "Do khí lấy nhiệt từ bên ngoài.",
    "d": "Do khối lượng khí tăng lên.",
    "correct": "Do công của lực nén đã chuyển hóa thành nhiệt năng (nội năng) của khí.",
    "explain": "Thực hiện công lên chất khí (nén) làm các phân tử khí chuyển động nhanh hơn, va chạm mạnh hơn -> Nhiệt độ tăng (Nguyên lý 1 nhiệt động lực học sơ cấp)."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Có hai thanh nam châm giống hệt nhau. Làm thế nào để xác định cực Bắc/Nam nếu các kí hiệu cực đã bị mờ?",
    "a": "Treo dây mảnh vào giữa thanh nam châm để nó tự xoay.",
    "b": "Thả vào nước.",
    "c": "Nung nóng.",
    "d": "Cắt đôi thanh nam châm.",
    "correct": "Treo dây mảnh vào giữa thanh nam châm để nó tự xoay.",
    "explain": "Dưới tác dụng của từ trường Trái Đất, thanh nam châm tự do sẽ luôn định hướng Bắc - Nam. Đầu chỉ hướng Bắc là cực Bắc."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Để xe đạp chuyển động thẳng đều trên đường nằm ngang, người đạp xe cần tác dụng một lực như thế nào?",
    "a": "Lớn hơn lực ma sát cản trở chuyển động.",
    "b": "Nhỏ hơn lực ma sát.",
    "c": "Bằng với lực ma sát và lực cản không khí (hai lực cân bằng).",
    "d": "Không cần tác dụng lực.",
    "correct": "Bằng với lực ma sát và lực cản không khí (hai lực cân bằng).",
    "explain": "Theo định luật quán tính, vật chuyển động thẳng đều khi các lực tác dụng lên nó cân bằng nhau. Lực đạp cân bằng với lực cản."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao 'Sao băng' (Meteor) lại phát sáng khi bay vào bầu khí quyển Trái Đất?",
    "a": "Vì nó mang điện tích.",
    "b": "Vì ma sát cực lớn giữa thiên thạch và các phân tử khí trong khí quyển nén không khí phía trước làm nhiệt độ tăng cao, đốt cháy thiên thạch.",
    "c": "Vì nó phản chiếu ánh sáng Mặt Trời.",
    "d": "Vì nó là một ngôi sao đang cháy.",
    "correct": "Vì ma sát cực lớn giữa thiên thạch và các phân tử khí trong khí quyển nén không khí phía trước làm nhiệt độ tăng cao, đốt cháy thiên thạch.",
    "explain": "Động năng cực lớn của thiên thạch chuyển hóa thành nhiệt năng do lực cản khí quyển (sóng xung kích nén khí), làm nó nóng sáng và bốc hơi."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một lò xo xoắn dài 20cm khi treo vật 1kg và dài 18cm khi không treo gì. Độ cứng của lò xo (hệ số đàn hồi) được thể hiện qua độ dãn. Nếu treo vật 2kg thì lò xo dài bao nhiêu?",
    "a": "22 cm",
    "b": "24 cm",
    "c": "21 cm",
    "d": "20 cm",
    "correct": "22 cm",
    "explain": "Độ dãn khi treo 1kg là: 20 - 18 = 2cm. Treo 2kg (gấp đôi) thì độ dãn gấp đôi là 4cm. Chiều dài mới: 18 + 4 = 22cm."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao các bồn chứa xăng dầu thường được sơn màu sáng (trắng hoặc bạc) mà không sơn màu đen?",
    "a": "Để dễ nhìn thấy.",
    "b": "Màu sáng hấp thụ nhiệt từ ánh sáng mặt trời ít hơn màu đen, giúp giữ nhiệt độ bên trong thấp, giảm bay hơi và nguy cơ cháy nổ.",
    "c": "Màu sáng rẻ hơn.",
    "d": "Màu sáng chống gỉ tốt hơn.",
    "correct": "Màu sáng hấp thụ nhiệt từ ánh sáng mặt trời ít hơn màu đen, giúp giữ nhiệt độ bên trong thấp, giảm bay hơi và nguy cơ cháy nổ.",
    "explain": "Vật màu tối hấp thụ bức xạ nhiệt tốt hơn vật màu sáng. Sơn màu sáng giúp phản xạ ánh nắng, giữ xăng dầu mát hơn."
  },
  
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao nồi áp suất (Pressure Cooker) lại ninh nhừ thức ăn nhanh hơn nồi thường?",
    "a": "Vì nồi dày hơn giữ nhiệt tốt hơn.",
    "b": "Vì nắp nồi đậy kín ngăn hơi nước thoát ra, làm tăng áp suất trong nồi, dẫn đến nhiệt độ sôi của nước tăng lên trên 100°C (khoảng 120°C).",
    "c": "Vì áp suất cao làm thức ăn mềm ra cơ học.",
    "d": "Vì nồi áp suất dùng lửa to hơn.",
    "correct": "Vì nắp nồi đậy kín ngăn hơi nước thoát ra, làm tăng áp suất trong nồi, dẫn đến nhiệt độ sôi của nước tăng lên trên 100°C (khoảng 120°C).",
    "explain": "Nhiệt độ sôi tỉ lệ thuận với áp suất. Áp suất cao giúp nước sôi ở nhiệt độ cao hơn, cung cấp nhiều nhiệt lượng hơn để làm chín thức ăn nhanh chóng."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một người cân nặng 50kg đứng trên sàn nhà bằng cả hai chân. Biết diện tích tiếp xúc của mỗi bàn chân với sàn là 125cm². Áp suất người đó tác dụng lên sàn là bao nhiêu?",
    "a": "2000 Pa",
    "b": "20.000 N/m² (Pa)",
    "c": "4000 Pa",
    "d": "400 N/m²",
    "correct": "20.000 N/m² (Pa)",
    "explain": "Áp lực F = P = 500N. Diện tích S = 2 x 125 = 250 cm² = 0,025 m². Áp suất p = F/S = 500 / 0,025 = 20.000 Pa."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao về mùa đông, sờ tay vào thanh kim loại thấy lạnh hơn sờ vào thanh gỗ, dù nhiệt độ thực tế của chúng bằng nhau?",
    "a": "Vì kim loại có nhiệt độ thấp hơn gỗ.",
    "b": "Vì kim loại dẫn nhiệt tốt, truyền nhiệt từ tay ta ra ngoài nhanh làm tay mất nhiệt (cảm giác lạnh). Gỗ dẫn nhiệt kém nên tay mất nhiệt chậm.",
    "c": "Vì kim loại giữ lạnh tốt.",
    "d": "Vì tay ta nhạy cảm với kim loại.",
    "correct": "Vì kim loại dẫn nhiệt tốt, truyền nhiệt từ tay ta ra ngoài nhanh làm tay mất nhiệt (cảm giác lạnh). Gỗ dẫn nhiệt kém nên tay mất nhiệt chậm.",
    "explain": "Cảm giác nóng lạnh của tay phụ thuộc vào tốc độ mất nhiệt. Kim loại là chất dẫn nhiệt tốt nên lấy nhiệt từ tay rất nhanh."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Khi quan sát một ngôi sao, ta thấy nó 'nhấp nháy'. Nguyên nhân chính là gì?",
    "a": "Do ngôi sao tự tắt bật ánh sáng.",
    "b": "Do có vật thể bay qua che khuất.",
    "c": "Do sự khúc xạ ánh sáng qua các lớp không khí chuyển động không ngừng và có mật độ khác nhau trong khí quyển Trái Đất.",
    "d": "Do mắt người chớp liên tục.",
    "correct": "Do sự khúc xạ ánh sáng qua các lớp không khí chuyển động không ngừng và có mật độ khác nhau trong khí quyển Trái Đất.",
    "explain": "Khí quyển không đồng nhất và luôn chuyển động làm đường đi của tia sáng bị bẻ cong liên tục, gây ra hiện tượng nhấp nháy (Twinkling)."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một vật đặc có trọng lượng 10N ở ngoài không khí. Khi nhúng chìm hoàn toàn trong nước, lực kế chỉ 6N. Thể tích của vật là bao nhiêu? (Lấy d_nước = 10.000 N/m³).",
    "a": "400 cm³",
    "b": "600 cm³",
    "c": "1000 cm³",
    "d": "40 cm³",
    "correct": "400 cm³",
    "explain": "Lực đẩy Ác-si-mét FA = 10 - 6 = 4N. Mà FA = d.V => V = FA/d = 4/10.000 = 0,0004 m³ = 400 cm³."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao lốp xe đạp bơm căng để ngoài nắng dễ bị nổ?",
    "a": "Do cao su bị nóng chảy.",
    "b": "Do không khí bên trong lốp nóng lên, nở ra và tăng áp suất mạnh, vượt quá giới hạn chịu đựng của lốp.",
    "c": "Do vành xe dãn nở làm rách lốp.",
    "d": "Do tia cực tím phá hủy lốp.",
    "correct": "Do không khí bên trong lốp nóng lên, nở ra và tăng áp suất mạnh, vượt quá giới hạn chịu đựng của lốp.",
    "explain": "Chất khí nở vì nhiệt rất nhiều. Trong không gian kín (lốp), khí nóng làm tăng áp suất lên thành lốp gây nổ."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Thế năng hấp dẫn của một vật bằng 0 khi nào?",
    "a": "Khi vật đứng yên.",
    "b": "Khi vật nằm trên mặt đất (nếu chọn mặt đất làm mốc tính thế năng).",
    "c": "Khi vật chuyển động nhanh nhất.",
    "d": "Khi vật ở độ cao lớn nhất.",
    "correct": "Khi vật nằm trên mặt đất (nếu chọn mặt đất làm mốc tính thế năng).",
    "explain": "Thế năng phụ thuộc vào mốc chọn. Thường chọn mặt đất là mốc (h=0), khi đó vật nằm tại mốc thì thế năng bằng 0."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Để bẩy một tảng đá nặng 1000N lên, người ta dùng một đòn bẩy dài. Biết khoảng cách từ điểm tựa đến tảng đá (cánh tay đòn của vật) là 20cm, từ điểm tựa đến tay người (cánh tay đòn của lực) là 100cm. Lực tối thiểu cần tác dụng là bao nhiêu?",
    "a": "2000 N",
    "b": "500 N",
    "c": "200 N",
    "d": "100 N",
    "correct": "200 N",
    "explain": "Quy tắc đòn bẩy: F1.d1 = F2.d2 => 1000 . 20 = F2 . 100 => F2 = (20000)/100 = 200N. Lợi 5 lần về lực."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao nước biển mặn lại khó đóng băng hơn nước ngọt?",
    "a": "Vì nước biển chuyển động liên tục.",
    "b": "Vì muối hòa tan làm hạ thấp nhiệt độ đông đặc của nước (xuống dưới 0°C).",
    "c": "Vì nước biển có nhiều sinh vật sống tạo nhiệt.",
    "d": "Vì nước biển hấp thụ nhiệt tốt hơn.",
    "correct": "Vì muối hòa tan làm hạ thấp nhiệt độ đông đặc của nước (xuống dưới 0°C).",
    "explain": "Các tạp chất hòa tan (như muối) cản trở quá trình sắp xếp tinh thể băng, làm giảm điểm đóng băng. Nước biển đóng băng ở khoảng -1,8°C."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Trong các cách sắp xếp các chất dẫn nhiệt từ tốt đến kém sau đây, cách nào đúng?",
    "a": "Đồng > Thủy tinh > Nước > Không khí.",
    "b": "Thủy tinh > Đồng > Nước > Không khí.",
    "c": "Đồng > Nước > Thủy tinh > Không khí.",
    "d": "Không khí > Nước > Thủy tinh > Đồng.",
    "correct": "Đồng > Thủy tinh > Nước > Không khí.",
    "explain": "Kim loại (Đồng) dẫn nhiệt tốt nhất, chất rắn phi kim (thủy tinh) kém hơn, chất lỏng (nước) kém hơn nữa, và chất khí (không khí) dẫn nhiệt kém nhất (cách nhiệt)."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Khi một quả bóng rơi từ trên cao xuống đất và nảy lên, cơ năng của nó đã biến đổi như thế nào (xét thực tế có ma sát với không khí và va chạm không đàn hồi tuyệt đối)?",
    "a": "Cơ năng bảo toàn tuyệt đối.",
    "b": "Cơ năng tăng dần.",
    "c": "Một phần cơ năng chuyển hóa thành nhiệt năng (làm nóng bóng, không khí, mặt đất) và năng lượng âm thanh, nên độ cao nảy lên giảm dần.",
    "d": "Động năng chuyển hết thành thế năng.",
    "correct": "Một phần cơ năng chuyển hóa thành nhiệt năng (làm nóng bóng, không khí, mặt đất) và năng lượng âm thanh, nên độ cao nảy lên giảm dần.",
    "explain": "Trong thực tế, cơ năng không bảo toàn do ma sát và va chạm mềm, năng lượng hao phí biến thành nhiệt và âm thanh."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Biết trọng lượng riêng của nước là 10.000 N/m³, của xăng là 7.000 N/m³. Tại sao dùng nước dập đám cháy xăng lại làm đám cháy lan rộng?",
    "a": "Vì nước cung cấp oxi cho sự cháy.",
    "b": "Vì xăng nhẹ hơn nước (d_xăng < d_nước), xăng sẽ nổi lên trên mặt nước và tiếp tục cháy lan theo dòng nước chảy.",
    "c": "Vì nước phản ứng với xăng gây nổ.",
    "d": "Vì nước nóng lên biến thành hơi.",
    "correct": "Vì xăng nhẹ hơn nước (d_xăng < d_nước), xăng sẽ nổi lên trên mặt nước và tiếp tục cháy lan theo dòng nước chảy.",
    "explain": "Chữa cháy xăng dầu phải dùng cát hoặc bọt khí CO2 để ngăn cách với Oxi, không dùng nước vì nước làm xăng loang ra."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao Mặt Trăng lại gây ra hiện tượng Thủy triều trên Trái Đất mạnh hơn Mặt Trời, dù Mặt Trời lớn hơn Mặt Trăng rất nhiều?",
    "a": "Vì Mặt Trăng lạnh hơn.",
    "b": "Vì Mặt Trăng ở gần Trái Đất hơn rất nhiều so với Mặt Trời, nên lực hấp dẫn (gây triều) tác động lên đại dương mạnh hơn.",
    "c": "Vì Mặt Trăng quay nhanh hơn.",
    "d": "Vì Mặt Trăng phản chiếu ánh sáng.",
    "correct": "Vì Mặt Trăng ở gần Trái Đất hơn rất nhiều so với Mặt Trời, nên lực hấp dẫn (gây triều) tác động lên đại dương mạnh hơn.",
    "explain": "Lực hấp dẫn tỉ lệ nghịch với bình phương khoảng cách. Dù Mặt Trời khối lượng lớn nhưng quá xa, trong khi Mặt Trăng rất gần nên ảnh hưởng thủy triều chủ yếu là do Mặt Trăng."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một người thợ xây dùng ròng rọc động để nâng bao xi măng 50kg lên cao. Mặc dù lợi về lực, nhưng thực tế người đó phải tốn công nhiều hơn so với nâng trực tiếp. Tại sao?",
    "a": "Vì ma sát ở trục ròng rọc và trọng lượng của ròng rọc động cũng cần năng lượng để nâng lên (Công hao phí).",
    "b": "Vì dây quá dài.",
    "c": "Vì ròng rọc làm đổi hướng lực.",
    "d": "Vì người đó kéo quá nhanh.",
    "correct": "Vì ma sát ở trục ròng rọc và trọng lượng của ròng rọc động cũng cần năng lượng để nâng lên (Công hao phí).",
    "explain": "Hiệu suất của máy cơ luôn < 100%. Công toàn phần bỏ ra bao giờ cũng lớn hơn công có ích vì phải thắng ma sát và nâng cả ròng rọc."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao các ngôi sao có màu sắc khác nhau (Xanh, Trắng, Vàng, Đỏ)?",
    "a": "Do khoảng cách xa gần khác nhau.",
    "b": "Do nhiệt độ bề mặt khác nhau. (Sao xanh/trắng nóng nhất, sao đỏ lạnh nhất).",
    "c": "Do kích thước khác nhau.",
    "d": "Do bầu khí quyển Trái Đất đổi màu chúng.",
    "correct": "Do nhiệt độ bề mặt khác nhau. (Sao xanh/trắng nóng nhất, sao đỏ lạnh nhất).",
    "explain": "Màu sắc của vật phát sáng phụ thuộc vào nhiệt độ (Định luật Wien). Mặt Trời màu vàng là sao có nhiệt độ trung bình."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Khi xe ô tô bị sa lầy trong bùn, bánh xe quay tít nhưng xe không tiến lên được. Nguyên nhân là gì và cần làm gì?",
    "a": "Do lực ma sát quá lớn. Cần đổ nước vào.",
    "b": "Do lực ma sát nghỉ giữa bánh xe và bùn quá nhỏ (bánh trượt). Cần chèn thêm gỗ/đá/vải vào bánh để tăng ma sát.",
    "c": "Do xe quá nặng. Cần bỏ bớt hàng.",
    "d": "Do động cơ yếu. Cần ga mạnh hơn.",
    "correct": "Do lực ma sát nghỉ giữa bánh xe và bùn quá nhỏ (bánh trượt). Cần chèn thêm gỗ/đá/vải vào bánh để tăng ma sát.",
    "explain": "Để xe tiến lên cần lực ma sát nghỉ đóng vai trò lực phát động. Bùn trơn làm giảm ma sát này. Tăng độ nhám (chèn gỗ) giúp tăng ma sát để xe bám đường."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một bình thủy tinh được đậy kín nắp thủy tinh. Nếu nắp bị kẹt chặt, làm cách nào để mở dễ nhất?",
    "a": "Hơ nóng cổ bình.",
    "b": "Hơ nóng nắp bình.",
    "c": "Ngâm cả bình vào nước nóng.",
    "d": "Ngâm cả bình vào nước lạnh.",
    "correct": "Hơ nóng cổ bình.",
    "explain": "Hơ nóng cổ bình làm cổ bình nở ra trước (rộng ra), tách khỏi nắp bình (vẫn còn lạnh/nở chậm hơn), giúp mở dễ dàng."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao không khí trong các phòng lạnh (điều hòa) thường khô hơn bình thường?",
    "a": "Vì máy lạnh hút hết không khí.",
    "b": "Vì hơi nước trong không khí khi đi qua dàn lạnh của máy điều hòa bị ngưng tụ lại thành nước lỏng và thải ra ngoài theo ống thoát nước.",
    "c": "Vì máy lạnh bơm khí khô vào.",
    "d": "Vì cửa phòng đóng kín.",
    "correct": "Vì hơi nước trong không khí khi đi qua dàn lạnh của máy điều hòa bị ngưng tụ lại thành nước lỏng và thải ra ngoài theo ống thoát nước.",
    "explain": "Nguyên lý làm lạnh làm giảm nhiệt độ không khí xuống dưới điểm sương, tách nước ra khỏi không khí, làm độ ẩm giảm."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Ba thanh kim loại: Đồng, Nhôm, Sắt có cùng chiều dài ban đầu. Khi tăng thêm 50°C, thanh nào dài nhất? (Biết Nhôm nở nhiều nhất, rồi đến Đồng, rồi đến Sắt).",
    "a": "Sắt.",
    "b": "Đồng.",
    "c": "Nhôm.",
    "d": "Bằng nhau.",
    "correct": "Nhôm.",
    "explain": "Cùng độ tăng nhiệt độ và chiều dài ban đầu, chất nào có hệ số nở dài lớn hơn (Nhôm) sẽ dãn ra nhiều hơn."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao các đám mây không rơi xuống đất dù chúng chứa hàng tấn nước?",
    "a": "Vì chúng nhẹ hơn không khí.",
    "b": "Vì các hạt nước/băng trong mây cực nhỏ, lực cản của không khí và các dòng đối lưu từ dưới lên đủ lớn để giữ chúng lơ lửng.",
    "c": "Vì Trái Đất đẩy chúng lên.",
    "d": "Vì chúng là khí.",
    "correct": "Vì các hạt nước/băng trong mây cực nhỏ, lực cản của không khí và các dòng đối lưu từ dưới lên đủ lớn để giữ chúng lơ lửng.",
    "explain": "Mây không phải hơi nước (khí) mà là hạt lỏng/rắn (nặng hơn không khí). Chúng lơ lửng nhờ kích thước micro và dòng khí thăng."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một lò xo chịu tác dụng của lực kéo 5N thì dãn ra 2cm. Nếu treo vật có trọng lượng 12,5N thì lò xo dãn ra bao nhiêu? (Trong giới hạn đàn hồi).",
    "a": "4 cm",
    "b": "5 cm",
    "c": "6 cm",
    "d": "10 cm",
    "correct": "5 cm",
    "explain": "Độ dãn tỉ lệ với lực: F1/l1 = F2/l2 => 5/2 = 12,5/l2 => l2 = (12,5 * 2) / 5 = 5cm."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Năng lượng gió gián tiếp bắt nguồn từ Mặt Trời như thế nào?",
    "a": "Mặt Trời hút gió.",
    "b": "Mặt Trời làm nóng bề mặt Trái Đất không đều, tạo ra sự chênh lệch áp suất không khí, khiến không khí chuyển động từ nơi áp cao về nơi áp thấp tạo thành gió.",
    "c": "Mặt Trời chiếu sáng làm gió thấy đường đi.",
    "d": "Mặt Trời quay tạo ra gió.",
    "correct": "Mặt Trời làm nóng bề mặt Trái Đất không đều, tạo ra sự chênh lệch áp suất không khí, khiến không khí chuyển động từ nơi áp cao về nơi áp thấp tạo thành gió.",
    "explain": "Gió là kết quả của sự đốt nóng không đều của Mặt Trời lên khí quyển (xích đạo nóng hơn cực, đất liền nóng/nguội nhanh hơn biển)."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Để làm nguội một cốc nước nóng nhanh nhất, ta nên đặt viên đá lạnh ở đâu?",
    "a": "Đặt viên đá bên cạnh cốc.",
    "b": "Thả viên đá nổi trên mặt nước.",
    "c": "Buộc viên đá chìm xuống đáy cốc.",
    "d": "Đặt viên đá dưới đáy cốc (bên ngoài).",
    "correct": "Thả viên đá nổi trên mặt nước.",
    "explain": "Nước lạnh (nặng hơn) chìm xuống, nước nóng (nhẹ hơn) nổi lên. Thả đá trên mặt tạo dòng đối lưu tự nhiên làm lạnh toàn bộ cốc nhanh nhất."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Khi cọ xát hai thanh kim loại vào nhau, chúng nóng lên. Ở đây đã có sự chuyển hóa năng lượng nào?",
    "a": "Nhiệt năng thành Cơ năng.",
    "b": "Cơ năng thành Nhiệt năng.",
    "c": "Điện năng thành Nhiệt năng.",
    "d": "Hóa năng thành Nhiệt năng.",
    "correct": "Cơ năng thành Nhiệt năng.",
    "explain": "Công của lực ma sát (cơ năng do chuyển động) chuyển hóa thành nội năng (nhiệt năng) làm vật nóng lên."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một vật hình trụ đặc làm bằng đồng có thể tích 200cm³. Biết khối lượng riêng của đồng là 8900 kg/m³. Trọng lượng của vật đó là bao nhiêu?",
    "a": "17,8 N",
    "b": "1,78 N",
    "c": "1780 N",
    "d": "178 N",
    "correct": "17,8 N",
    "explain": "V = 200 cm³ = 0,0002 m³. Khối lượng m = D.V = 8900 x 0,0002 = 1,78 kg. Trọng lượng P = 10.m = 17,8N."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Hiện tượng 'Hiệu ứng nhà kính' làm Trái Đất nóng lên chủ yếu liên quan đến đặc tính nào của khí CO2?",
    "a": "Khí CO2 tỏa nhiệt.",
    "b": "Khí CO2 hấp thụ và giữ lại bức xạ nhiệt (hồng ngoại) từ mặt đất phản xạ lên, không cho thoát ra vũ trụ.",
    "c": "Khí CO2 làm thủng tầng Ozon.",
    "d": "Khí CO2 cháy sinh nhiệt.",
    "correct": "Khí CO2 hấp thụ và giữ lại bức xạ nhiệt (hồng ngoại) từ mặt đất phản xạ lên, không cho thoát ra vũ trụ.",
    "explain": "CO2 cho ánh sáng mặt trời đi qua nhưng giữ lại nhiệt tỏa ra từ Trái Đất (như tấm kính của nhà kính trồng cây)."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao vào ban đêm, ở sa mạc thường rất lạnh, nhiệt độ giảm sâu nhanh chóng?",
    "a": "Do cát thu nhiệt kém.",
    "b": "Do không khí ở sa mạc khô (ít hơi nước), hơi nước giữ nhiệt tốt. Thiếu hơi nước nên nhiệt thoát vào vũ trụ rất nhanh.",
    "c": "Do gió sa mạc lạnh.",
    "d": "Do Mặt Trăng làm lạnh.",
    "correct": "Do không khí ở sa mạc khô (ít hơi nước), hơi nước giữ nhiệt tốt. Thiếu hơi nước nên nhiệt thoát vào vũ trụ rất nhanh.",
    "explain": "Hơi nước là khí nhà kính tự nhiên quan trọng giữ ấm Trái Đất. Sa mạc khô hạn không có 'chăn' hơi nước nên nhiệt mất đi nhanh."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Trong các dụng cụ sau, dụng cụ nào KHÔNG phải là ứng dụng của đòn bẩy?",
    "a": "Cái bập bênh.",
    "b": "Cái xe cút kít (xe rùa).",
    "c": "Cái kìm.",
    "d": "Cái cờ lê vặn ốc.",
    "correct": "Cái cờ lê vặn ốc.",
    "explain": "Cờ lê vặn ốc hoạt động dựa trên nguyên tắc Momen lực (đòn tay quay), không có điểm tựa cố định tì lên vật khác như đòn bẩy truyền thống (dù cơ chế vật lý tương đồng nhưng phân loại thường xếp riêng)."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Một người đứng trên cân trong thang máy. Khi thang máy bắt đầu đi lên nhanh dần đều, số chỉ của cân thay đổi thế nào so với khi đứng yên?",
    "a": "Số chỉ của cân tăng lên.",
    "b": "Số chỉ của cân giảm đi.",
    "c": "Số chỉ cân không đổi.",
    "d": "Cân chỉ số 0.",
    "correct": "Số chỉ của cân tăng lên.",
    "explain": "Hiện tượng tăng trọng lượng biểu kiến: Khi thang máy gia tốc lên, lực quán tính hướng xuống cộng thêm vào trọng lực làm áp lực lên bàn cân tăng."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Nếu Trái Đất không tự quay quanh trục mà chỉ quay quanh Mặt Trời, thì chu kỳ ngày đêm trên Trái Đất sẽ là bao lâu?",
    "a": "Không có ngày đêm.",
    "b": "Ngày dài 6 tháng, đêm dài 6 tháng (1 năm có 1 ngày đêm).",
    "c": "Vẫn là 24 giờ.",
    "d": "Ngày dài vô tận.",
    "correct": "Ngày dài 6 tháng, đêm dài 6 tháng (1 năm có 1 ngày đêm).",
    "explain": "Nếu Trái Đất không tự quay, nó sẽ hướng 1 mặt về Mặt Trời trong nửa quỹ đạo (nửa năm) và khuất bóng trong nửa còn lại."
  },

  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Để đo thể tích của một vật không thấm nước, bỏ lọt bình chia độ nhưng lại nổi trên mặt nước (ví dụ: cái nút bần), ta phải làm thế nào?",
    "a": "Ấn mạnh vật xuống đáy bình.",
    "b": "Buộc vật vào một vật nặng chìm (quả nặng) để cùng chìm xuống. Đo tổng thể tích (V_tổng), sau đó trừ đi thể tích quả nặng (V_nặng) đã biết.",
    "c": "Cắt nhỏ vật ra để đo.",
    "d": "Dùng công thức tính thể tích hình học.",
    "correct": "Buộc vật vào một vật nặng chìm (quả nặng) để cùng chìm xuống. Đo tổng thể tích (V_tổng), sau đó trừ đi thể tích quả nặng (V_nặng) đã biết.",
    "explain": "Phương pháp dùng vật nặng (sinker) giúp vật nổi chìm hoàn toàn trong nước để đo chính xác thể tích phần choán chỗ."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Cấu tạo của phích nước (bình thủy) gồm hai lớp thủy tinh, ở giữa là chân không. Lớp chân không này có tác dụng chủ yếu là gì?",
    "a": "Để giảm trọng lượng của phích.",
    "b": "Ngăn chặn sự truyền nhiệt bằng đối lưu và dẫn nhiệt từ nước nóng ra môi trường bên ngoài.",
    "c": "Ngăn chặn bức xạ nhiệt.",
    "d": "Để làm phích bền hơn.",
    "correct": "Ngăn chặn sự truyền nhiệt bằng đối lưu và dẫn nhiệt từ nước nóng ra môi trường bên ngoài.",
    "explain": "Chân không không có các phân tử vật chất nên không thể xảy ra hiện tượng dẫn nhiệt hay đối lưu (vốn cần môi trường vật chất), giúp giữ nhiệt lâu."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao các xe tải hạng nặng, xe container thường có rất nhiều bánh xe (18-22 bánh)?",
    "a": "Để chạy nhanh hơn.",
    "b": "Để tăng diện tích tiếp xúc với mặt đường, làm giảm áp suất tác dụng lên mặt đường, giúp đường không bị lún, hỏng.",
    "c": "Để tăng lực ma sát giúp xe phanh tốt hơn.",
    "d": "Để xe trông to lớn hơn.",
    "correct": "Để tăng diện tích tiếp xúc với mặt đường, làm giảm áp suất tác dụng lên mặt đường, giúp đường không bị lún, hỏng.",
    "explain": "Áp suất p = F/S. Với tải trọng (F) rất lớn, muốn giảm áp suất (p) để bảo vệ đường thì phải tăng diện tích (S) bằng cách lắp nhiều bánh xe."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Nguyên nhân chính gây ra các mùa (Xuân, Hạ, Thu, Đông) trên Trái Đất là gì?",
    "a": "Do khoảng cách từ Trái Đất đến Mặt Trời thay đổi (lúc gần lúc xa).",
    "b": "Do trục Trái Đất nằm nghiêng (23,5 độ) và không đổi phương khi chuyển động quanh Mặt Trời, khiến lượng ánh sáng nhận được ở mỗi bán cầu thay đổi theo thời gian.",
    "c": "Do Mặt Trời lúc nóng lúc lạnh.",
    "d": "Do gió mùa thổi.",
    "correct": "Do trục Trái Đất nằm nghiêng (23,5 độ) và không đổi phương khi chuyển động quanh Mặt Trời, khiến lượng ánh sáng nhận được ở mỗi bán cầu thay đổi theo thời gian.",
    "explain": "Độ nghiêng của trục làm cho Bắc bán cầu và Nam bán cầu luân phiên ngả về phía Mặt Trời (nhận nhiều nhiệt - Mùa Hè) hoặc ngả ra xa (nhận ít nhiệt - Mùa Đông)."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Ở bộ phận Dinamo (nguồn điện) của xe đạp, khi núm xoay cọ vào bánh xe và quay tít thì đèn sáng. Quá trình chuyển hóa năng lượng ở đây là gì?",
    "a": "Điện năng thành Cơ năng.",
    "b": "Cơ năng (động năng quay) thành Điện năng.",
    "c": "Nhiệt năng thành Điện năng.",
    "d": "Hóa năng thành Điện năng.",
    "correct": "Cơ năng (động năng quay) thành Điện năng.",
    "explain": "Chuyển động quay của bánh xe làm quay nam châm trong cuộn dây, sinh ra dòng điện (Hiện tượng cảm ứng điện từ)."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Gió biển (Sea breeze) thường thổi từ biển vào đất liền vào ban ngày. Lý do là gì?",
    "a": "Ban ngày biển nóng hơn đất liền.",
    "b": "Ban ngày đất liền nóng lên nhanh hơn biển, không khí trên đất liền nóng bay lên cao tạo vùng áp thấp, không khí mát từ biển (áp cao) tràn vào thế chỗ.",
    "c": "Do sóng biển đẩy gió vào.",
    "d": "Do thủy triều lên.",
    "correct": "Ban ngày đất liền nóng lên nhanh hơn biển, không khí trên đất liền nóng bay lên cao tạo vùng áp thấp, không khí mát từ biển (áp cao) tràn vào thế chỗ.",
    "explain": "Nhiệt dung riêng của đất nhỏ hơn nước nên đất nóng nhanh hơn. Sự chênh lệch nhiệt độ tạo ra chênh lệch áp suất gây ra gió."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Biết khối lượng riêng của nước đá là 900 kg/m³, của nước lỏng là 1000 kg/m³. Một tảng băng trôi trên biển sẽ có bao nhiêu phần thể tích chìm dưới nước?",
    "a": "Chìm 10%, nổi 90%.",
    "b": "Chìm 90%, nổi 10%.",
    "c": "Chìm 50%, nổi 50%.",
    "d": "Chìm hoàn toàn.",
    "correct": "Chìm 90%, nổi 10%.",
    "explain": "Tỉ lệ thể tích chìm = D_vật / D_lỏng = 900/1000 = 0,9 = 90%. Đây là lý do 'phần nổi của tảng băng chìm' rất nhỏ."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao tay nắm cửa (nơi ta cầm để mở) thường được bố trí ở mép cánh cửa, xa bản lề nhất?",
    "a": "Để dễ lắp đặt.",
    "b": "Để tăng cánh tay đòn của lực, giúp ta mở cửa với lực nhỏ nhất (Lợi về lực theo quy tắc đòn bẩy).",
    "c": "Để tránh kẹp tay vào bản lề.",
    "d": "Để trang trí.",
    "correct": "Để tăng cánh tay đòn của lực, giúp ta mở cửa với lực nhỏ nhất (Lợi về lực theo quy tắc đòn bẩy).",
    "explain": "Cánh cửa quay quanh bản lề. Lực tác dụng càng xa trục quay (bản lề) thì mô-men lực càng lớn, giúp quay cửa dễ dàng."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Khi cán búa bị lỏng, người ta thường cầm cán búa gõ mạnh đuôi cán xuống đất thì đầu búa sẽ chặt lại. Hiện tượng này giải thích dựa trên:",
    "a": "Lực ma sát.",
    "b": "Quán tính.",
    "c": "Lực đàn hồi.",
    "d": "Trọng lực.",
    "correct": "Quán tính.",
    "explain": "Khi cán búa chạm đất dừng lại đột ngột, đầu búa (vật nặng) theo quán tính vẫn tiếp tục chuyển động xuống dưới, nên ngập chặt vào cán."
  },
  {
    "subject": "Vật lý",
    "difficulty": "hard",
    "content": "Tại sao trong phòng nhỏ hẹp ta nghe âm thanh to và rõ, còn trong hội trường lớn ta thường nghe thấy tiếng vang (eo éo)?",
    "a": "Vì phòng nhỏ kín hơn.",
    "b": "Trong phòng nhỏ, âm phản xạ đến tai gần như cùng lúc với âm trực tiếp (cách nhau < 1/15 giây) nên âm to hơn. Trong phòng lớn, âm phản xạ đến chậm hơn nhiều gây ra tiếng vang.",
    "c": "Vì phòng lớn nhiều người ồn ào.",
    "d": "Vì tường phòng lớn hấp thụ âm.",
    "correct": "Trong phòng nhỏ, âm phản xạ đến tai gần như cùng lúc với âm trực tiếp (cách nhau < 1/15 giây) nên âm to hơn. Trong phòng lớn, âm phản xạ đến chậm hơn nhiều gây ra tiếng vang.",
    "explain": "Tiếng vang hình thành khi âm phản xạ chậm hơn âm trực tiếp ít nhất 1/15 giây (khoảng cách vật phản xạ > 11,3m). Phòng nhỏ khoảng cách ngắn nên không có tiếng vang tách biệt."
  }
]