[
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Truyền thuyết là thể loại truyện dân gian có đặc điểm nổi bật nào sau đây?",
    "a": "Kể về cuộc đời của các nhân vật bất hạnh.",
    "b": "Kể về các sự kiện và nhân vật lịch sử, có yếu tố tưởng tượng, kì ảo.",
    "c": "Kể về loài vật để rút ra bài học luân lý.",
    "d": "Kể về những chuyện cười nhằm mục đích giải trí.",
    "correct": "Kể về các sự kiện và nhân vật lịch sử, có yếu tố tưởng tượng, kì ảo.",
    "explain": "Truyền thuyết thường gắn liền với lịch sử dựng nước và giữ nước, nhưng được nhân dân thêm thắt các chi tiết kì ảo để thiêng liêng hóa."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong truyện 'Thánh Gióng', chi tiết Gióng vươn vai biến thành tráng sĩ thể hiện điều gì?",
    "a": "Sức mạnh siêu nhiên của thần linh.",
    "b": "Sự trưởng thành vượt bậc để đáp ứng yêu cầu cứu nước.",
    "c": "Mong ước của cha mẹ Gióng muốn con lớn nhanh.",
    "d": "Sự giúp đỡ của các vị thần.",
    "correct": "Sự trưởng thành vượt bậc để đáp ứng yêu cầu cứu nước.",
    "explain": "Chi tiết này mang ý nghĩa biểu tượng cho sức mạnh của lòng yêu nước, khi đất nước lâm nguy, người anh hùng vụt lớn lên để gánh vác trọng trách."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Truyện cổ tích thường kết thúc như thế nào?",
    "a": "Kết thúc buồn, nhân vật chính hy sinh.",
    "b": "Kết thúc mở để người đọc tự suy ngẫm.",
    "c": "Kết thúc có hậu, ở hiền gặp lành, ác giả ác báo.",
    "d": "Kết thúc bất ngờ, không theo quy luật nào.",
    "correct": "Kết thúc có hậu, ở hiền gặp lành, ác giả ác báo.",
    "explain": "Đây là đặc điểm cốt lõi của cổ tích, thể hiện ước mơ về công lý và lẽ phải của nhân dân lao động."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong câu văn: 'Trẻ em như búp trên cành', tác giả sử dụng biện pháp tu từ nào?",
    "a": "Nhân hóa.",
    "b": "So sánh.",
    "c": "Ẩn dụ.",
    "d": "Hoán dụ.",
    "correct": "So sánh.",
    "explain": "Có từ so sánh 'như', đối chiếu 'trẻ em' với 'búp trên cành' để làm nổi bật sự non nớt, cần được che chở."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Từ nào sau đây là từ láy?",
    "a": "Tươi tốt.",
    "b": "Buôn bán.",
    "c": "Lấp lánh.",
    "d": "Mặt mũi.",
    "correct": "Lấp lánh.",
    "explain": "'Lấp lánh' có sự lặp lại về âm đầu 'l' và không tách riêng nghĩa rõ ràng của từng tiếng nếu đứng một mình, trong khi các từ còn lại là từ ghép đẳng lập."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Ngôi kể thứ nhất trong văn tự sự có đặc điểm gì?",
    "a": "Người kể giấu mình, gọi tên các nhân vật theo tên của chúng.",
    "b": "Người kể xưng 'tôi', trực tiếp kể lại những gì mình nghe, thấy, trải qua.",
    "c": "Người kể là tác giả đứng ngoài câu chuyện.",
    "d": "Người kể có thể biết hết mọi suy nghĩ của các nhân vật khác.",
    "correct": "Người kể xưng 'tôi', trực tiếp kể lại những gì mình nghe, thấy, trải qua.",
    "explain": "Ngôi kể thứ nhất (xưng tôi) giúp câu chuyện trở nên chân thực, giàu cảm xúc cá nhân nhưng bị giới hạn về tầm nhìn."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong văn bản 'Bài học đường đời đầu tiên' (Tô Hoài), tính cách của Dế Mèn được miêu tả như thế nào ở đầu truyện?",
    "a": "Nhút nhát, sợ sệt.",
    "b": "Khiêm tốn, biết quan tâm người khác.",
    "c": "Cường tráng nhưng kiêu căng, xốc nổi.",
    "d": "Yếu ớt và bệnh tật.",
    "correct": "Cường tráng nhưng kiêu căng, xốc nổi.",
    "explain": "Dế Mèn tự hào về ngoại hình khỏe mạnh của mình nhưng lại có tính cách hung hăng, coi thường các con vật khác."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Thơ lục bát là thể thơ có quy luật như thế nào về số tiếng?",
    "a": "Mỗi dòng đều có 5 tiếng.",
    "b": "Mỗi dòng đều có 7 tiếng.",
    "c": "Một cặp câu gồm dòng trên 6 tiếng, dòng dưới 8 tiếng.",
    "d": "Số tiếng trong các dòng tự do, không cố định.",
    "correct": "Một cặp câu gồm dòng trên 6 tiếng, dòng dưới 8 tiếng.",
    "explain": "Lục bát là thể thơ dân tộc, cấu trúc cơ bản nhất là cặp câu lục (6 tiếng) và bát (8 tiếng) luân phiên."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Biện pháp nhân hóa được sử dụng trong câu nào dưới đây?",
    "a": "Bầu trời xanh ngắt một màu.",
    "b": "Chị ong nâu nâu đang múa hát.",
    "c": "Những đám mây trôi lững lờ.",
    "d": "Cây bàng lá đỏ rực.",
    "correct": "Chị ong nâu nâu đang múa hát.",
    "explain": "Dùng từ gọi người 'chị' và từ chỉ hoạt động của người 'múa hát' để gán cho con ong."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Truyện ngụ ngôn thường hướng tới mục đích gì?",
    "a": "Kể về nguồn gốc các sự vật.",
    "b": "Phản ánh cuộc đấu tranh giai cấp.",
    "c": "Khuyên nhủ, răn dạy con người bài học trong cuộc sống.",
    "d": "Ca ngợi vẻ đẹp của thiên nhiên.",
    "correct": "Khuyên nhủ, răn dạy con người bài học trong cuộc sống.",
    "explain": "Truyện ngụ ngôn mượn chuyện loài vật hoặc con người để nói bóng gió, gửi gắm bài học luân lý, triết lý sống."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Từ 'Gia' trong từ 'Gia đình' có nghĩa là gì?",
    "a": "Thêm vào.",
    "b": "Nhà.",
    "c": "Tốt đẹp.",
    "d": "Người già.",
    "correct": "Nhà.",
    "explain": "Đây là yếu tố Hán Việt. 'Gia' trong gia đình, gia chủ, gia giáo đều có nghĩa là 'nhà'."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong truyện 'Sự tích Hồ Gươm', chi tiết Rùa Vàng đòi gươm có ý nghĩa gì?",
    "a": "Đánh dấu chấm dứt chiến tranh, mở ra thời kỳ hòa bình.",
    "b": "Rùa Vàng muốn lấy lại tài sản của mình.",
    "c": "Lê Lợi không muốn làm vua nữa.",
    "d": "Thể hiện sự bội bạc của nhà vua.",
    "correct": "Đánh dấu chấm dứt chiến tranh, mở ra thời kỳ hòa bình.",
    "explain": "Gươm là vũ khí chiến đấu. Trả gươm khi đất nước đã thanh bình thể hiện khát vọng hòa bình của dân tộc, không muốn dùng vũ lực mãi."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trạng ngữ trong câu: 'Sáng nay, lớp em đi lao động' có chức năng gì?",
    "a": "Chỉ nguyên nhân.",
    "b": "Chỉ mục đích.",
    "c": "Chỉ thời gian.",
    "d": "Chỉ nơi chốn.",
    "correct": "Chỉ thời gian.",
    "explain": "'Sáng nay' là từ ngữ xác định thời điểm diễn ra sự việc."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Đặc điểm nào KHÔNG phải của truyện cổ tích?",
    "a": "Có yếu tố hoang đường kì ảo.",
    "b": "Nhân vật thường được chia làm hai tuyến: thiện và ác.",
    "c": "Các sự kiện, nhân vật được xác định cụ thể về thời gian, địa điểm lịch sử.",
    "d": "Thể hiện ước mơ của nhân dân.",
    "correct": "Các sự kiện, nhân vật được xác định cụ thể về thời gian, địa điểm lịch sử.",
    "explain": "Đây là đặc điểm của Truyền thuyết. Cổ tích thường có không gian, thời gian không xác định (Ngày xửa ngày xưa...)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Bài học rút ra từ truyện ngụ ngôn 'Ếch ngồi đáy giếng' là gì?",
    "a": "Phải biết giữ gìn môi trường sống.",
    "b": "Không nên chủ quan, kiêu ngạo, cần mở rộng tầm hiểu biết.",
    "c": "Phải biết yêu thương các loài vật nhỏ bé.",
    "d": "Cần phải dũng cảm đối mặt với nguy hiểm.",
    "correct": "Không nên chủ quan, kiêu ngạo, cần mở rộng tầm hiểu biết.",
    "explain": "Chú ếch vì sống lâu trong giếng hẹp nên coi trời bằng vung, khi ra ngoài vẫn giữ thói quen cũ nên bị giẫm bẹp -> Phê phán sự hạn hẹp."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Từ nào sau đây là từ mượn tiếng Pháp?",
    "a": "Xà phòng.",
    "b": "Ti vi.",
    "c": "In-tơ-nét.",
    "d": "Cả a và b.",
    "correct": "Cả a và b.",
    "explain": "'Xà phòng' (savon) và 'Ti vi' (télévision) đều có nguồn gốc từ tiếng Pháp. 'In-tơ-nét' bắt nguồn từ tiếng Anh."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong câu: 'Người cha mái tóc bạc', từ 'bạc' mang nghĩa gì?",
    "a": "Tên một loại kim loại quý.",
    "b": "Chỉ màu sắc (trắng).",
    "c": "Chỉ sự tệ bạc, vô ơn.",
    "d": "Chỉ tiền bạc.",
    "correct": "Chỉ màu sắc (trắng).",
    "explain": "Trong ngữ cảnh này, 'bạc' dùng để chỉ màu tóc của người già, là nghĩa gốc hoặc nghĩa chuyển tùy quan điểm nhưng chắc chắn chỉ màu sắc."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Cụm danh từ là gì?",
    "a": "Là tổ hợp từ do danh từ và các từ ngữ phụ thuộc nó tạo thành.",
    "b": "Là tổ hợp từ do động từ và các từ ngữ phụ thuộc nó tạo thành.",
    "c": "Là tổ hợp từ do tính từ và các từ ngữ phụ thuộc nó tạo thành.",
    "d": "Là một câu hoàn chỉnh.",
    "correct": "Là tổ hợp từ do danh từ và các từ ngữ phụ thuộc nó tạo thành.",
    "explain": "Cụm danh từ có danh từ làm trung tâm, ví dụ: 'những bông hoa đẹp' (danh từ trung tâm: bông hoa)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Khi miêu tả cảnh sinh hoạt, người viết cần chú ý điều gì nhất?",
    "a": "Chỉ tả ngoại hình của con người.",
    "b": "Tả các hoạt động, cử chỉ, lời nói của con người trong khung cảnh cụ thể.",
    "c": "Chỉ tả màu sắc của bầu trời.",
    "d": "Liệt kê tất cả đồ vật có trong phòng.",
    "correct": "Tả các hoạt động, cử chỉ, lời nói của con người trong khung cảnh cụ thể.",
    "explain": "Cảnh sinh hoạt trọng tâm là 'sinh hoạt' (hoạt động) của con người, cảnh vật chỉ là nền."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Dấu ngoặc kép trong câu: Nó bảo nó thích đọc 'Dế Mèn phiêu lưu ký' nhất, có tác dụng gì?",
    "a": "Đánh dấu lời nói trực tiếp.",
    "b": "Đánh dấu tên tác phẩm.",
    "c": "Đánh dấu từ ngữ được dùng với ý nghĩa đặc biệt.",
    "d": "Đánh dấu ý nghĩ của nhân vật.",
    "correct": "Đánh dấu tên tác phẩm.",
    "explain": "Trong trường hợp này, 'Dế Mèn phiêu lưu ký' là tên một cuốn sách."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Câu văn nào sau đây sử dụng biện pháp ẩn dụ?",
    "a": "Làn da em bé trắng như trứng gà bóc.",
    "b": "Người Cha mái tóc bạc / Đốt lửa cho anh nằm.",
    "c": "Bác mặt trời đạp xe qua đỉnh núi.",
    "d": "Chiếc xe chạy băng băng trên đường.",
    "correct": "Người Cha mái tóc bạc / Đốt lửa cho anh nằm.",
    "explain": "'Người Cha' ở đây ẩn dụ cho Bác Hồ, dựa trên nét tương đồng về sự chăm sóc ân cần, yêu thương như cha con."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong truyện 'Sơn Tinh, Thủy Tinh', Sơn Tinh đại diện cho lực lượng nào?",
    "a": "Sức mạnh của thiên tai, bão lũ.",
    "b": "Sức mạnh của nhân dân trong việc đắp đê, chống lũ.",
    "c": "Sức mạnh của thần linh cai quản núi rừng.",
    "d": "Sức mạnh của quân xâm lược.",
    "correct": "Sức mạnh của nhân dân trong việc đắp đê, chống lũ.",
    "explain": "Sơn Tinh là hình tượng nhân hóa cho khát vọng và sức mạnh của người Việt cổ trong công cuộc chế ngự thiên nhiên (trị thủy)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Văn bản 'Sông nước Cà Mau' (Đoàn Giỏi) chủ yếu sử dụng phương thức biểu đạt nào?",
    "a": "Nghị luận.",
    "b": "Miêu tả.",
    "c": "Biểu cảm.",
    "d": "Thuyết minh.",
    "correct": "Miêu tả.",
    "explain": "Văn bản tập trung tái hiện vẻ đẹp thiên nhiên phong phú, hùng vĩ của vùng sông nước Cà Mau."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Thành phần chính của câu gồm những bộ phận nào?",
    "a": "Trạng ngữ và Chủ ngữ.",
    "b": "Chủ ngữ và Vị ngữ.",
    "c": "Vị ngữ và Bổ ngữ.",
    "d": "Trạng ngữ và Vị ngữ.",
    "correct": "Chủ ngữ và Vị ngữ.",
    "explain": "Theo ngữ pháp tiếng Việt, câu đơn bình thường bắt buộc phải có nòng cốt là Chủ ngữ và Vị ngữ để diễn đạt trọn ý."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong câu: 'Vua sai ban cho làng ấy ba thúng gạo nếp', từ 'ban' có sắc thái nghĩa như thế nào so với từ 'cho'?",
    "a": "Sắc thái trang trọng, thường dùng cho bề trên đưa xuống bề dưới.",
    "b": "Sắc thái thân mật, suồng sã.",
    "c": "Sắc thái khinh miệt.",
    "d": "Không có gì khác biệt.",
    "correct": "Sắc thái trang trọng, thường dùng cho bề trên đưa xuống bề dưới.",
    "explain": "'Ban' là từ Hán Việt, thường dùng trong ngữ cảnh vua chúa hoặc thần thánh ban tặng cho người dưới, thể hiện quyền lực và ân huệ."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Thể loại Ký (Hồi ký, Du ký) có đặc điểm gì?",
    "a": "Hư cấu hoàn toàn các sự việc.",
    "b": "Ghi chép lại những sự việc, con người có thật mà người viết đã trải qua hoặc chứng kiến.",
    "c": "Chủ yếu dùng để tranh luận một vấn đề.",
    "d": "Viết theo thể thơ lục bát.",
    "correct": "Ghi chép lại những sự việc, con người có thật mà người viết đã trải qua hoặc chứng kiến.",
    "explain": "Ký tôn trọng sự thật khách quan, người viết kể lại những gì mắt thấy tai nghe."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong truyện 'Em bé thông minh', thử thách đầu tiên mà quan uyển đưa ra cho hai cha con là gì?",
    "a": "Xâu chỉ qua ruột ốc.",
    "b": "Hỏi trâu một ngày cày được mấy đường.",
    "c": "Bắt nuôi gà trống đẻ trứng.",
    "d": "Làm cỗ thịt chim sẻ.",
    "correct": "Hỏi trâu một ngày cày được mấy đường.",
    "explain": "Đây là câu đố oái oăm nhằm thử phản xạ nhanh trí của người dân. Em bé đã hỏi vặn lại quan về số bước chân ngựa."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Điệp ngữ trong câu thơ 'Đoàn kết, đoàn kết, đại đoàn kết / Thành công, thành công, đại thành công' có tác dụng gì?",
    "a": "Làm cho câu thơ dài hơn.",
    "b": "Nhấn mạnh ý nghĩa của sự đoàn kết và thành công, tạo nhịp điệu mạnh mẽ.",
    "c": "Thể hiện vốn từ phong phú của tác giả.",
    "d": "Làm cho câu thơ trở nên bí ẩn.",
    "correct": "Nhấn mạnh ý nghĩa của sự đoàn kết và thành công, tạo nhịp điệu mạnh mẽ.",
    "explain": "Điệp ngữ dùng để nhấn mạnh ý, gây ấn tượng mạnh và tạo tính nhạc cho câu thơ."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Từ nào không cùng nhóm với các từ còn lại: 'nhân hậu, trung thực, dũng cảm, độc ác'?",
    "a": "Nhân hậu.",
    "b": "Trung thực.",
    "c": "Dũng cảm.",
    "d": "Độc ác.",
    "correct": "Độc ác.",
    "explain": "Ba từ đầu chỉ phẩm chất tốt đẹp (tích cực), 'độc ác' chỉ tính xấu (tiêu cực)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Câu văn 'Mặt trời xuống biển như hòn lửa' miêu tả thời điểm nào trong ngày?",
    "a": "Bình minh.",
    "b": "Hoàng hôn.",
    "c": "Giữa trưa.",
    "d": "Đêm khuya.",
    "correct": "Hoàng hôn.",
    "explain": "'Mặt trời xuống biển' là hình ảnh mặt trời lặn vào buổi chiều tà (hoàng hôn)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong văn bản 'Bức tranh của em gái tôi' (Tạ Duy Anh), người anh đã nhận ra điều gì ở bản thân khi đứng trước bức tranh đoạt giải của em gái?",
    "a": "Tài năng hội họa tiềm ẩn của mình.",
    "b": "Sự hẹp hòi, đố kỵ của bản thân và tấm lòng nhân hậu của em gái.",
    "c": "Sự bất công của ban giám khảo.",
    "d": "Niềm tự hào vô bờ bến về gia đình.",
    "correct": "Sự hẹp hòi, đố kỵ của bản thân và tấm lòng nhân hậu của em gái.",
    "explain": "Bức tranh vẽ người anh hoàn hảo đã đánh thức lương tâm người anh, khiến cậu xấu hổ vì đã từng ghen tị với tài năng của em."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Biện pháp tu từ Hoán dụ xuất hiện trong câu thơ nào sau đây?",
    "a": "Bàn tay ta làm nên tất cả / Có sức người sỏi đá cũng thành cơm.",
    "b": "Trăng cứ tròn vành vạnh / Kể chi người vô tình.",
    "c": "Quê hương là chùm khế ngọt.",
    "d": "Dòng sông mới điệu làm sao.",
    "correct": "Bàn tay ta làm nên tất cả / Có sức người sỏi đá cũng thành cơm.",
    "explain": "'Bàn tay' là bộ phận cơ thể, được dùng để chỉ người lao động (lấy bộ phận chỉ toàn thể), đây là phép hoán dụ."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Bài thơ 'Đêm nay Bác không ngủ' của Minh Huệ được viết theo thể thơ nào?",
    "a": "Lục bát.",
    "b": "Năm chữ (Ngũ ngôn).",
    "c": "Bốn chữ.",
    "d": "Tự do.",
    "correct": "Năm chữ (Ngũ ngôn).",
    "explain": "Mỗi dòng thơ có 5 tiếng, phù hợp với lối kể chuyện tâm tình, sâu lắng."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Văn bản 'Vượt thác' (trích Quê nội - Võ Quảng) miêu tả cảnh gì?",
    "a": "Cảnh đoàn thuyền vượt qua vùng biển bão tố.",
    "b": "Cảnh con thuyền ngược dòng sông Thu Bồn vượt qua thác ghềnh hiểm trở.",
    "c": "Cảnh mọi người đi hội chùa Hương.",
    "d": "Cảnh đánh cá trên sông.",
    "correct": "Cảnh con thuyền ngược dòng sông Thu Bồn vượt qua thác ghềnh hiểm trở.",
    "explain": "Bài văn miêu tả hành trình ngược dòng sông Thu Bồn, làm nổi bật vẻ đẹp hùng vĩ của thiên nhiên và sức mạnh của con người lao động (Dượng Hương Thư)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Tính từ là những từ chỉ đặc điểm nào?",
    "a": "Hoạt động, trạng thái của sự vật.",
    "b": "Tên gọi của sự vật.",
    "c": "Tính chất, đặc điểm của sự vật, hoạt động, trạng thái.",
    "d": "Số lượng của sự vật.",
    "correct": "Tính chất, đặc điểm của sự vật, hoạt động, trạng thái.",
    "explain": "Ví dụ: xanh, đỏ, tốt, xấu, nhanh, chậm... đều là tính từ."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Hình ảnh 'Chú bé loắt choắt / Cái xắc xinh xinh' miêu tả nhân vật nào?",
    "a": "Thánh Gióng.",
    "b": "Dế Mèn.",
    "c": "Lượm.",
    "d": "Em bé thông minh.",
    "correct": "Lượm.",
    "explain": "Đây là những câu thơ nổi tiếng của Tố Hữu miêu tả chú bé liên lạc Lượm hồn nhiên, nhanh nhẹn."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong câu 'Mưa rơi tí tách', từ 'tí tách' thuộc loại từ nào?",
    "a": "Từ tượng hình.",
    "b": "Từ tượng thanh.",
    "c": "Đại từ.",
    "d": "Quan hệ từ.",
    "correct": "Từ tượng thanh.",
    "explain": "'Tí tách' mô phỏng âm thanh của tiếng mưa rơi."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Văn bản 'Cây tre Việt Nam' (Thép Mới) ca ngợi điều gì?",
    "a": "Vẻ đẹp và giá trị kinh tế của cây tre.",
    "b": "Sự gắn bó thủy chung của cây tre với con người Việt Nam trong lao động và chiến đấu.",
    "c": "Kỹ thuật trồng tre.",
    "d": "Các món ăn làm từ măng tre.",
    "correct": "Sự gắn bó thủy chung của cây tre với con người Việt Nam trong lao động và chiến đấu.",
    "explain": "Cây tre được coi là biểu tượng cho phẩm chất kiên cường, bất khuất và giản dị của con người Việt Nam."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Câu trần thuật đơn là câu như thế nào?",
    "a": "Câu có nhiều cụm chủ - vị bao chứa nhau.",
    "b": "Câu do một cụm chủ - vị tạo thành.",
    "c": "Câu không có chủ ngữ.",
    "d": "Câu dùng để hỏi.",
    "correct": "Câu do một cụm chủ - vị tạo thành.",
    "explain": "Ví dụ: 'Mặt trời mọc.' (Chủ ngữ: Mặt trời, Vị ngữ: mọc)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong bài 'Buổi học cuối cùng', thầy Ha-men đã nói điều gì về tiếng Pháp?",
    "a": "Đó là ngôn ngữ khó học nhất thế giới.",
    "b": "Đó là ngôn ngữ hay nhất, trong sáng nhất và vững vàng nhất.",
    "c": "Đó là ngôn ngữ chỉ dành cho giới thượng lưu.",
    "d": "Đó là ngôn ngữ sắp bị lãng quên.",
    "correct": "Đó là ngôn ngữ hay nhất, trong sáng nhất và vững vàng nhất.",
    "explain": "Câu nói thể hiện lòng yêu nước và niềm tự hào dân tộc sâu sắc của thầy giáo qua tình yêu tiếng mẹ đẻ."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Nghĩa của từ là gì?",
    "a": "Là hình thức âm thanh của từ.",
    "b": "Là nội dung (sự vật, tính chất, hoạt động...) mà từ biểu thị.",
    "c": "Là cách viết của từ.",
    "d": "Là nguồn gốc của từ.",
    "correct": "Là nội dung (sự vật, tính chất, hoạt động...) mà từ biểu thị.",
    "explain": "Mỗi từ đều có hai mặt: hình thức (âm/chữ) và nội dung (nghĩa)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Truyện 'Thạch Sanh' phê phán tính cách nào của nhân vật Lý Thông?",
    "a": "Dũng cảm nhưng nóng nảy.",
    "b": "Vong ân bội nghĩa, xảo trá, độc ác.",
    "c": "Lười biếng, ham ăn.",
    "d": "Khờ khạo, tin người.",
    "correct": "Vong ân bội nghĩa, xảo trá, độc ác.",
    "explain": "Lý Thông nhiều lần lừa gạt, cướp công của Thạch Sanh và tìm cách hãm hại người đã kết nghĩa với mình."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Phó từ là những từ chuyên đi kèm với từ loại nào?",
    "a": "Danh từ.",
    "b": "Động từ, Tính từ.",
    "c": "Đại từ.",
    "d": "Số từ.",
    "correct": "Động từ, Tính từ.",
    "explain": "Phó từ (như: đang, sẽ, vẫn, rất, quá...) bổ sung ý nghĩa về thời gian, mức độ... cho động từ và tính từ."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong văn bản 'Cô Tô' (Nguyễn Tuân), tác giả đã chọn điểm nhìn nào để miêu tả toàn cảnh đảo Cô Tô?",
    "a": "Từ trên mũi đá ở đầu đảo.",
    "b": "Từ trên nóc đồn biên phòng.",
    "c": "Từ trên con thuyền ngoài khơi.",
    "d": "Từ bãi cát trắng.",
    "correct": "Từ trên nóc đồn biên phòng.",
    "explain": "Điểm nhìn từ trên cao giúp tác giả bao quát được vẻ đẹp rực rỡ, bao la của biển trời đảo Cô Tô."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Chi tiết 'niêu cơm thần' trong truyện Thạch Sanh có ý nghĩa gì?",
    "a": "Thể hiện sự giàu có của Thạch Sanh.",
    "b": "Tượng trưng cho tấm lòng nhân đạo, yêu chuộng hòa bình.",
    "c": "Khoe khoang sức mạnh phép thuật.",
    "d": "Đe dọa quân địch.",
    "correct": "Tượng trưng cho tấm lòng nhân đạo, yêu chuộng hòa bình.",
    "explain": "Niêu cơm ăn mãi không hết không chỉ nuôi quân địch no lòng mà còn khiến chúng nể phục, dập tắt ý chí xâm lược bằng tình thương."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Câu cầu khiến dùng để làm gì?",
    "a": "Dùng để kể, tả hoặc giới thiệu.",
    "b": "Dùng để hỏi.",
    "c": "Dùng để bộc lộ cảm xúc.",
    "d": "Dùng để ra lệnh, yêu cầu, đề nghị, khuyên bảo.",
    "correct": "Dùng để ra lệnh, yêu cầu, đề nghị, khuyên bảo.",
    "explain": "Câu cầu khiến thường chứa các từ: hãy, đừng, chớ, đi, thôi, nào..."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong các từ sau, từ nào là từ Hán Việt?",
    "a": "Mây trắng.",
    "b": "Phi cơ.",
    "c": "Máy bay.",
    "d": "Xe đạp.",
    "correct": "Phi cơ.",
    "explain": "'Phi cơ' là từ Hán Việt (Phi: bay, Cơ: máy), tương đương với từ thuần Việt là 'máy bay'."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Văn bản 'Lao xao' (Duy Khán) chủ yếu miêu tả đối tượng nào?",
    "a": "Các loài hoa trong vườn.",
    "b": "Thế giới các loài chim ở làng quê.",
    "c": "Cảnh sinh hoạt của người nông dân.",
    "d": "Cảnh chợ quê ngày tết.",
    "correct": "Thế giới các loài chim ở làng quê.",
    "explain": "Tác giả miêu tả sinh động các loài chim (bồ các, sáo, diều hâu, chèo bẻo...) qua đó thể hiện tình yêu thiên nhiên quê hương."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Chủ đề của truyện 'Sọ Dừa' là gì?",
    "a": "Ca ngợi vẻ đẹp bên ngoài.",
    "b": "Ca ngợi vẻ đẹp bên trong (phẩm chất, tài năng) của con người bất hạnh.",
    "c": "Khuyên con người nên đi làm ăn xa.",
    "d": "Kể về cách trồng dừa.",
    "correct": "Ca ngợi vẻ đẹp bên trong (phẩm chất, tài năng) của con người bất hạnh.",
    "explain": "Dù có ngoại hình dị dạng, Sọ Dừa lại thông minh, tài giỏi và nhân hậu. Truyện khẳng định giá trị chân chính của con người nằm ở bên trong."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Từ 'đầu' trong câu 'Đầu súng trăng treo' được dùng theo nghĩa nào?",
    "a": "Nghĩa gốc (bộ phận cơ thể).",
    "b": "Nghĩa chuyển (phần trên cùng của vật).",
    "c": "Nghĩa chuyển (vị trí hàng đầu).",
    "d": "Nghĩa gốc (nơi chứa bộ não).",
    "correct": "Nghĩa chuyển (phần trên cùng của vật).",
    "explain": "Từ 'đầu' chuyển nghĩa theo phương thức ẩn dụ, chỉ phần mũi súng."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Kết cấu của một bài văn miêu tả thường gồm mấy phần?",
    "a": "2 phần (Mở bài, Thân bài).",
    "b": "3 phần (Mở bài, Thân bài, Kết bài).",
    "c": "4 phần.",
    "d": "Tùy ý người viết.",
    "correct": "3 phần (Mở bài, Thân bài, Kết bài).",
    "explain": "Đây là bố cục chuẩn của một bài tập làm văn trong nhà trường."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong câu 'Tre giữ làng, giữ nước, giữ mái nhà tranh, giữ đồng lúa chín', tác giả sử dụng biện pháp tu từ nào?",
    "a": "So sánh.",
    "b": "Điệp ngữ.",
    "c": "Nói quá.",
    "d": "Chơi chữ.",
    "correct": "Điệp ngữ.",
    "explain": "Từ 'giữ' được lặp lại 4 lần để nhấn mạnh vai trò to lớn và sự kiên cường của cây tre trong công cuộc bảo vệ tổ quốc."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Truyện 'Con Rồng cháu Tiên' giải thích điều gì?",
    "a": "Sự ra đời của các ngọn núi.",
    "b": "Nguồn gốc giống nòi của dân tộc Việt Nam.",
    "c": "Cách cai trị đất nước của các vua Hùng.",
    "d": "Sự hình thành biển Đông.",
    "correct": "Nguồn gốc giống nòi của dân tộc Việt Nam.",
    "explain": "Truyện giải thích người Việt có nguồn gốc cao quý (cha Rồng, mẹ Tiên), từ đó khơi dậy niềm tự hào và tinh thần đoàn kết (đồng bào)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Lượng từ là những từ chỉ điều gì?",
    "a": "Chỉ số lượng cụ thể.",
    "b": "Chỉ lượng ít hay nhiều của sự vật một cách khái quát.",
    "c": "Chỉ thứ tự.",
    "d": "Chỉ hoạt động.",
    "correct": "Chỉ lượng ít hay nhiều của sự vật một cách khái quát.",
    "explain": "Ví dụ: những, các, mọi, mỗi, từng... (khác với số từ chỉ số lượng cụ thể như một, hai, ba...)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Nhân vật Dượng Hương Thư trong 'Vượt thác' được so sánh với hình ảnh nào?",
    "a": "Một pho tượng đồng đúc.",
    "b": "Một con hổ xuống núi.",
    "c": "Một cây cổ thụ.",
    "d": "Một vị thần.",
    "correct": "Một pho tượng đồng đúc.",
    "explain": "Hình ảnh so sánh này làm nổi bật vẻ đẹp gân guốc, rắn rỏi và sức mạnh phi thường của người lao động khi đối mặt với thiên nhiên dữ dội."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Câu nào sau đây mắc lỗi dùng từ?",
    "a": "Anh ấy là một người rất kiên cố.",
    "b": "Bức tường này rất kiên cố.",
    "c": "Anh ấy là một người rất kiên cường.",
    "d": "Chúng ta cần kiên trì học tập.",
    "correct": "Anh ấy là một người rất kiên cố.",
    "explain": "'Kiên cố' thường dùng cho công trình xây dựng, vật chất (vững chắc). Dùng cho tính cách con người phải dùng 'kiên cường' hoặc 'kiên định'."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong truyện 'Treo biển', chi tiết gây cười là gì?",
    "a": "Tấm biển được sơn màu rất đẹp.",
    "b": "Người chủ cửa hàng làm theo mọi lời góp ý một cách máy móc.",
    "c": "Khách hàng khen tấm biển đẹp.",
    "d": "Cửa hàng bán cá rất đông khách.",
    "correct": "Người chủ cửa hàng làm theo mọi lời góp ý một cách máy móc.",
    "explain": "Tiếng cười bật ra từ việc chủ nhà không có chủ kiến, ai nói gì cũng nghe, cuối cùng cất luôn cái biển đi."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Từ 'xuân' trong câu 'Mùa xuân là tết trồng cây' được dùng với nghĩa gì?",
    "a": "Nghĩa chuyển (chỉ tuổi trẻ).",
    "b": "Nghĩa gốc (tên một mùa trong năm).",
    "c": "Nghĩa chuyển (chỉ sức sống).",
    "d": "Nghĩa chuyển (chỉ năm).",
    "correct": "Nghĩa gốc (tên một mùa trong năm).",
    "explain": "Ở đây 'xuân' chỉ mùa đầu tiên trong bốn mùa."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Văn bản 'Mưa' của Trần Đăng Khoa được viết theo thể thơ nào?",
    "a": "Lục bát.",
    "b": "Thơ tự do (các câu ngắn dài đan xen).",
    "c": "Thơ 4 chữ.",
    "d": "Thơ 5 chữ.",
    "correct": "Thơ tự do (các câu ngắn dài đan xen).",
    "explain": "Bài thơ có nhịp điệu nhanh, dồn dập, câu thơ ngắn dài linh hoạt để mô phỏng trận mưa rào."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Câu văn nào sau đây sử dụng phép so sánh ngang bằng?",
    "a": "Những ngôi sao thức ngoài kia / Chẳng bằng mẹ đã thức vì chúng con.",
    "b": "Bóng Bác cao lồng lộng / Ấm hơn ngọn lửa hồng.",
    "c": "Thầy thuốc như mẹ hiền.",
    "d": "Mây đen như mực.",
    "correct": "Thầy thuốc như mẹ hiền.",
    "explain": "Từ so sánh là 'như', dùng để chỉ sự tương đồng, ngang bằng. (Câu a và b là so sánh không ngang bằng)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Câu văn nào sau đây bị thiếu chủ ngữ?",
    "a": "Qua tác phẩm 'Dế Mèn phiêu lưu ký', em thấy Dế Mèn đã trưởng thành hơn.",
    "b": "Qua tác phẩm 'Dế Mèn phiêu lưu ký' cho em thấy sự trưởng thành của Dế Mèn.",
    "c": "Tác phẩm 'Dế Mèn phiêu lưu ký' rất hay.",
    "d": "Em rất thích tác phẩm 'Dế Mèn phiêu lưu ký'.",
    "correct": "Qua tác phẩm 'Dế Mèn phiêu lưu ký' cho em thấy sự trưởng thành của Dế Mèn.",
    "explain": "Câu này bị nhầm lẫn trạng ngữ thành chủ ngữ (do từ 'Qua' và 'cho'). Sửa lại bằng cách bỏ từ 'Qua' hoặc bỏ từ 'cho'."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Bài học rút ra từ truyện ngụ ngôn 'Thầy bói xem voi' là gì?",
    "a": "Muốn hiểu biết sự vật phải xem xét toàn diện, không được lấy cái bộ phận để đánh giá cái toàn thể.",
    "b": "Nên tin lời thầy bói.",
    "c": "Không nên tranh luận với người khác.",
    "d": "Voi là loài vật rất to lớn.",
    "correct": "Muốn hiểu biết sự vật phải xem xét toàn diện, không được lấy cái bộ phận để đánh giá cái toàn thể.",
    "explain": "Các thầy bói chỉ sờ một bộ phận của voi nhưng lại khẳng định đó là hình dáng của cả con voi, dẫn đến nhận thức sai lệch."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Chỉ từ là những từ dùng để làm gì?",
    "a": "Chỉ hoạt động.",
    "b": "Trỏ vào sự vật để xác định vị trí của sự vật trong không gian hoặc thời gian.",
    "c": "Gọi tên sự vật.",
    "d": "Miêu tả tính chất.",
    "correct": "Trỏ vào sự vật để xác định vị trí của sự vật trong không gian hoặc thời gian.",
    "explain": "Ví dụ: này, kia, ấy, nọ... (nhà này, hôm ấy)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong bài thơ 'Lượm', thái độ của tác giả đối với chú bé Lượm là gì?",
    "a": "Xót xa, thương cảm.",
    "b": "Yêu mến, trân trọng và cảm phục.",
    "c": "Lo lắng, sợ hãi.",
    "d": "Thờ ơ, lạnh lùng.",
    "correct": "Yêu mến, trân trọng và cảm phục.",
    "explain": "Tố Hữu miêu tả Lượm với những từ ngữ đẹp đẽ, thể hiện tình cảm yêu mến sự hồn nhiên và cảm phục sự hy sinh anh dũng của chú bé."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Yếu tố nào đóng vai trò quan trọng nhất trong văn bản tự sự?",
    "a": "Cảm xúc của người viết.",
    "b": "Sự việc và nhân vật.",
    "c": "Hình ảnh thiên nhiên.",
    "d": "Các luận điểm, lý lẽ.",
    "correct": "Sự việc và nhân vật.",
    "explain": "Tự sự là kể chuyện, nên cốt lõi phải có sự việc xảy ra (cốt truyện) và người thực hiện sự việc đó (nhân vật)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Câu thơ 'Thuyền về có nhớ bến chăng / Bến thì một dạ khăng khăng đợi thuyền' sử dụng biện pháp tu từ gì?",
    "a": "So sánh.",
    "b": "Nhân hóa và Ẩn dụ.",
    "c": "Hoán dụ.",
    "d": "Điệp ngữ.",
    "correct": "Nhân hóa và Ẩn dụ.",
    "explain": "'Thuyền' và 'bến' được nhân hóa (biết nhớ, biết đợi) và là ẩn dụ cho người đi xa và người ở lại."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong truyện cổ tích 'Cây khế', người anh trai có tính cách như thế nào?",
    "a": "Tham lam, ích kỷ.",
    "b": "Hiền lành, chăm chỉ.",
    "c": "Thông minh, mưu trí.",
    "d": "Dũng cảm, hào hiệp.",
    "correct": "Tham lam, ích kỷ.",
    "explain": "Người anh chiếm hết gia tài, khi thấy em giàu thì đổi nhà lấy cây khế và may túi 12 gang để đựng vàng vì tham lam."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Động từ là những từ chỉ điều gì?",
    "a": "Chỉ người, vật, hiện tượng.",
    "b": "Chỉ hoạt động, trạng thái của sự vật.",
    "c": "Chỉ tính chất của sự vật.",
    "d": "Chỉ số lượng.",
    "correct": "Chỉ hoạt động, trạng thái của sự vật.",
    "explain": "Ví dụ: đi, chạy, ngủ, ăn, bay, lượn..."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Tâm trạng của anh đội viên trong bài thơ 'Đêm nay Bác không ngủ' thay đổi như thế nào?",
    "a": "Từ lo lắng đến tức giận.",
    "b": "Từ ngạc nhiên, lo lắng đến xúc động, niềm vui sướng và hạnh phúc.",
    "c": "Từ sợ hãi đến an tâm.",
    "d": "Luôn luôn lo lắng không yên.",
    "correct": "Từ ngạc nhiên, lo lắng đến xúc động, niềm vui sướng và hạnh phúc.",
    "explain": "Lần 1 anh lo lắng mời Bác ngủ. Lần 3 anh 'vui sướng' khi hiểu được tấm lòng mênh mông của Bác và thức luôn cùng Bác."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Khi làm bài văn tả người, chi tiết nào KHÔNG cần thiết phải đưa vào?",
    "a": "Ngoại hình (khuôn mặt, mái tóc...).",
    "b": "Trang phục.",
    "c": "Số lượng bát cơm người đó ăn mỗi bữa.",
    "d": "Tính tình, hoạt động.",
    "correct": "Số lượng bát cơm người đó ăn mỗi bữa.",
    "explain": "Trừ khi chi tiết này phục vụ mục đích làm nổi bật tính cách đặc biệt, còn lại nó quá vụn vặt và không mang tính điển hình cho chân dung nhân vật."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong các từ sau, từ nào là từ ghép Hán Việt?",
    "a": "Sơn hà.",
    "b": "Núi sông.",
    "c": "Đất nước.",
    "d": "Nhà cửa.",
    "correct": "Sơn hà.",
    "explain": "'Sơn' (núi) và 'Hà' (sông) đều là yếu tố Hán Việt."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong 'Sông nước Cà Mau', hình ảnh 'những bãi bùn, những rừng mắm, rừng đước' gợi lên đặc điểm gì của vùng đất này?",
    "a": "Sự khô cằn, hoang vắng.",
    "b": "Sự trù phú, hoang sơ và rộng lớn.",
    "c": "Sự đông đúc, nhộn nhịp của phố thị.",
    "d": "Sự ô nhiễm môi trường.",
    "correct": "Sự trù phú, hoang sơ và rộng lớn.",
    "explain": "Đoàn Giỏi miêu tả thiên nhiên Cà Mau với màu xanh bất tận của cây cối và sự bồi đắp phù sa màu mỡ."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Câu văn: 'Những bông hoa nở tung cánh, mịn màng và thơm ngát' sử dụng nhiều loại từ nào?",
    "a": "Danh từ.",
    "b": "Động từ.",
    "c": "Tính từ.",
    "d": "Số từ.",
    "correct": "Tính từ.",
    "explain": "'Mịn màng', 'thơm ngát' là các tính từ miêu tả tính chất của bông hoa."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Chi tiết 'ngựa sắt, roi sắt, áo giáp sắt' trong truyền thuyết Thánh Gióng thể hiện điều gì?",
    "a": "Sự giàu có của nhà vua.",
    "b": "Sự tiến bộ về kỹ thuật chế tác kim loại (thời đại đồ sắt) của người Việt cổ.",
    "c": "Sức mạnh phép thuật của Gióng.",
    "d": "Ngựa thật không đủ sức chở Gióng.",
    "correct": "Sự tiến bộ về kỹ thuật chế tác kim loại (thời đại đồ sắt) của người Việt cổ.",
    "explain": "Ngoài ý nghĩa thần kỳ, chi tiết này còn phản ánh dấu ấn lịch sử về thành tựu văn hóa vật chất thời Hùng Vương."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Câu nghi vấn có chức năng chính là gì?",
    "a": "Dùng để kể lại sự việc.",
    "b": "Dùng để bộc lộ cảm xúc.",
    "c": "Dùng để hỏi.",
    "d": "Dùng để yêu cầu.",
    "correct": "Dùng để hỏi.",
    "explain": "Câu nghi vấn (câu hỏi) dùng để tìm kiếm thông tin chưa biết, thường kết thúc bằng dấu chấm hỏi."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Ý nghĩa của hình tượng bánh chưng, bánh giầy là gì?",
    "a": "Thể hiện lòng biết ơn trời đất và tổ tiên.",
    "b": "Đề cao nghề nông trồng lúa nước.",
    "c": "Thể hiện sự sáng tạo của người lao động.",
    "d": "Cả a, b và c.",
    "correct": "Cả a, b và c.",
    "explain": "Bánh giầy tượng trưng cho Trời, bánh chưng tượng trưng cho Đất, được làm từ hạt gạo - sản phẩm quý nhất của nghề nông, dâng lên tổ tiên để tỏ lòng hiếu kính."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Từ 'Thiên' trong từ nào sau đây có nghĩa là 'Nghìn'?",
    "a": "Thiên nhiên.",
    "b": "Thiên hạ.",
    "c": "Thiên niên kỷ.",
    "d": "Thiên vị.",
    "correct": "Thiên niên kỷ.",
    "explain": "'Thiên niên kỷ' nghĩa là một nghìn năm. Các từ còn lại: Thiên nhiên/Thiên hạ (Thiên = Trời), Thiên vị (Thiên = Nghiêng lệch)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Sau cái chết của Dế Choắt, Dế Mèn đã rút ra bài học gì?",
    "a": "Phải ăn uống điều độ để khỏe mạnh.",
    "b": "Thói hung hăng, hống hách chỉ mang vạ vào thân.",
    "c": "Không nên chơi với những người yếu ớt.",
    "d": "Phải biết đào hang sâu để trốn tránh kẻ thù.",
    "correct": "Thói hung hăng, hống hách chỉ mang vạ vào thân.",
    "explain": "Dế Mèn hối hận vì trò đùa ác ý của mình đã gây ra cái chết oan ức cho Dế Choắt, từ đó nhận ra bài học đường đời đầu tiên về sự khiêm tốn và nhân ái."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Tác dụng của biện pháp nhân hóa trong câu: 'Trâu ơi ta bảo trâu này / Trâu ra ngoài ruộng trâu cày với ta' là gì?",
    "a": "Làm cho con trâu trở nên đáng sợ.",
    "b": "Biến con trâu thành người bạn thân thiết, gần gũi với người nông dân.",
    "c": "Để ra lệnh cho con trâu làm việc.",
    "d": "Để khoe khoang con trâu biết nghe tiếng người.",
    "correct": "Biến con trâu thành người bạn thân thiết, gần gũi với người nông dân.",
    "explain": "Cách xưng hô, trò chuyện tâm tình khiến con vật trở nên có hồn, chia sẻ nỗi vất vả với người nông dân."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Số từ là những từ chỉ điều gì?",
    "a": "Chỉ số lượng và thứ tự của sự vật.",
    "b": "Chỉ tính chất của sự vật.",
    "c": "Chỉ hoạt động của sự vật.",
    "d": "Chỉ tên gọi của sự vật.",
    "correct": "Chỉ số lượng và thứ tự của sự vật.",
    "explain": "Ví dụ: một, hai, ba (số lượng); thứ nhất, thứ nhì (thứ tự)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong văn bản 'Cô Tô', cảnh mặt trời mọc được so sánh với hình ảnh nào?",
    "a": "Một quả cầu lửa.",
    "b": "Lòng đỏ một quả trứng thiên nhiên đầy đặn.",
    "c": "Một chiếc mâm vàng.",
    "d": "Một ngọn đèn hải đăng.",
    "correct": "Lòng đỏ một quả trứng thiên nhiên đầy đặn.",
    "explain": "Đây là một so sánh độc đáo, tinh tế của Nguyễn Tuân, gợi lên vẻ đẹp tròn trịa, phúc hậu và đầy sức sống của mặt trời biển đảo."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Đại từ dùng để làm gì?",
    "a": "Để chỉ sự vật, hoạt động, tính chất.",
    "b": "Để trỏ người, sự vật, hoạt động, tính chất hoặc để hỏi.",
    "c": "Để nối các từ ngữ với nhau.",
    "d": "Để bộc lộ cảm xúc.",
    "correct": "Để trỏ người, sự vật, hoạt động, tính chất hoặc để hỏi.",
    "explain": "Ví dụ: tôi, tao, tớ (trỏ người); bao nhiêu, ai, gì (để hỏi)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Truyện ngụ ngôn 'Đeo nhạc cho mèo' phê phán loại người nào trong xã hội?",
    "a": "Người dũng cảm, dám nghĩ dám làm.",
    "b": "Người hay lo xa.",
    "c": "Người chỉ biết nói suông, bàn kế hoạch viển vông nhưng không dám thực hiện.",
    "d": "Người thông minh, mưu mẹo.",
    "correct": "Người chỉ biết nói suông, bàn kế hoạch viển vông nhưng không dám thực hiện.",
    "explain": "Hội đồng chuột bàn tán rất hay về việc đeo nhạc để tránh mèo, nhưng đến khi thực hiện thì ai cũng đùn đẩy vì sợ chết."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Dấu chấm lửng (...) KHÔNG có tác dụng nào sau đây?",
    "a": "Tỏ ý còn nhiều sự vật, hiện tượng chưa liệt kê hết.",
    "b": "Thể hiện chỗ lời nói bỏ dở hay ngập ngừng, ngắt quãng.",
    "c": "Kết thúc một câu trần thuật.",
    "d": "Làm giãn nhịp điệu câu văn, chuẩn bị cho sự xuất hiện của một từ ngữ bất ngờ.",
    "correct": "Kết thúc một câu trần thuật.",
    "explain": "Kết thúc câu trần thuật phải là dấu chấm (.). Dấu chấm lửng dùng để biểu thị ý chưa hết hoặc cảm xúc đặc biệt."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Nhân vật Phrăng trong 'Buổi học cuối cùng' cảm thấy thế nào khi biết tin sẽ không còn được học tiếng Pháp nữa?",
    "a": "Vui mừng vì không phải đi học.",
    "b": "Thờ ơ, không quan tâm.",
    "c": "Ân hận, tiếc nuối và trân trọng tiếng mẹ đẻ.",
    "d": "Tức giận với thầy giáo.",
    "correct": "Ân hận, tiếc nuối và trân trọng tiếng mẹ đẻ.",
    "explain": "Sự kiện này là cú sốc khiến Phrăng thay đổi nhận thức, từ cậu bé ham chơi trở nên hiểu chuyện và yêu nước."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trạng ngữ trong câu 'Vì sương mù, máy bay không thể cất cánh' chỉ ý nghĩa gì?",
    "a": "Chỉ thời gian.",
    "b": "Chỉ nơi chốn.",
    "c": "Chỉ nguyên nhân.",
    "d": "Chỉ mục đích.",
    "correct": "Chỉ nguyên nhân.",
    "explain": "Từ 'Vì' là dấu hiệu nhận biết trạng ngữ chỉ nguyên nhân, giải thích lý do cho sự việc nêu ở vế sau."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Câu ca dao: 'Công cha như núi Thái Sơn / Nghĩa mẹ như nước trong nguồn chảy ra' nói về chủ đề gì?",
    "a": "Tình yêu đôi lứa.",
    "b": "Tình cảm gia đình (công ơn cha mẹ).",
    "c": "Tình yêu quê hương đất nước.",
    "d": "Than thân trách phận.",
    "correct": "Tình cảm gia đình (công ơn cha mẹ).",
    "explain": "Đây là bài ca dao tiêu biểu nhất giáo dục về lòng hiếu thảo và công lao to lớn của cha mẹ."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Cặp từ nào sau đây là từ đồng nghĩa?",
    "a": "Chăm chỉ - Lười biếng.",
    "b": "Mênh mông - Bát ngát.",
    "c": "Chạy - Nhảy.",
    "d": "Ăn - Uống.",
    "correct": "Mênh mông - Bát ngát.",
    "explain": "Cả hai từ đều chỉ độ rộng lớn của không gian, có thể thay thế cho nhau trong nhiều trường hợp."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Biện pháp tu từ nói quá (phóng đại) có tác dụng gì?",
    "a": "Làm giảm nhẹ mức độ của sự việc.",
    "b": "Nhấn mạnh quy mô, tính chất của sự vật, hiện tượng, gây ấn tượng mạnh.",
    "c": "Làm cho câu văn trở nên khó hiểu.",
    "d": "So sánh hai sự vật với nhau.",
    "correct": "Nhấn mạnh quy mô, tính chất của sự vật, hiện tượng, gây ấn tượng mạnh.",
    "explain": "Ví dụ: 'Buồn nẫu ruột', 'Khỏe như voi' - phóng đại để người nghe cảm nhận rõ mức độ."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Văn bản 'Hang Én' (Hà My) thuộc thể loại nào?",
    "a": "Truyện ngắn.",
    "b": "Ký (Du ký).",
    "c": "Thơ.",
    "d": "Tiểu thuyết.",
    "correct": "Ký (Du ký).",
    "explain": "Văn bản ghi chép lại chuyến hành trình khám phá vẻ đẹp kỳ vĩ của Hang Én (Quảng Bình) một cách chân thực."
  },
  
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Dấu hai chấm (:) trong câu sau có tác dụng gì: 'Cảnh vật xung quanh tôi đang có sự thay đổi lớn: hôm nay tôi đi học.'?",
    "a": "Báo hiệu lời nói trực tiếp của nhân vật.",
    "b": "Báo hiệu phần giải thích cho bộ phận đứng trước.",
    "c": "Báo hiệu một sự liệt kê.",
    "d": "Ngăn cách các vế trong câu ghép.",
    "correct": "Báo hiệu phần giải thích cho bộ phận đứng trước.",
    "explain": "Vế sau 'hôm nay tôi đi học' giải thích rõ lý do vì sao 'cảnh vật có sự thay đổi lớn'."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Văn bản thông tin (như bài giới thiệu về Hồ Gươm, Lễ hội Đền Hùng...) có mục đích chính là gì?",
    "a": "Bộc lộ cảm xúc của người viết.",
    "b": "Kể lại một câu chuyện tưởng tượng.",
    "c": "Cung cấp thông tin xác thực về một sự vật, hiện tượng hoặc sự kiện.",
    "d": "Tranh luận về một vấn đề xã hội.",
    "correct": "Cung cấp thông tin xác thực về một sự vật, hiện tượng hoặc sự kiện.",
    "explain": "Đặc trưng của văn bản thông tin là tính chính xác, khách quan, nhằm cung cấp tri thức cho người đọc."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong truyện cổ tích 'Vua chích chòe' (Grimm), nàng công chúa đã học được bài học gì sau khi trải qua cuộc sống nghèo khó?",
    "a": "Phải biết tiết kiệm tiền bạc.",
    "b": "Không nên kiêu căng, ngạo mạn, coi thường người khác.",
    "c": "Không nên lấy chồng xa.",
    "d": "Phải biết nấu ăn ngon.",
    "correct": "Không nên kiêu căng, ngạo mạn, coi thường người khác.",
    "explain": "Sự ngông cuồng, chế giễu người khác của công chúa đã bị trừng phạt bằng những ngày tháng lao động vất vả, từ đó nàng mới biết trân trọng giá trị con người."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Cặp từ nào sau đây là cặp từ trái nghĩa?",
    "a": "Tươi - Đẹp.",
    "b": "Cứng - Rắn.",
    "c": "Nông - Sâu.",
    "d": "Học - Hành.",
    "correct": "Nông - Sâu.",
    "explain": "Nông và Sâu là hai từ có nghĩa đối lập nhau về chiều sâu không gian."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Khi viết bài văn kể lại một trải nghiệm của bản thân, người viết cần sử dụng ngôi kể nào?",
    "a": "Ngôi thứ nhất (xưng tôi/em).",
    "b": "Ngôi thứ ba (giấu mình).",
    "c": "Ngôi thứ hai (bạn).",
    "d": "Kết hợp nhiều ngôi kể.",
    "correct": "Ngôi thứ nhất (xưng tôi/em).",
    "explain": "Kể trải nghiệm của chính mình thì phải dùng ngôi thứ nhất để bộc lộ trực tiếp suy nghĩ, cảm xúc chân thực."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong truyện 'Giọt sương đêm' (Trần Đức Tiến), vì sao Bọ Dừa quyết định trở về quê nhà sau một đêm ngủ trọ?",
    "a": "Vì Bọ Dừa không tìm được thức ăn.",
    "b": "Vì Bọ Dừa bị Thằn Lằn đe dọa.",
    "c": "Vì giọt sương rơi trúng cổ làm Bọ Dừa tỉnh giấc và sực nhớ quê nhà.",
    "d": "Vì Bọ Dừa ghét Xóm Bờ Giậu.",
    "correct": "Vì giọt sương rơi trúng cổ làm Bọ Dừa tỉnh giấc và sực nhớ quê nhà.",
    "explain": "Cái lạnh của giọt sương đêm đã đánh thức nỗi nhớ quê hương da diết trong lòng người khách xa xứ."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Thành ngữ 'Nhanh như cắt' sử dụng biện pháp tu từ nào?",
    "a": "Nhân hóa.",
    "b": "So sánh.",
    "c": "Ẩn dụ.",
    "d": "Điệp ngữ.",
    "correct": "So sánh.",
    "explain": "Dùng từ 'như' để đối chiếu tốc độ hoạt động của con người/sự vật với con chim cắt (loài chim bay rất nhanh)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Trong câu: 'Học sinh cần phải chăm chỉ, ngoan ngoãn.', dấu phẩy có tác dụng gì?",
    "a": "Ngăn cách các thành phần cùng chức vụ (cùng là vị ngữ/tính từ).",
    "b": "Ngăn cách chủ ngữ và vị ngữ.",
    "c": "Ngăn cách trạng ngữ với nòng cốt câu.",
    "d": "Kết thúc câu.",
    "correct": "Ngăn cách các thành phần cùng chức vụ (cùng là vị ngữ/tính từ).",
    "explain": "'Chăm chỉ' và 'ngoan ngoãn' đều là tính từ chỉ phẩm chất, giữ chức vụ giống nhau trong câu nên được ngăn cách bằng dấu phẩy."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Hình ảnh 'Con chim chiền chiện / Bay vút, vút cao' trong bài thơ của Thanh Hải gợi lên cảm xúc gì?",
    "a": "Nỗi buồn man mác.",
    "b": "Sự sợ hãi trước thiên nhiên.",
    "c": "Niềm vui sướng, hân hoan trước vẻ đẹp của mùa xuân.",
    "d": "Sự tiếc nuối quá khứ.",
    "correct": "Niềm vui sướng, hân hoan trước vẻ đẹp của mùa xuân.",
    "explain": "Hình ảnh chim bay cao và tiếng hót vang trời thể hiện sức sống mãnh liệt và niềm yêu đời thiết tha."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "medium",
    "content": "Mục đích cuối cùng của việc học môn Ngữ Văn là gì?",
    "a": "Chỉ để viết đúng chính tả.",
    "b": "Chỉ để biết kể chuyện.",
    "c": "Để bồi dưỡng tâm hồn, hình thành nhân cách và năng lực sử dụng ngôn ngữ.",
    "d": "Để giải trí sau giờ học toán.",
    "correct": "Để bồi dưỡng tâm hồn, hình thành nhân cách và năng lực sử dụng ngôn ngữ.",
    "explain": "Văn học là nhân học. Học văn là học làm người và học cách giao tiếp, cảm thụ cái đẹp."
  }
]