[
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyền thuyết 'Thánh Gióng', chi tiết Gióng nhổ tre bên đường đánh giặc khi roi sắt gãy mang ý nghĩa biểu tượng sâu sắc nhất là gì?",
    "a": "Thể hiện sức mạnh phi thường, không gì ngăn cản nổi của người anh hùng.",
    "b": "Khẳng định tinh thần sáng tạo, tận dụng mọi vũ khí thô sơ nhất của thiên nhiên đất nước để chống ngoại xâm.",
    "c": "Chứng tỏ vũ khí bằng sắt của người Việt cổ chưa thực sự bền tốt.",
    "d": "Cho thấy sự nóng nảy và quyết liệt của tráng sĩ Gióng.",
    "correct": "Khẳng định tinh thần sáng tạo, tận dụng mọi vũ khí thô sơ nhất của thiên nhiên đất nước để chống ngoại xâm.",
    "explain": "Đây là ý nghĩa biểu tượng cao nhất: kết hợp giữa sức mạnh thần kỳ (Thánh) và sức mạnh của cây cỏ quê hương, tinh thần 'giặc đến nhà đàn bà cũng đánh', dùng mọi thứ có sẵn để cứu nước."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Điểm khác biệt căn bản nhất về mục đích sáng tác giữa 'Truyền thuyết' và 'Truyện cổ tích' là gì?",
    "a": "Truyền thuyết dùng để giải trí, Cổ tích dùng để giáo dục.",
    "b": "Truyền thuyết thể hiện thái độ và cách đánh giá của nhân dân về các sự kiện/nhân vật lịch sử; Cổ tích thể hiện ước mơ về công lý và hạnh phúc.",
    "c": "Truyền thuyết kể về thần thánh, Cổ tích kể về người thường.",
    "d": "Truyền thuyết có kết thúc bi thảm, Cổ tích có kết thúc có hậu.",
    "correct": "Truyền thuyết thể hiện thái độ và cách đánh giá của nhân dân về các sự kiện/nhân vật lịch sử; Cổ tích thể hiện ước mơ về công lý và hạnh phúc.",
    "explain": "Truyền thuyết bám vào 'cốt lõi lịch sử' để tôn vinh/giải thích sự kiện dân tộc. Cổ tích hư cấu đời sống để gửi gắm khát vọng công bằng xã hội."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyện 'Sự tích Hồ Gươm', tại sao Đức Long Quân không trao gươm ngay cho Lê Lợi mà lại để Lê Thận nhặt được lưỡi gươm dưới nước, còn Lê Lợi lấy được chuôi gươm trên rừng?",
    "a": "Để thử thách lòng kiên nhẫn của Lê Lợi xem có xứng đáng làm minh chủ không.",
    "b": "Để khẳng định tính chất toàn dân của cuộc khởi nghĩa: sức mạnh đoàn kết giữa miền xuôi và miền ngược, giữa chủ tướng và quân dân.",
    "c": "Vì Đức Long Quân muốn giấu gươm kĩ để quân Minh không tìm thấy.",
    "d": "Vì gươm thần quá nặng, cần phải chia nhỏ ra mới vận chuyển được.",
    "correct": "Để khẳng định tính chất toàn dân của cuộc khởi nghĩa: sức mạnh đoàn kết giữa miền xuôi và miền ngược, giữa chủ tướng và quân dân.",
    "explain": "Lưỡi gươm dưới nước (nhân dân miền xuôi/biển), chuôi gươm trên rừng (nhân dân miền núi). Gươm ghép lại vừa như in tượng trưng cho sự đồng lòng, đoàn kết non sông."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Câu văn nào sau đây sử dụng biện pháp tu từ 'Ẩn dụ chuyển đổi cảm giác'?",
    "a": "Ngoài thềm rơi chiếc lá đa / Tiếng rơi rất mỏng như là rơi nghiêng.",
    "b": "Mặt trời của bắp thì nằm trên đồi / Mặt trời của mẹ em nằm trên lưng.",
    "c": "Cha lại dắt con đi trên cát mịn / Ánh nắng chảy đầy vai.",
    "d": "Những ngôi sao thức ngoài kia / Chẳng bằng mẹ đã thức vì chúng con.",
    "correct": "Cha lại dắt con đi trên cát mịn / Ánh nắng chảy đầy vai.",
    "explain": "'Ánh nắng' (thị giác) được cảm nhận như chất lỏng có thể 'chảy' (xúc giác) -> Chuyển đổi cảm giác từ thị giác sang xúc giác."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Xét về sắc thái nghĩa, từ Hán Việt 'Phụ nữ' khác với từ thuần Việt 'Đàn bà' ở điểm nào?",
    "a": "'Phụ nữ' mang sắc thái trang trọng, khái quát; 'Đàn bà' mang sắc thái đời thường, cụ thể, đôi khi suồng sã.",
    "b": "'Phụ nữ' chỉ người già, 'Đàn bà' chỉ người trẻ.",
    "c": "'Phụ nữ' chỉ người có địa vị, 'Đàn bà' chỉ người lao động.",
    "d": "Hai từ này hoàn toàn giống nhau, có thể thay thế trong mọi trường hợp.",
    "correct": "'Phụ nữ' mang sắc thái trang trọng, khái quát; 'Đàn bà' mang sắc thái đời thường, cụ thể, đôi khi suồng sã.",
    "explain": "Trong các văn bản hành chính hoặc tôn vinh (như ngày 8/3), ta dùng 'Phụ nữ'. Trong giao tiếp sinh hoạt thân mật hoặc khẩu ngữ, ta dùng 'Đàn bà'. Dùng sai phong cách sẽ gây phản cảm."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyện ngụ ngôn 'Ếch ngồi đáy giếng', nguyên nhân sâu xa dẫn đến cái chết của con ếch là gì?",
    "a": "Do con trâu đi qua vô tình giẫm phải.",
    "b": "Do chiếc giếng bị phá hủy nên ếch mất môi trường sống.",
    "c": "Do thói chủ quan, kiêu ngạo và sự hạn hẹp về tầm nhìn (bệnh ảo tưởng) được hình thành từ môi trường sống khép kín quá lâu.",
    "d": "Do ếch không biết bơi khi ra ngoài ruộng.",
    "correct": "Do thói chủ quan, kiêu ngạo và sự hạn hẹp về tầm nhìn (bệnh ảo tưởng) được hình thành từ môi trường sống khép kín quá lâu.",
    "explain": "Cái chết do trâu giẫm chỉ là hệ quả. Nguyên nhân gốc rễ là tư duy 'coi trời bằng vung', không chịu thay đổi nhận thức khi hoàn cảnh sống thay đổi."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong văn bản 'Bài học đường đời đầu tiên', việc Tô Hoài miêu tả ngoại hình Dế Mèn rất đẹp, cường tráng ở đoạn đầu có tác dụng gì đối với việc xây dựng nhân vật?",
    "a": "Để ca ngợi vẻ đẹp của loài vật.",
    "b": "Tạo sự tương phản (đòn bẩy) để làm nổi bật tính cách kiêu căng, xốc nổi và bài học đắt giá về sau.",
    "c": "Để Dế Mèn xứng đáng làm chúa tể đầm lầy.",
    "d": "Để người đọc thấy Dế Mèn không có lỗi gì cả.",
    "correct": "Tạo sự tương phản (đòn bẩy) để làm nổi bật tính cách kiêu căng, xốc nổi và bài học đắt giá về sau.",
    "explain": "Ngoại hình đẹp nhưng tâm tính chưa tốt. Sự tương phản này nhấn mạnh rằng: vẻ đẹp hình thức không thay thế được vẻ đẹp nhân cách; sức dài vai rộng mà thiếu suy nghĩ thì chỉ gây họa."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Nhận xét nào đúng nhất về nghệ thuật kể chuyện trong 'Bức tranh của em gái tôi' (Tạ Duy Anh)?",
    "a": "Ngôi kể thứ ba giúp câu chuyện khách quan, bao quát toàn bộ sự việc.",
    "b": "Ngôi kể thứ nhất (người em) giúp bộc lộ rõ tài năng hội họa.",
    "c": "Ngôi kể thứ nhất (người anh) giúp miêu tả chân thực, tinh tế diễn biến tâm lý phức tạp (từ ghen tị đến hối hận) của nhân vật.",
    "d": "Kết hợp nhiều ngôi kể để tạo sự đa chiều.",
    "correct": "Ngôi kể thứ nhất (người anh) giúp miêu tả chân thực, tinh tế diễn biến tâm lý phức tạp (từ ghen tị đến hối hận) của nhân vật.",
    "explain": "Việc để người anh tự kể (người có lỗi) khiến sự sám hối trở nên chân thành và bài học đạo đức trở nên thấm thía, không giáo điều."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Hai câu thơ: 'Bác già, bác yếu, bác đi / Bác đi đâu thế, bác vi... việc gì?' (Lượm) sử dụng biện pháp tu từ nào và có tác dụng gì?",
    "a": "Điệp từ, diễn tả sự dồn dập của hành động.",
    "b": "Nói giảm nói tránh, để giảm bớt sự đau thương.",
    "c": "Câu hỏi tu từ và ngắt nhịp ngập ngừng, diễn tả sự ngây thơ, hồn nhiên và hóm hỉnh của chú bé Lượm.",
    "d": "Nhân hóa, làm cho hình ảnh Bác trở nên gần gũi.",
    "correct": "Câu hỏi tu từ và ngắt nhịp ngập ngừng, diễn tả sự ngây thơ, hồn nhiên và hóm hỉnh của chú bé Lượm.",
    "explain": "Cách ngắt nhịp 'vi... việc gì' mô phỏng giọng điệu ngập ngừng, tinh nghịch, bắt chước người già của trẻ con, khắc họa tính cách Lượm."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong câu: 'Tre xung phong vào xe tăng, đại bác. Tre giữ làng, giữ nước...', biện pháp Nhân hóa được thực hiện bằng cách nào?",
    "a": "Dùng từ ngữ chỉ người để gọi vật.",
    "b": "Dùng từ ngữ chỉ hoạt động, tính chất của người để chỉ vật.",
    "c": "Trò chuyện với vật như với người.",
    "d": "Dùng từ ngữ chỉ bộ phận con người để chỉ bộ phận của vật.",
    "correct": "Dùng từ ngữ chỉ hoạt động, tính chất của người để chỉ vật.",
    "explain": "'Xung phong', 'giữ' là những hành động có ý thức của con người, nay được gán cho cây tre để làm nổi bật phẩm chất anh hùng."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Ý nghĩa triết lý nhân sinh trong truyện cổ tích 'Sọ Dừa' là gì?",
    "a": "Người thông minh luôn chiến thắng kẻ ngu dốt.",
    "b": "Đề cao giá trị chân chính của con người: cái đẹp bên trong (phẩm chất, tài năng) quan trọng hơn hình thức bên ngoài.",
    "c": "Khuyên người ta không nên chăn bò thuê.",
    "d": "Phê phán xã hội phong kiến trọng nam khinh nữ.",
    "correct": "Đề cao giá trị chân chính của con người: cái đẹp bên trong (phẩm chất, tài năng) quan trọng hơn hình thức bên ngoài.",
    "explain": "Hình hài dị dạng của Sọ Dừa đối lập với tài năng và tấm lòng của chàng là minh chứng cho quan niệm 'tốt gỗ hơn tốt nước sơn' của dân gian."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong văn bản 'Cô Tô', tại sao Nguyễn Tuân lại so sánh mặt trời mọc với 'lòng đỏ một quả trứng thiên nhiên đầy đặn'?",
    "a": "Vì mặt trời có màu đỏ và hình tròn.",
    "b": "Vì tác giả đang đói bụng.",
    "c": "Để gợi tả vẻ đẹp trù phú, tinh khôi, chứa chan sự sống và sự toàn vẹn, phúc hậu của thiên nhiên biển đảo.",
    "d": "Vì đây là cách so sánh phổ biến nhất trong văn học.",
    "correct": "Để gợi tả vẻ đẹp trù phú, tinh khôi, chứa chan sự sống và sự toàn vẹn, phúc hậu của thiên nhiên biển đảo.",
    "explain": "So sánh này cực kỳ độc đáo (đặc trưng Nguyễn Tuân), không chỉ tả màu/hình khối mà còn gợi cảm giác về sự sinh sôi, nảy nở, sự viên mãn của thiên nhiên."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Câu văn nào sau đây mắc lỗi 'Quan hệ từ không phù hợp'?",
    "a": "Tuy nhà xa nhưng Nam vẫn đi học đúng giờ.",
    "b": "Vì trời mưa nên đường rất trơn.",
    "c": "Tuy Nam thông minh nhưng bạn ấy rất lười học.",
    "d": "Mặc dù bị ốm nhưng Lan vẫn đi học, tuy nhiên bài kiểm tra lại bị điểm kém.",
    "correct": "Mặc dù bị ốm nhưng Lan vẫn đi học, tuy nhiên bài kiểm tra lại bị điểm kém.",
    "explain": "Dùng thừa và rối quan hệ từ ('Mặc dù... nhưng...', rồi lại 'tuy nhiên...'). Nên sửa thành: 'Mặc dù bị ốm nhưng Lan vẫn đi học, tiếc là bài kiểm tra lại bị điểm kém.' hoặc tách câu."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong bài thơ 'Đêm nay Bác không ngủ', khổ thơ kết 'Đêm nay Bác ngồi đó / Đêm nay Bác không ngủ / Vì một lẽ thường tình / Bác là Hồ Chí Minh' có ý nghĩa gì?",
    "a": "Giải thích lý do Bác không ngủ là do thói quen.",
    "b": "Khẳng định chân lý: Sự hy sinh, lo lắng cho dân tộc đã trở thành nếp sống tự nhiên, là bản chất vĩ đại của Bác.",
    "c": "Thông báo tên thật của Bác cho người đọc.",
    "d": "Kết thúc câu chuyện về một đêm không ngủ cụ thể.",
    "correct": "Khẳng định chân lý: Sự hy sinh, lo lắng cho dân tộc đã trở thành nếp sống tự nhiên, là bản chất vĩ đại của Bác.",
    "explain": "'Lẽ thường tình' nâng tầm vóc lãnh tụ: Việc Bác thức không phải là ngoại lệ, mà là quy luật, là lẽ sống của Người. Cái vĩ đại trở nên giản dị, gần gũi."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Đặc điểm nào của nhân vật Dượng Hương Thư trong 'Vượt thác' thể hiện rõ nhất bút pháp 'tả người để tả cảnh'?",
    "a": "Ngoại hình gân guốc, bắp thịt cuồn cuộn.",
    "b": "Động tác thả sào, rút sào nhanh như cắt.",
    "c": "Hình ảnh Dượng Hương Thư ghì chặt đầu sào làm nổi bật sức nước dữ dội và sự hiểm trở của khúc sông.",
    "d": "Tiếng thở của Dượng Hương Thư.",
    "correct": "Hình ảnh Dượng Hương Thư ghì chặt đầu sào làm nổi bật sức nước dữ dội và sự hiểm trở của khúc sông.",
    "explain": "Tác giả không tả trực tiếp dòng nước chảy mạnh thế nào, mà qua tư thế 'ghì chặt', 'bắp thịt cuồn cuộn' của con người để phản chiếu sức mạnh thiên nhiên."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong câu: 'Những ngọn điện trên quảng trường lung linh như những ngôi sao trong câu chuyện cổ tích nói về những xứ sở thần tiên', cụm từ nào là Thành phần Phụ chú?",
    "a": "trên quảng trường.",
    "b": "như những ngôi sao.",
    "c": "trong câu chuyện cổ tích nói về những xứ sở thần tiên.",
    "d": "Không có thành phần phụ chú.",
    "correct": "Không có thành phần phụ chú.",
    "explain": "Đây là câu đơn bình thường có cụm danh từ mở rộng và phép so sánh. Không có bộ phận nào nằm giữa hai dấu gạch ngang, hai dấu phẩy (mang tính giải thích chêm xen) để gọi là phụ chú."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Tại sao trong truyện 'Thạch Sanh', Lý Thông lại được xây dựng là nhân vật cùng làm nghề tiều phu hoặc buôn rượu (tầng lớp lao động) chứ không phải quan lại?",
    "a": "Để cho câu chuyện thực tế hơn.",
    "b": "Để phản ánh sự thật: Cái ác, sự lừa lọc có thể tồn tại ngay trong những người gần gũi nhất, cùng tầng lớp với mình.",
    "c": "Vì tác giả dân gian ghét người buôn rượu.",
    "d": "Vì Lý Thông nghèo.",
    "correct": "Để phản ánh sự thật: Cái ác, sự lừa lọc có thể tồn tại ngay trong những người gần gũi nhất, cùng tầng lớp với mình.",
    "explain": "Điều này làm tăng tính răn đe và bi kịch: sự phản bội đến từ người anh em kết nghĩa, người cùng cảnh ngộ, khiến chiến thắng của Thạch Sanh càng thêm ý nghĩa (lấy ân báo oán)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Biện pháp tu từ Điệp ngữ trong đoạn thơ: 'Cháu chiến đấu hôm nay / Vì lòng yêu Tổ quốc / Vì xóm làng thân thuộc / Bà ơi, cũng vì bà' (Tiếng gà trưa) có tác dụng gì?",
    "a": "Liệt kê các lý do chiến đấu.",
    "b": "Nhấn mạnh mục đích chiến đấu: Từ tình yêu rộng lớn (Tổ quốc) quy tụ về tình cảm riêng tư, cụ thể, sâu sắc nhất (vì Bà).",
    "c": "Tạo nhịp điệu nhanh cho bài thơ.",
    "d": "Thể hiện sự vâng lời của người cháu.",
    "correct": "Nhấn mạnh mục đích chiến đấu: Từ tình yêu rộng lớn (Tổ quốc) quy tụ về tình cảm riêng tư, cụ thể, sâu sắc nhất (vì Bà).",
    "explain": "Điệp từ 'Vì' nhấn mạnh động lực. Trật tự đi từ cái chung (Tổ quốc) đến cái riêng (Bà) khẳng định: Tình yêu đất nước bắt nguồn từ tình yêu những người thân thuộc nhất."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong văn bản 'Lao xao', việc tác giả đan xen các câu chuyện dân gian, câu đồng dao về các loài chim vào bài văn tả thực có tác dụng gì?",
    "a": "Để khoe kiến thức về văn học dân gian.",
    "b": "Làm cho bài văn dài hơn.",
    "c": "Tạo nên chiều sâu văn hóa, khiến thế giới loài chim không chỉ là đối tượng sinh học mà còn mang hồn cốt, quan niệm của con người Việt Nam.",
    "d": "Để giải thích nguồn gốc các loài chim.",
    "correct": "Tạo nên chiều sâu văn hóa, khiến thế giới loài chim không chỉ là đối tượng sinh học mà còn mang hồn cốt, quan niệm của con người Việt Nam.",
    "explain": "Thế giới tự nhiên trong văn Duy Khán thấm đẫm văn hóa làng quê. Loài chim được nhìn qua lăng kính tâm hồn người Việt (chim báo khách, chim ác...)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Câu nào sau đây mắc lỗi 'Dùng từ không đúng nghĩa'?",
    "a": "Anh ấy là một thương nhân giàu có.",
    "b": "Cô ấy có vẻ đẹp rất tráng lệ.",
    "c": "Tòa lâu đài thật tráng lệ.",
    "d": "Phong cảnh nơi đây thật hùng vĩ.",
    "correct": "Cô ấy có vẻ đẹp rất tráng lệ.",
    "explain": "'Tráng lệ' (to lớn, lộng lẫy) chỉ dùng cho công trình kiến trúc, cảnh vật. Dùng cho vẻ đẹp con người (cô gái) là sai. Nên dùng 'kiều diễm', 'lộng lẫy'..."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyện 'Em bé thông minh', chi tiết em bé dùng cây kim để khâu sợi chỉ qua ruột con ốc có ý nghĩa gì về mặt trí tuệ?",
    "a": "Đề cao kinh nghiệm dân gian thực tế hơn là kiến thức sách vở kinh viện.",
    "b": "Thể hiện sức mạnh của phép thuật.",
    "c": "Cho thấy em bé rất khéo tay.",
    "d": "Chứng minh loài kiến rất thông minh.",
    "correct": "Đề cao kinh nghiệm dân gian thực tế hơn là kiến thức sách vở kinh viện.",
    "explain": "Bài hát đồng dao 'Tang tình tang tính...' chứa đựng kinh nghiệm đời sống giản dị (dùng kiến/mỡ) mà các quan trạng học rộng tài cao không nghĩ ra được."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Sự thay đổi ngôi kể trong một số tác phẩm tự sự (Ví dụ: đang kể ngôi thứ 3 chuyển sang lời nhân vật ngôi thứ 1 hoặc ngược lại) nhằm mục đích gì?",
    "a": "Do tác giả viết nhầm.",
    "b": "Làm cho câu chuyện trở nên khó hiểu để đánh đố người đọc.",
    "c": "Thay đổi điểm nhìn, giúp câu chuyện được soi chiếu từ nhiều góc độ, trở nên sinh động và khách quan hơn.",
    "d": "Để kéo dài độ dài của tác phẩm.",
    "correct": "Thay đổi điểm nhìn, giúp câu chuyện được soi chiếu từ nhiều góc độ, trở nên sinh động và khách quan hơn.",
    "explain": "Việc thay đổi điểm nhìn trần thuật là một thủ pháp nghệ thuật quan trọng, giúp khai thác tâm lý nhân vật sâu hơn hoặc nhìn sự việc toàn diện hơn."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong bài thơ 'Mây và Sóng' (Tagore), câu trả lời của em bé: 'Con là Mây và Mẹ sẽ là Trăng / Hai bàn tay con ôm lấy mẹ, và mái nhà ta sẽ là bầu trời xanh thẳm' thể hiện điều gì?",
    "a": "Em bé muốn biến thành mây thật để bay đi chơi.",
    "b": "Em bé không muốn đi chơi nữa vì sợ mẹ mắng.",
    "c": "Sức mạnh của tình mẫu tử và trí tưởng tượng sáng tạo, biến ngôi nhà bình thường thành vũ trụ kỳ diệu nhất.",
    "d": "Em bé muốn mẹ chơi cùng mình.",
    "correct": "Sức mạnh của tình mẫu tử và trí tưởng tượng sáng tạo, biến ngôi nhà bình thường thành vũ trụ kỳ diệu nhất.",
    "explain": "Em bé không từ chối cuộc vui bằng cách ở nhà buồn chán, mà em sáng tạo ra trò chơi thú vị hơn ngay trong vòng tay mẹ. Tình mẹ con là vĩnh cửu và đẹp hơn mọi cám dỗ."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Văn bản 'Hội thổi cơm thi ở Đồng Vân' thuộc thể loại văn bản gì và cung cấp thông tin chủ yếu về vấn đề gì?",
    "a": "Văn bản tự sự - Kể về cuộc đời các thí sinh.",
    "b": "Văn bản thông tin - Giới thiệu quy tắc và nét đẹp văn hóa của một lễ hội truyền thống.",
    "c": "Văn bản nghị luận - Bàn về việc có nên giữ lễ hội hay không.",
    "d": "Văn bản biểu cảm - Cảm xúc của tác giả về nồi cơm.",
    "correct": "Văn bản thông tin - Giới thiệu quy tắc và nét đẹp văn hóa của một lễ hội truyền thống.",
    "explain": "Mục đích chính là cung cấp tri thức thực tế (quy trình, luật lệ, ý nghĩa) của lễ hội, đặc trưng của văn bản thông tin (thuyết minh)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong câu: 'Những ngọn tre... gọng vó', tác giả Thép Mới đã sử dụng biện pháp tu từ gì để miêu tả hình dáng cây tre?",
    "a": "Nhân hóa.",
    "b": "So sánh và Liệt kê.",
    "c": "Hoán dụ.",
    "d": "Chơi chữ.",
    "correct": "So sánh và Liệt kê.",
    "explain": "Câu đầy đủ thường là 'Những ngọn tre vươn lên như những chiếc gọng vó'. Tác giả dùng hình ảnh quen thuộc của làng quê (gọng vó) để so sánh, gợi hình ảnh thân thuộc."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Chi tiết 'Tiếng đàn' trong truyện Thạch Sanh và 'Niêu cơm thần' có mối liên hệ như thế nào trong việc giải quyết xung đột chiến tranh?",
    "a": "Tiếng đàn là vũ khí tinh thần (thu phục nhân tâm), Niêu cơm là vũ khí vật chất (thu phục dạ dày/sự sống). Cả hai kết hợp tạo nên tư tưởng hòa bình nhân đạo.",
    "b": "Tiếng đàn dùng để giải trí, Niêu cơm dùng để ăn mừng chiến thắng.",
    "c": "Tiếng đàn báo hiệu chiến tranh, Niêu cơm kết thúc chiến tranh.",
    "d": "Hai chi tiết này không liên quan gì nhau.",
    "correct": "Tiếng đàn là vũ khí tinh thần (thu phục nhân tâm), Niêu cơm là vũ khí vật chất (thu phục dạ dày/sự sống). Cả hai kết hợp tạo nên tư tưởng hòa bình nhân đạo.",
    "explain": "Đây là tư tưởng 'Đánh vào lòng người' (Tâm công) của cha ông ta. Làm cho kẻ thù bủn rủn chân tay (Tiếng đàn) và no ấm để không còn muốn đánh nhau (Niêu cơm)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Nếu thay từ 'chen chúc' bằng từ 'đông đúc' trong câu: 'Những con thuyền chen chúc trên bến sông', sắc thái ý nghĩa sẽ thay đổi như thế nào?",
    "a": "Không thay đổi gì.",
    "b": "'Đông đúc' chỉ gợi số lượng nhiều; 'Chen chúc' vừa gợi số lượng nhiều, vừa gợi sự chật chội, lộn xộn, chuyển động va chạm.",
    "c": "'Chen chúc' trang trọng hơn 'Đông đúc'.",
    "d": "'Đông đúc' gợi sự buồn bã.",
    "correct": "'Đông đúc' chỉ gợi số lượng nhiều; 'Chen chúc' vừa gợi số lượng nhiều, vừa gợi sự chật chội, lộn xộn, chuyển động va chạm.",
    "explain": "Từ láy 'chen chúc' có tính gợi hình cao hơn, diễn tả được sự sống động và không khí náo nhiệt, chật chội của bến sông."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong văn bản 'Gió lạnh đầu mùa' (Thạch Lam), hành động Sơn và Lan lén lấy áo bông cũ cho Hiên mặc thể hiện chủ đề gì?",
    "a": "Sự ngây thơ, chưa biết giá trị đồng tiền của trẻ con.",
    "b": "Tình thương người, sự sẻ chia ấm áp giữa con người với con người, không phân biệt giàu nghèo.",
    "c": "Sự sợ hãi vì làm mất đồ của mẹ.",
    "d": "Sự khoe khoang quần áo đẹp.",
    "correct": "Tình thương người, sự sẻ chia ấm áp giữa con người với con người, không phân biệt giàu nghèo.",
    "explain": "Hành động bộc phát tự nhiên từ lòng trắc ẩn của trẻ thơ là điểm sáng nhân văn nhất của tác phẩm, sưởi ấm 'gió lạnh đầu mùa'."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Cụm động từ trong câu: 'đang đùa nghịch ở sau nhà' có cấu trúc như thế nào?",
    "a": "Phần trước (đang) - Phần trung tâm (đùa nghịch) - Phần sau (ở sau nhà).",
    "b": "Phần trung tâm (đang) - Phần sau (đùa nghịch ở sau nhà).",
    "c": "Phần trước (đang đùa nghịch) - Phần sau (ở sau nhà).",
    "d": "Chỉ có phần trung tâm.",
    "correct": "Phần trước (đang) - Phần trung tâm (đùa nghịch) - Phần sau (ở sau nhà).",
    "explain": "'Đang' là phụ ngữ chỉ thời gian (tiếp diễn), 'đùa nghịch' là động từ chính, 'ở sau nhà' là phụ ngữ chỉ địa điểm."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyện 'Thầy bói xem voi', bài học về phương pháp nhận thức (cách nhìn nhận sự việc) quan trọng hơn hay bài học về thái độ lắng nghe (khi các thầy đánh nhau) quan trọng hơn?",
    "a": "Bài học về phương pháp nhận thức (nhìn toàn diện) là cốt lõi.",
    "b": "Bài học về thái độ lắng nghe quan trọng hơn.",
    "c": "Cả hai đều không quan trọng, truyện chỉ để cười.",
    "d": "Việc các thầy đánh nhau là quan trọng nhất.",
    "correct": "Bài học về phương pháp nhận thức (nhìn toàn diện) là cốt lõi.",
    "explain": "Tuy việc đánh nhau bị phê phán (bảo thủ), nhưng gốc rễ của sai lầm nằm ở phương pháp nhận thức phiến diện (sờ 1 bộ phận đoán toàn thể). Nếu có phương pháp đúng, họ đã không cãi nhau."
  },
  
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyền thuyết 'Bánh chưng, bánh giầy', chi tiết Lang Liêu được thần báo mộng để làm bánh mang ý nghĩa gì, thay vì để chàng tự nghĩ ra?",
    "a": "Để tăng thêm tính chất thần kỳ, huyền bí cho câu chuyện.",
    "b": "Khẳng định chân lý: Người lao động chăm chỉ, biết trân trọng hạt gạo sẽ được thần linh giúp đỡ; đồng thời thần thánh hóa giá trị văn hóa của nghề nông.",
    "c": "Vì Lang Liêu không đủ thông minh để tự nghĩ ra.",
    "d": "Để chứng tỏ Lang Liêu là con của thần.",
    "correct": "Khẳng định chân lý: Người lao động chăm chỉ, biết trân trọng hạt gạo sẽ được thần linh giúp đỡ; đồng thời thần thánh hóa giá trị văn hóa của nghề nông.",
    "explain": "Thần chỉ giúp người xứng đáng. Chi tiết này tôn vinh sự sáng tạo dựa trên nền tảng lao động và lòng hiếu kính, biến sản phẩm nông nghiệp bình thường thành vật phẩm thiêng liêng."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Phân biệt sự khác nhau giữa 'Từ đồng âm' và 'Từ nhiều nghĩa' trong hai ví dụ sau:\n1. Con **ngựa** đá con **ngựa** đá.\n2. **Mùa xuân** (1) là tết trồng cây / Làm cho đất nước càng ngày càng **xuân** (2).",
    "a": "Câu 1 là từ nhiều nghĩa, câu 2 là từ đồng âm.",
    "b": "Câu 1 là từ đồng âm (ngựa vật - ngựa đá chất liệu / hành động đá), câu 2 là từ nhiều nghĩa (mùa xuân - sức sống).",
    "c": "Cả hai đều là từ đồng âm.",
    "d": "Cả hai đều là từ nhiều nghĩa.",
    "correct": "Câu 1 là từ đồng âm (ngựa vật - ngựa đá chất liệu / hành động đá), câu 2 là từ nhiều nghĩa (mùa xuân - sức sống).",
    "explain": "Đồng âm: vỏ âm thanh giống nhau nhưng nghĩa hoàn toàn khác biệt, không liên quan (đá: chất liệu vs đá: hành động). Nhiều nghĩa: có mối liên hệ về nghĩa (mùa xuân: mùa đầu năm -> sự tươi trẻ, khởi đầu)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong văn bản 'Cô Tô' (Nguyễn Tuân), tại sao tác giả lại miêu tả cảnh bão trước rồi mới đến cảnh mặt trời mọc sau bão?",
    "a": "Vì tác giả thích viết theo trình tự thời gian ngẫu nhiên.",
    "b": "Để tạo đòn bẩy nghệ thuật: Cảnh bão tố dữ dội làm nền tôn vinh vẻ đẹp trong trẻo, tinh khôi và rực rỡ gấp bội của Cô Tô khi bình minh lên.",
    "c": "Vì bão là đặc sản của Cô Tô.",
    "d": "Để thể hiện sự khắc nghiệt của thiên nhiên.",
    "correct": "Để tạo đòn bẩy nghệ thuật: Cảnh bão tố dữ dội làm nền tôn vinh vẻ đẹp trong trẻo, tinh khôi và rực rỡ gấp bội của Cô Tô khi bình minh lên.",
    "explain": "Sự tương phản giữa thiên nhiên hung dữ và thiên nhiên hiền hòa, tráng lệ giúp người đọc cảm nhận sâu sắc hơn giá trị của sự bình yên và vẻ đẹp tinh khiết sau cơn mưa."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyện 'Thạch Sanh', chi tiết 'hồn Lý Thông và mẹ biến thành bọ hung' thuộc mô-típ (kiểu truyện) nào của văn học dân gian?",
    "a": "Mô-típ luân hồi chuyển kiếp.",
    "b": "Mô-típ hóa thân trừng phạt (ác giả ác báo), thể hiện sự khinh bỉ tột cùng của nhân dân đối với kẻ vong ân bội nghĩa.",
    "c": "Mô-típ giải thích nguồn gốc các loài vật.",
    "d": "Mô-típ giao kết với thần linh.",
    "correct": "Mô-típ hóa thân trừng phạt (ác giả ác báo), thể hiện sự khinh bỉ tột cùng của nhân dân đối với kẻ vong ân bội nghĩa.",
    "explain": "Biến thành bọ hung (loài vật sống ở nơi bẩn thỉu) là hình phạt nặng nề và nhục nhã nhất, thể hiện thái độ căm ghét sâu sắc của dân gian với cái ác."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Câu thơ 'Mặt trời của bắp thì nằm trên đồi / Mặt trời của mẹ em nằm trên lưng' (Nguyễn Khoa Điềm) sử dụng biện pháp tu từ gì và có ý nghĩa gì?",
    "a": "So sánh; so sánh con với mặt trời.",
    "b": "Ẩn dụ; 'Mặt trời của mẹ' chỉ đứa con - nguồn sống, nguồn hạnh phúc và hy vọng sưởi ấm lòng mẹ.",
    "c": "Hoán dụ; lấy cái cụ thể chỉ cái trừu tượng.",
    "d": "Nhân hóa; mặt trời biết nằm.",
    "correct": "Ẩn dụ; 'Mặt trời của mẹ' chỉ đứa con - nguồn sống, nguồn hạnh phúc và hy vọng sưởi ấm lòng mẹ.",
    "explain": "Mặt trời tự nhiên đem lại ánh sáng cho bắp. Đứa con là 'mặt trời' mang lại ánh sáng, niềm tin và ý nghĩa sống cho người mẹ."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong văn bản 'Vừa nhắm mắt vừa mở cửa sổ' (Nguyễn Ngọc Thuần), thông điệp sâu sắc nhất mà tác giả muốn gửi gắm qua việc 'nhắm mắt' để cảm nhận khu vườn là gì?",
    "a": "Cần phải bảo vệ đôi mắt.",
    "b": "Hãy cảm nhận thế giới bằng mọi giác quan và bằng cả tâm hồn để thấu hiểu những vẻ đẹp khuất lấp mà mắt thường có thể bỏ qua.",
    "c": "Trò chơi của trẻ con rất thú vị.",
    "d": "Các loài hoa có mùi hương rất đặc biệt.",
    "correct": "Hãy cảm nhận thế giới bằng mọi giác quan và bằng cả tâm hồn để thấu hiểu những vẻ đẹp khuất lấp mà mắt thường có thể bỏ qua.",
    "explain": "Nhắm mắt (hạn chế thị giác) để mở rộng thính giác, khứu giác và xúc giác, từ đó 'thấy' được những điều sâu sắc hơn, tinh tế hơn của cuộc sống."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Tại sao trong kết thúc truyện 'Thánh Gióng', Gióng lại bay về trời chứ không ở lại nhận thưởng hay làm vua?",
    "a": "Vì Gióng chán ghét trần gian.",
    "b": "Để bất tử hóa hình tượng người anh hùng: Gióng là thánh, hoàn thành sứ mệnh cứu đời thì trở về cõi bất tử, không màng danh lợi trần tục.",
    "c": "Vì vua không muốn nhường ngôi cho Gióng.",
    "d": "Vì Gióng bị thương nặng.",
    "correct": "Để bất tử hóa hình tượng người anh hùng: Gióng là thánh, hoàn thành sứ mệnh cứu đời thì trở về cõi bất tử, không màng danh lợi trần tục.",
    "explain": "Đây là cách nhân dân tôn vinh người anh hùng vô tư, trong sáng, chí công vô tư. Gióng hóa vào non sông đất nước, sống mãi trong lòng dân tộc."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Xét về cấu tạo ngữ pháp, câu 'Mùa xuân, cây gạo gọi đến bao nhiêu là chim ríu rít.' là loại câu gì?",
    "a": "Câu trần thuật đơn.",
    "b": "Câu trần thuật đơn có từ là.",
    "c": "Câu đặc biệt.",
    "d": "Câu ghép.",
    "correct": "Câu trần thuật đơn.",
    "explain": "Nòng cốt câu chỉ có một cụm C-V: 'cây gạo' (CN) - 'gọi đến bao nhiêu là chim ríu rít' (VN). 'Mùa xuân' là trạng ngữ."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyện 'Sơn Tinh, Thủy Tinh', việc Sơn Tinh luôn thắng Thủy Tinh hàng năm phản ánh quy luật gì của tự nhiên và con người Việt Nam?",
    "a": "Quy luật nước dâng cao bao nhiêu, đất đồi núi cao bấy nhiêu.",
    "b": "Ước mơ và niềm tin tất thắng của người Việt trong công cuộc đắp đê, trị thủy, chế ngự thiên tai để bảo vệ mùa màng.",
    "c": "Sự ưu ái của thần linh đối với người ở núi.",
    "d": "Quy luật mùa lũ luôn kết thúc nhanh chóng.",
    "correct": "Ước mơ và niềm tin tất thắng của người Việt trong công cuộc đắp đê, trị thủy, chế ngự thiên tai để bảo vệ mùa màng.",
    "explain": "Thủy Tinh không bao giờ chết (lũ lụt năm nào cũng có), nhưng Sơn Tinh luôn thắng (con người luôn kiên cường đắp đê ngăn lũ thành công)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Câu ca dao: 'Bầu ơi thương lấy bí cùng / Tuy rằng khác giống nhưng chung một giàn' sử dụng nghệ thuật ẩn dụ để khuyên răn điều gì?",
    "a": "Khuyên cách trồng trọt xen canh.",
    "b": "Khuyên con người dù khác nhau về nguồn gốc, điều kiện (khác giống) nhưng cùng sống trong một đất nước/cộng đồng (chung giàn) thì phải yêu thương, đùm bọc nhau.",
    "c": "Ca ngợi vẻ đẹp của giàn bầu bí.",
    "d": "Phê phán sự chia rẽ.",
    "correct": "Khuyên con người dù khác nhau về nguồn gốc, điều kiện (khác giống) nhưng cùng sống trong một đất nước/cộng đồng (chung giàn) thì phải yêu thương, đùm bọc nhau.",
    "explain": "Hình ảnh 'chung một giàn' là ẩn dụ sâu sắc cho sự gắn kết cộng đồng, nguồn cội (đồng bào) và vận mệnh quốc gia."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong bài thơ 'Chuyện cổ tích về loài người' (Xuân Quỳnh), tại sao nhà thơ lại viết 'Mắt trẻ con sáng lắm / Nhưng chưa thấy gì đâu / Mặt trời mới nhô cao / Cho trẻ con nhìn rõ'?",
    "a": "Để giải thích hiện tượng tự nhiên mặt trời mọc.",
    "b": "Để khẳng định: Thiên nhiên và vạn vật sinh ra là để phục vụ, chăm sóc và nuôi dưỡng trẻ em - trung tâm của vũ trụ.",
    "c": "Vì trẻ con sinh ra bị cận thị.",
    "d": "Vì thế giới ban đầu rất tối tăm.",
    "correct": "Để khẳng định: Thiên nhiên và vạn vật sinh ra là để phục vụ, chăm sóc và nuôi dưỡng trẻ em - trung tâm của vũ trụ.",
    "explain": "Bài thơ xây dựng một giả thuyết ngược: Trẻ em sinh ra trước, rồi vạn vật mới sinh ra ĐỂ phục vụ trẻ. Đây là cái nhìn đầy yêu thương và trân trọng trẻ thơ."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong văn bản 'Dế Mèn phiêu lưu ký', hành động Dế Mèn chôn cất Dế Choắt và đứng lặng hồi lâu trước nấm mồ thể hiện sự chuyển biến tâm lý nào?",
    "a": "Sự sợ hãi vì đã gây ra án mạng.",
    "b": "Sự hối hận chân thành, day dứt lương tâm và bước đầu trưởng thành trong nhận thức về lẽ sống.",
    "c": "Sự thương hại đối với kẻ yếu.",
    "d": "Sự lo lắng bị Cốc trả thù.",
    "correct": "Sự hối hận chân thành, day dứt lương tâm và bước đầu trưởng thành trong nhận thức về lẽ sống.",
    "explain": "Sự im lặng và hành động chôn cất đánh dấu chấm hết cho thói hung hăng trẻ con, mở đầu cho hành trình tu dưỡng đạo đức của Dế Mèn."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Từ 'đầu' trong câu nào sau đây được dùng với nghĩa gốc?",
    "a": "Đầu bạc răng long.",
    "b": "Đầu súng trăng treo.",
    "c": "Đầu non cuối bể.",
    "d": "Đầu đường xó chợ.",
    "correct": "Đầu bạc răng long.",
    "explain": "'Đầu' ở đây chỉ bộ phận cơ thể người (nơi mọc tóc), là nghĩa gốc. Các câu khác: 'đầu súng' (vị trí trên cùng), 'đầu non/đầu đường' (vị trí bắt đầu) là nghĩa chuyển."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong bài thơ 'Gấu con chân vòng kiềng' (U-xa-chốp), chi tiết Gấu con về nhà định đi nằm nhưng rồi lại 'vùng dậy' và 'kiêu hãnh bước ra' nói lên điều gì?",
    "a": "Gấu con không buồn ngủ nữa.",
    "b": "Sự chiến thắng mặc cảm, chấp nhận bản thân và biến nhược điểm thành nét độc đáo riêng biệt.",
    "c": "Gấu con muốn đi khoe chân vòng kiềng.",
    "d": "Gấu con tức giận muốn đi tìm Thỏ để đánh nhau.",
    "correct": "Sự chiến thắng mặc cảm, chấp nhận bản thân và biến nhược điểm thành nét độc đáo riêng biệt.",
    "explain": "Gấu con nhận ra chân vòng kiềng không xấu (vì bố mẹ và các gấu tài giỏi đều thế), từ đó tự tin vào giá trị bản thân thay vì buồn bã vì lời chê bai."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Câu văn nào sau đây mắc lỗi về tư duy logic (lỗi ngữ nghĩa)?",
    "a": "Mặc dù trời nắng nhưng hoa vẫn nở đẹp.",
    "b": "Tuy nhà nghèo nhưng Lan học rất giỏi.",
    "c": "Vì trời mưa to nên đường rất ướt.",
    "d": "Tuy học giỏi nhưng Nam rất ngoan.",
    "correct": "Tuy học giỏi nhưng Nam rất ngoan.",
    "explain": "Quan hệ từ 'Tuy... nhưng' dùng cho quan hệ tương phản. 'Học giỏi' và 'ngoan' là hai ưu điểm tương đồng, không đối lập nhau. Sửa thành: 'Nam không những học giỏi mà còn rất ngoan'."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong văn bản 'Cây tre Việt Nam', tác giả Thép Mới gọi cây tre là 'anh hùng lao động' và 'anh hùng chiến đấu'. Biện pháp tu từ chủ đạo ở đây là gì và tác dụng của nó?",
    "a": "So sánh; làm cho cây tre đẹp hơn.",
    "b": "Nhân hóa và Điệp ngữ; tôn vinh cây tre lên tầm vóc của một con người vĩ đại, biểu tượng cho phẩm chất cao quý của dân tộc Việt Nam.",
    "c": "Ẩn dụ; chỉ người nông dân.",
    "d": "Hoán dụ; lấy cây tre chỉ làng quê.",
    "correct": "Nhân hóa và Điệp ngữ; tôn vinh cây tre lên tầm vóc của một con người vĩ đại, biểu tượng cho phẩm chất cao quý của dân tộc Việt Nam.",
    "explain": "Danh hiệu 'anh hùng' vốn chỉ dành cho người có công lao to lớn. Gán cho tre là sự nhân hóa cao độ, khẳng định vị thế của tre trong lịch sử dân tộc."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Tại sao kết thúc truyện 'Em bé thông minh', em bé lại được phong làm Trạng nguyên?",
    "a": "Vì em bé giải được câu đố của sứ thần.",
    "b": "Để khẳng định: Trí tuệ dân gian (sự thông minh, lanh lợi từ đời sống) xứng đáng đứng đầu và có thể giúp ích cho đất nước không kém gì trí tuệ sách vở.",
    "c": "Vì vua không có người tài nào khác.",
    "d": "Vì cha của em bé xin vua.",
    "correct": "Để khẳng định: Trí tuệ dân gian (sự thông minh, lanh lợi từ đời sống) xứng đáng đứng đầu và có thể giúp ích cho đất nước không kém gì trí tuệ sách vở.",
    "explain": "Việc một em bé nông dân làm Trạng nguyên là sự tôn vinh tuyệt đối của nhân dân đối với kinh nghiệm và trí khôn thực tế."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong câu: 'Chết đứng còn hơn sống quỳ', cặp từ trái nghĩa 'đứng - quỳ' mang hàm ý gì?",
    "a": "Chỉ tư thế của con người.",
    "b": "Tương phản giữa sự hiên ngang, bất khuất (đứng) và sự nhục nhã, luồn cúi (quỳ).",
    "c": "Chỉ hoạt động thể dục.",
    "d": "Không có hàm ý gì sâu xa.",
    "correct": "Tương phản giữa sự hiên ngang, bất khuất (đứng) và sự hiên ngang, luồn cúi (quỳ).",
    "explain": "Từ trái nghĩa ở đây không chỉ tả thực tư thế mà ẩn dụ cho thái độ sống và nhân cách con người trước nghịch cảnh/kẻ thù."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Văn bản 'Hang Én' (Hà My) có điểm gì đặc biệt trong cách trần thuật so với một bài văn thuyết minh về danh lam thắng cảnh thông thường?",
    "a": "Cung cấp nhiều số liệu khô khan.",
    "b": "Kết hợp nhuần nhuyễn giữa cung cấp thông tin (thuyết minh) với miêu tả vẻ đẹp thiên nhiên và bộc lộ cảm xúc, trải nghiệm cá nhân của người viết (Ký).",
    "c": "Kể chuyện hư cấu về hang động.",
    "d": "Chỉ tập trung miêu tả loài chim én.",
    "correct": "Kết hợp nhuần nhuyễn giữa cung cấp thông tin (thuyết minh) với miêu tả vẻ đẹp thiên nhiên và bộc lộ cảm xúc, trải nghiệm cá nhân của người viết (Ký).",
    "explain": "Đây là đặc trưng của thể Ký (Du ký): Thông tin khách quan hòa quyện với cái 'tôi' chủ quan giàu cảm xúc, khiến bài văn sinh động, hấp dẫn."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyện 'Ông lão đánh cá và con cá vàng', hình ảnh 'cái máng lợn sứt' xuất hiện ở đầu và cuối truyện tạo nên kết cấu gì và có ý nghĩa gì?",
    "a": "Kết cấu đầu cuối tương ứng (vòng tròn); biểu tượng cho sự trở về vạch xuất phát, cái giá phải trả cho lòng tham không đáy.",
    "b": "Kết cấu mở; gợi ý ông lão nên mua máng mới.",
    "c": "Kết cấu tăng tiến; cái máng lợn ngày càng đẹp hơn.",
    "d": "Kết cấu đối lập; máng lợn đối lập với cung điện.",
    "correct": "Kết cấu đầu cuối tương ứng (vòng tròn); biểu tượng cho sự trở về vạch xuất phát, cái giá phải trả cho lòng tham không đáy.",
    "explain": "Vòng tròn tham vọng của mụ vợ cuối cùng đưa mụ về lại đúng vị trí ban đầu với sự nghèo khó, cảnh tỉnh con người biết điểm dừng."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong các từ sau: 'lung linh, lạnh lùng, lấp lánh, lanh lẹ', từ nào có sắc thái nghĩa thiên về tính cách/thái độ con người hơn là miêu tả đặc điểm sự vật?",
    "a": "Lung linh.",
    "b": "Lạnh lùng.",
    "c": "Lấp lánh.",
    "d": "Lanh lẹ.",
    "correct": "Lạnh lùng.",
    "explain": "'Lung linh', 'lấp lánh' tả ánh sáng/vẻ đẹp. 'Lanh lẹ' tả hoạt động. 'Lạnh lùng' tả thái độ thờ ơ, vô cảm của con người."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong bài thơ 'Lượm', khổ thơ: 'Cháu nằm trên lúa / Tay nắm chặt bông / Lúa thơm mùi sữa / Hồn bay giữa đồng' gợi lên vẻ đẹp gì của sự hy sinh?",
    "a": "Sự đau đớn, bi thương tột cùng.",
    "b": "Sự nhẹ nhàng, thanh thản; Lượm không chết mà hóa thân vào quê hương, đất nước, sống mãi với đồng lúa Việt Nam.",
    "c": "Sự tiếc nuối tuổi trẻ.",
    "d": "Sự cô đơn lạnh lẽo.",
    "correct": "Sự nhẹ nhàng, thanh thản; Lượm không chết mà hóa thân vào quê hương, đất nước, sống mãi với đồng lúa Việt Nam.",
    "explain": "Tố Hữu đã bất tử hóa cái chết của Lượm. Hình ảnh 'hồn bay giữa đồng' làm giảm nhẹ tính chất bi thương, tô đậm tính chất anh hùng ca."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Xác định lỗi sai trong câu: 'Qua tác phẩm tắt đèn cho ta thấy bộ mặt tàn ác của chế độ thực dân phong kiến.'",
    "a": "Lỗi dùng từ sai nghĩa.",
    "b": "Lỗi thiếu chủ ngữ (do từ 'Qua' và 'cho' biến cả câu thành trạng ngữ và bổ ngữ).",
    "c": "Lỗi thiếu vị ngữ.",
    "d": "Lỗi lặp từ.",
    "correct": "Lỗi thiếu chủ ngữ (do từ 'Qua' và 'cho' biến cả câu thành trạng ngữ và bổ ngữ).",
    "explain": "Cách sửa: Bỏ 'Qua' -> 'Tác phẩm Tắt đèn cho ta thấy...' hoặc Bỏ 'cho' và thêm chủ ngữ -> 'Qua tác phẩm Tắt đèn, tác giả cho ta thấy...'."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyện ngụ ngôn 'Chân, Tay, Tai, Mắt, Miệng', tại sao sau khi đình công không làm việc nuôi Miệng, các bộ phận khác lại mệt mỏi rã rời?",
    "a": "Vì chúng bị đói.",
    "b": "Vì chúng nhận ra chân lý: Trong một cơ thể thống nhất, mỗi bộ phận có chức năng riêng nhưng có mối quan hệ hữu cơ, nương tựa vào nhau để tồn tại.",
    "c": "Vì Miệng trừng phạt chúng.",
    "d": "Vì chúng làm việc quá sức trước đó.",
    "correct": "Vì chúng nhận ra chân lý: Trong một cơ thể thống nhất, mỗi bộ phận có chức năng riêng nhưng có mối quan hệ hữu cơ, nương tựa vào nhau để tồn tại.",
    "explain": "Câu chuyện dạy bài học về tinh thần đoàn kết và trách nhiệm xã hội. Không ai sống độc lập tuyệt đối, sự tồn tại của người này là điều kiện cho người kia."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Hai câu thơ: 'Thân em vừa trắng lại vừa tròn / Bảy nổi ba chìm với nước non' (Bánh trôi nước - Hồ Xuân Hương) sử dụng biện pháp nghệ thuật gì để nói về người phụ nữ?",
    "a": "Tả thực.",
    "b": "Ẩn dụ đa nghĩa (Vừa tả thực bánh trôi, vừa ẩn dụ cho vẻ đẹp và số phận long đong của người phụ nữ).",
    "c": "Hoán dụ.",
    "d": "Nói quá.",
    "correct": "Ẩn dụ đa nghĩa (Vừa tả thực bánh trôi, vừa ẩn dụ cho vẻ đẹp và số phận long đong của người phụ nữ).",
    "explain": "Đây là bài thơ 'Vịnh vật' tiêu biểu. Hình dáng bánh trôi ứng với vẻ đẹp ngoại hình, cách luộc bánh (nổi chìm) ứng với số phận bấp bênh của phụ nữ xưa."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Tại sao trong văn bản thông tin về 'Hội thổi cơm thi ở Đồng Vân', tác giả lại miêu tả chi tiết các quy định ngặt nghèo (lấy lửa từ cây chuối, giã gạo từ thóc...)?",
    "a": "Để thấy cuộc thi rất khó khăn.",
    "b": "Để làm nổi bật sự khéo léo, nhanh trí, tinh thần đồng đội và nét đẹp văn hóa lúa nước được bảo tồn qua hội thi.",
    "c": "Để phê phán hủ tục lạc hậu.",
    "d": "Để hướng dẫn người đọc cách nấu cơm.",
    "correct": "Để làm nổi bật sự khéo léo, nhanh trí, tinh thần đồng đội và nét đẹp văn hóa lúa nước được bảo tồn qua hội thi.",
    "explain": "Những thử thách khó khăn chính là thước đo tài năng và sự gìn giữ truyền thống (nấu cơm từ những công đoạn sơ khai nhất) của người dân."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Xét về mục đích nói, câu: 'Cậu giúp tớ giải bài toán này với!' thuộc kiểu câu gì?",
    "a": "Câu trần thuật.",
    "b": "Câu cảm thán.",
    "c": "Câu cầu khiến.",
    "d": "Câu nghi vấn.",
    "correct": "Câu cầu khiến.",
    "explain": "Mục đích của câu là đưa ra một lời đề nghị/yêu cầu giúp đỡ. Dù có dấu chấm than (thường gặp ở câu cảm thán) nhưng chức năng chính là cầu khiến."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyện 'Gió lạnh đầu mùa', chi tiết người mẹ của Sơn cho mẹ Hiên vay tiền mua áo và nhẹ nhàng nhắc nhở con mình có ý nghĩa giáo dục như thế nào?",
    "a": "Dạy con cách tiêu tiền.",
    "b": "Dạy con cách ứng xử tế nhị, giữ lòng tự trọng cho người nghèo khi giúp đỡ họ ('Của cho không bằng cách cho').",
    "c": "Dạy con không được tự ý lấy đồ nhà đi cho.",
    "d": "Thể hiện sự giàu có của gia đình.",
    "correct": "Dạy con cách ứng xử tế nhị, giữ lòng tự trọng cho người nghèo khi giúp đỡ họ ('Của cho không bằng cách cho').",
    "explain": "Người mẹ không mắng con (trân trọng lòng tốt của trẻ) nhưng cách bà giải quyết (cho vay tiền thay vì cho áo cũ) giúp mẹ Hiên đỡ tủi thân, giữ được phẩm giá."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong bài thơ 'Mây và Sóng', tại sao em bé không chọn đi theo Mây và Sóng dù lời mời gọi rất hấp dẫn?",
    "a": "Vì em bé sợ độ cao và sợ nước.",
    "b": "Vì em bé không muốn rời xa mẹ, tình yêu thương mẹ đã chiến thắng mọi ham muốn vui chơi cá nhân.",
    "c": "Vì em bé buồn ngủ.",
    "d": "Vì mẹ không cho đi.",
    "correct": "Vì em bé không muốn rời xa mẹ, tình yêu thương mẹ đã chiến thắng mọi ham muốn vui chơi cá nhân.",
    "explain": "Đây là thử thách tâm lý. Lời từ chối cho thấy sự trưởng thành trong tình cảm: niềm vui bên mẹ là niềm vui tuyệt vời nhất, hơn cả những xứ sở thần tiên."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Biện pháp tu từ 'Chơi chữ' trong câu: 'Con kiến bò trên đĩa thịt bò' dựa trên hiện tượng ngôn ngữ nào?",
    "a": "Từ trái nghĩa.",
    "b": "Từ đồng âm.",
    "c": "Từ đồng nghĩa.",
    "d": "Từ nhiều nghĩa.",
    "correct": "Từ đồng âm.",
    "explain": "'Bò' (động từ di chuyển) và 'Bò' (danh từ chỉ con bò/thịt bò) là hai từ đồng âm khác nghĩa hoàn toàn, tạo nên sự thú vị bất ngờ."
  },
  
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyện 'Ông lão đánh cá và con cá vàng', sự thay đổi màu sắc của biển cả qua mỗi lần ông lão ra gọi cá (xanh - êm ả, xanh - gợn sóng, xám, đen ngòm, dông tố) có vai trò nghệ thuật gì?",
    "a": "Chỉ đơn thuần là miêu tả sự thay đổi thời tiết ngẫu nhiên.",
    "b": "Là biện pháp nhân hóa, mượn sự giận dữ của thiên nhiên để biểu hiện thái độ bất bình, phản đối của nhân dân trước lòng tham không đáy của mụ vợ.",
    "c": "Để làm nền cho sự xuất hiện của cá vàng.",
    "d": "Để báo hiệu mùa bão đang đến.",
    "correct": "Là biện pháp nhân hóa, mượn sự giận dữ của thiên nhiên để biểu hiện thái độ bất bình, phản đối của nhân dân trước lòng tham không đáy của mụ vợ.",
    "explain": "Thiên nhiên trong truyện cổ tích thường đồng nhất với cảm xúc con người/công lý. Biển càng động dữ dội thì lòng tham và sự vô lý của mụ vợ càng lên cao, báo hiệu sự trừng phạt sắp tới."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "So sánh hình ảnh Dượng Hương Thư trong 'Vượt thác' và hình ảnh chú bé Lượm trong bài thơ 'Lượm', điểm tương đồng lớn nhất về vẻ đẹp con người Việt Nam là gì?",
    "a": "Đều có ngoại hình khỏe mạnh, vạm vỡ.",
    "b": "Đều là những con người dũng cảm, kiên cường, hăng say và hết mình trong công việc/nhiệm vụ của mình (lao động và chiến đấu).",
    "c": "Đều là những người nông dân chất phác.",
    "d": "Đều có số phận bi thương.",
    "correct": "Đều là những con người dũng cảm, kiên cường, hăng say và hết mình trong công việc/nhiệm vụ của mình (lao động và chiến đấu).",
    "explain": "Dù một người là người lao động bình thường, một người là chiến sĩ nhỏ tuổi, họ đều đại diện cho phẩm chất anh hùng, không quản ngại khó khăn nguy hiểm vì mục tiêu chung."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Câu văn: 'Tre trông thanh cao, giản dị, chí khí như người.' sử dụng biện pháp tu từ gì và nhằm mục đích gì?",
    "a": "So sánh; hạ thấp phẩm giá con người xuống bằng cây cỏ.",
    "b": "Nhân hóa và So sánh; khẳng định sự hòa hợp, đồng nhất về phẩm chất giữa cây tre và con người Việt Nam (Tre là biểu tượng của cốt cách Việt).",
    "c": "Ẩn dụ; chỉ những người nông dân nghèo.",
    "d": "Liệt kê; kể tên các đặc điểm của tre.",
    "correct": "Nhân hóa và So sánh; khẳng định sự hòa hợp, đồng nhất về phẩm chất giữa cây tre và con người Việt Nam (Tre là biểu tượng của cốt cách Việt).",
    "explain": "Tác giả dùng từ chỉ phẩm chất người (thanh cao, chí khí) để tả tre, rồi lại so sánh ngược lại với người, tạo nên mối liên kết chặt chẽ không thể tách rời."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong văn bản 'Sông nước Cà Mau', Đoàn Giỏi viết: 'Thuyền chúng tôi chèo thoát qua kênh Bọ Mắt, đổ ra con sông Cửa Lớn, xuôi về Năm Căn...'. Việc sử dụng các động từ 'thoát qua', 'đổ ra', 'xuôi về' có tác dụng gì?",
    "a": "Chỉ để chỉ phương hướng.",
    "b": "Diễn tả chính xác trạng thái của dòng chảy và hành trình của con thuyền: Từ nơi chật hẹp, nguy hiểm ra nơi rộng lớn, phóng khoáng, hùng vĩ.",
    "c": "Cho thấy con thuyền đi rất nhanh.",
    "d": "Thể hiện sự mệt mỏi của người chèo.",
    "correct": "Diễn tả chính xác trạng thái của dòng chảy và hành trình của con thuyền: Từ nơi chật hẹp, nguy hiểm ra nơi rộng lớn, phóng khoáng, hùng vĩ.",
    "explain": "Các động từ này gợi tả sự thay đổi không gian (từ kênh rạch nhỏ ra sông lớn) và cảm giác giải phóng, tự do của con người trước thiên nhiên bao la."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Tại sao 'Câu đặc biệt' (Ví dụ: 'Mưa.', 'Một hồi còi.') thường được dùng trong văn miêu tả và kể chuyện?",
    "a": "Vì tác giả không biết viết câu đầy đủ.",
    "b": "Vì nó ngắn gọn.",
    "c": "Để liệt kê sự vật, thông báo sự tồn tại của sự vật/hiện tượng, hoặc nhấn mạnh thời gian, không gian, tạo ấn tượng mạnh về cảm xúc.",
    "d": "Để làm giảm nhịp điệu câu chuyện.",
    "correct": "Để liệt kê sự vật, thông báo sự tồn tại của sự vật/hiện tượng, hoặc nhấn mạnh thời gian, không gian, tạo ấn tượng mạnh về cảm xúc.",
    "explain": "Câu đặc biệt giúp cô đúc thông tin hình ảnh, tạo nhịp điệu nhanh hoặc điểm nhấn tĩnh lặng tùy ngữ cảnh (Ví dụ: 'Gió. Mưa. Não nùng.' - gợi tả không khí buồn bã). "
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyện 'Cây bút thần', tại sao Mã Lương không vẽ ngay cho người nghèo vàng bạc, châu báu để họ hết khổ mà lại vẽ cày, cuốc, thùng múc nước...?",
    "a": "Vì Mã Lương không biết vẽ vàng bạc.",
    "b": "Vì vàng bạc rồi sẽ tiêu hết. Mã Lương trao cho họ công cụ lao động (cần câu cơm) để họ tự nuôi sống bản thân bền vững, thể hiện quan điểm 'lao động là vinh quang'.",
    "c": "Vì bút thần không vẽ được tiền.",
    "d": "Vì Mã Lương keo kiệt.",
    "correct": "Vì vàng bạc rồi sẽ tiêu hết. Mã Lương trao cho họ công cụ lao động (cần câu cơm) để họ tự nuôi sống bản thân bền vững, thể hiện quan điểm 'lao động là vinh quang'.",
    "explain": "Đây là triết lý nhân văn của dân gian: Giúp đỡ người nghèo bằng cách tạo điều kiện lao động chứ không khuyến khích thói lười biếng, trông chờ vào phép lạ."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong câu: 'Chị Cốc thoạt nghe tiếng hát từ trong đất văng vẳng lên, không hiểu như thế nào, giật nẩy hai đầu cánh, muốn bay.', từ 'giật nẩy' là loại từ gì và có tác dụng gợi tả điều gì?",
    "a": "Động từ mạnh; gợi tả phản xạ bất ngờ, tức giận và hung dữ của chị Cốc.",
    "b": "Tính từ; miêu tả đôi cánh đẹp.",
    "c": "Danh từ; chỉ bộ phận cơ thể.",
    "d": "Từ láy; gợi tả sự nhẹ nhàng.",
    "correct": "Động từ mạnh; gợi tả phản xạ bất ngờ, tức giận và hung dữ của chị Cốc.",
    "explain": "Từ này lột tả bản chất hung hăng, sẵn sàng tấn công của nhân vật Cốc, dự báo tai họa sắp giáng xuống đầu Dế Choắt."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Chi tiết 'Tiếng chuông' trong truyện Thạch Sanh khi vang lên khiến quân 18 nước chư hầu bủn rủn chân tay, không còn nhuệ khí đánh trận có ý nghĩa gì khác với 'Tiếng đàn'?",
    "a": "Tiếng chuông là lời cảnh tỉnh, thức tỉnh lương tri; Tiếng đàn là lời oán than.",
    "b": "Hai chi tiết này thực chất mang cùng một ý nghĩa: Sức mạnh của chính nghĩa và hòa bình có thể hóa giải bạo lực.",
    "c": "Tiếng chuông làm điếc tai quân địch.",
    "d": "Tiếng chuông gọi cơm.",
    "correct": "Hai chi tiết này thực chất mang cùng một ý nghĩa: Sức mạnh của chính nghĩa và hòa bình có thể hóa giải bạo lực.",
    "explain": "Trong một số dị bản, đàn và chuông có thể thay thế hoặc bổ sung cho nhau, đều biểu tượng cho khát vọng hòa bình, dùng văn hóa để thu phục quân sự."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong bài thơ 'Mưa' (Trần Đăng Khoa), hình ảnh 'Bố em đi cày về / Đội sấm / Đội chớp / Đội cả trời mưa' sử dụng biện pháp tu từ gì và có ý nghĩa gì?",
    "a": "Nói quá; làm cho người bố trở nên khổng lồ, phi thường, chiến thắng thiên nhiên.",
    "b": "Nhân hóa; bố biết đội mưa.",
    "c": "So sánh; bố to như trời.",
    "d": "Liệt kê; kể các hiện tượng thiên nhiên.",
    "correct": "Nói quá; làm cho người bố trở nên khổng lồ, phi thường, chiến thắng thiên nhiên.",
    "explain": "Hình ảnh người nông dân trở nên vĩ đại, vững chãi, làm chủ thiên nhiên khắc nghiệt. Đây là cái nhìn đầy ngưỡng mộ và yêu thương của người con."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Phân biệt 'Ẩn dụ tu từ' và 'Ẩn dụ từ vựng' (nghĩa chuyển của từ) trong hai ví dụ:\n1. Người Cha mái tóc bạc (Chỉ Bác Hồ).\n2. Cổ chai, Chân bàn.",
    "a": "Cả hai đều là Ẩn dụ tu từ.",
    "b": "Câu 1 là Ẩn dụ tu từ (chỉ có tính lâm thời trong văn cảnh); Câu 2 là Ẩn dụ từ vựng (nghĩa chuyển đã cố định trong từ điển, ai cũng hiểu).",
    "c": "Câu 1 là Ẩn dụ từ vựng; Câu 2 là Ẩn dụ tu từ.",
    "d": "Cả hai đều là Ẩn dụ từ vựng.",
    "correct": "Câu 1 là Ẩn dụ tu từ (chỉ có tính lâm thời trong văn cảnh); Câu 2 là Ẩn dụ từ vựng (nghĩa chuyển đã cố định trong từ điển, ai cũng hiểu).",
    "explain": "'Người Cha' chỉ hiểu là Bác Hồ trong ngữ cảnh bài thơ cụ thể (tu từ). 'Chân bàn' là từ mọi người đều dùng hàng ngày, đã mất đi tính hình ảnh nghệ thuật (từ vựng)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong văn bản 'Bức tranh của em gái tôi', tại sao tác giả lại đặt tên truyện là 'Bức tranh của em gái TÔI' mà không phải là 'Bức tranh đoạt giải' hay 'Em gái Kiều Phương'?",
    "a": "Để nhấn mạnh quyền sở hữu bức tranh.",
    "b": "Để đặt điểm nhìn và trọng tâm câu chuyện vào người anh ('Tôi'): Bức tranh là của em gái, nhưng nó lại soi rọi tâm hồn của người anh, là câu chuyện về sự thức tỉnh của người anh.",
    "c": "Vì tên này nghe hay hơn.",
    "d": "Vì người anh là người vẽ tranh.",
    "correct": "Để đặt điểm nhìn và trọng tâm câu chuyện vào người anh ('Tôi'): Bức tranh là của em gái, nhưng nó lại soi rọi tâm hồn của người anh, là câu chuyện về sự thức tỉnh của người anh.",
    "explain": "Nhan đề nhấn mạnh mối quan hệ và sự ảnh hưởng của người em đối với người anh. Bức tranh là phương tiện để người anh nhìn lại chính mình."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyện 'Sự tích Hồ Gươm', việc Lê Lợi trả gươm ở hồ Tả Vọng (sau đổi thành Hồ Gươm) chứ không phải ở Thanh Hóa (nơi khởi nghĩa) có ý nghĩa địa - văn hóa gì?",
    "a": "Vì Lê Lợi thích đi chơi hồ.",
    "b": "Vì rùa vàng chỉ sống ở hồ này.",
    "c": "Khẳng định Thăng Long (Hà Nội) là thủ đô, là trái tim của cả nước, nơi hội tụ khí thiêng sông núi và là biểu tượng của nền hòa bình muôn đời.",
    "d": "Vì đường về Thanh Hóa quá xa.",
    "correct": "Khẳng định Thăng Long (Hà Nội) là thủ đô, là trái tim của cả nước, nơi hội tụ khí thiêng sông núi và là biểu tượng của nền hòa bình muôn đời.",
    "explain": "Huyền thoại hóa địa danh lịch sử. Việc trả gươm tại kinh đô mới khẳng định vị thế trung tâm chính trị, văn hóa của Thăng Long trong kỷ nguyên độc lập."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong các câu sau, câu nào là 'Câu trần thuật đơn có từ là' dùng để đánh giá?",
    "a": "Tre là người bạn thân của nông dân Việt Nam.",
    "b": "Hôm nay là thứ hai.",
    "c": "Vua nhớ công ơn phong là Phù Đổng Thiên Vương.",
    "d": "Tôi là học sinh.",
    "correct": "Tre là người bạn thân của nông dân Việt Nam.",
    "explain": "Câu này không chỉ giới thiệu (như câu d) hay thông báo (như câu b), mà nó thể hiện quan điểm, nhận định chủ quan, đánh giá về vai trò của cây tre."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Hình ảnh 'Mặt trời chân lý chói qua tim' trong thơ Tố Hữu sử dụng biện pháp tu từ gì?",
    "a": "So sánh.",
    "b": "Ẩn dụ; 'Mặt trời chân lý' chỉ lý tưởng cách mạng mang lại ánh sáng, hơi ấm và sự sống cho tâm hồn nhà thơ.",
    "c": "Hoán dụ; lấy tim chỉ người.",
    "d": "Nhân hóa; mặt trời biết chói.",
    "correct": "Ẩn dụ; 'Mặt trời chân lý' chỉ lý tưởng cách mạng mang lại ánh sáng, hơi ấm và sự sống cho tâm hồn nhà thơ.",
    "explain": "Lý tưởng Đảng được ví như nguồn sáng vĩ đại (mặt trời) xua tan bóng tối nô lệ trong lòng người thanh niên."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyện 'Buổi học cuối cùng', tiếng chuông đồng hồ điểm 12 giờ và tiếng kèn của lính Phổ vang lên cùng lúc có ý nghĩa gì?",
    "a": "Báo hiệu giờ tan học.",
    "b": "Báo hiệu giờ ăn trưa.",
    "c": "Khoảnh khắc chấm dứt của buổi học tiếng Pháp, cũng là khoảnh khắc đau đớn đánh dấu sự kết thúc của tự do, bắt đầu thời kỳ nô lệ văn hóa.",
    "d": "Để thầy Ha-men viết dòng chữ lên bảng.",
    "correct": "Khoảnh khắc chấm dứt của buổi học tiếng Pháp, cũng là khoảnh khắc đau đớn đánh dấu sự kết thúc của tự do, bắt đầu thời kỳ nô lệ văn hóa.",
    "explain": "Âm thanh thực tế trở thành tiếng chuông báo tử cho một giai đoạn lịch sử. Sự đối lập giữa không gian lớp học yên tĩnh và âm thanh quân sự bên ngoài tạo nên bi kịch."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong văn bản 'Lao xao' (Duy Khán), việc tác giả phân loại các loài chim thành 'chim hiền', 'chim ác' thể hiện đặc điểm gì của văn miêu tả tuổi thơ?",
    "a": "Thiếu tính khoa học sinh học.",
    "b": "Sự hồn nhiên, ngây thơ, nhìn thế giới tự nhiên qua lăng kính đạo đức và cổ tích của trẻ thơ (cái thiện - cái ác rạch ròi).",
    "c": "Tác giả ghét các loài chim ăn thịt.",
    "d": "Để dọa trẻ con.",
    "correct": "Sự hồn nhiên, ngây thơ, nhìn thế giới tự nhiên qua lăng kính đạo đức và cổ tích của trẻ thơ (cái thiện - cái ác rạch ròi).",
    "explain": "Thế giới loài vật được nhân hóa và phân loại theo tính cách con người (bồ các là kẻ cắp, chèo bẻo đánh kẻ ác...), phản ánh tâm hồn phong phú của cậu bé làng quê."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Câu văn: 'Dượng Hương Thư như một pho tượng đồng đúc, các bắp thịt cuồn cuộn, hai hàm răng cắn chặt, quai hàm bạnh ra, cặp mắt nảy lửa...' sử dụng phép so sánh nhằm làm nổi bật điều gì?",
    "a": "Vẻ đẹp ngoại hình hung dữ.",
    "b": "Sức mạnh gân guốc, sự tập trung cao độ và tinh thần quyết chiến khi đối mặt với thử thách thiên nhiên.",
    "c": "Sự mệt mỏi kiệt sức.",
    "d": "Sự nóng giận của nhân vật.",
    "correct": "Sức mạnh gân guốc, sự tập trung cao độ và tinh thần quyết chiến khi đối mặt với thử thách thiên nhiên.",
    "explain": "Hình ảnh so sánh tĩnh (tượng đồng) kết hợp với các động từ mạnh (cắn chặt, bạnh ra, nảy lửa) tạo nên bức tượng đài sống động về người lao động."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyện 'Sọ Dừa', tại sao cô út lại bằng lòng lấy Sọ Dừa ngay cả khi chàng chưa trút bỏ lốt xấu xí?",
    "a": "Vì cô út bị cha ép buộc.",
    "b": "Vì cô út thương hại Sọ Dừa.",
    "c": "Vì cô út nhận biết được vẻ đẹp tâm hồn (tiếng sáo, sự cần cù, hiền lành) ẩn sau vẻ ngoài dị dạng. Đây là tình yêu chân thành, không vụ lợi.",
    "d": "Vì cô út biết Sọ Dừa là thần tiên.",
    "correct": "Vì cô út nhận biết được vẻ đẹp tâm hồn (tiếng sáo, sự cần cù, hiền lành) ẩn sau vẻ ngoài dị dạng. Đây là tình yêu chân thành, không vụ lợi.",
    "explain": "Tình yêu của cô út là yếu tố quan trọng giúp Sọ Dừa trở lại hình người. Nó khẳng định giá trị của sự thấu hiểu và lòng nhân ái vượt qua định kiến."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong bài thơ 'À ơi tay mẹ' (Bình Nguyên), hình ảnh 'Bàn tay mẹ chắn mưa sa / Bàn tay mẹ chặn bão qua mùa màng' sử dụng biện pháp tu từ gì?",
    "a": "Liệt kê.",
    "b": "Điệp ngữ và Ẩn dụ (Mưa sa, bão qua ẩn dụ cho những khó khăn, sóng gió cuộc đời mà mẹ che chở cho con).",
    "c": "So sánh.",
    "d": "Nói quá.",
    "correct": "Điệp ngữ và Ẩn dụ (Mưa sa, bão qua ẩn dụ cho những khó khăn, sóng gió cuộc đời mà mẹ che chở cho con).",
    "explain": "'Mưa sa', 'bão qua' không chỉ là thiên tai thực tế mà là những biến cố cuộc đời. Bàn tay mẹ nhỏ bé nhưng có sức mạnh phi thường bảo vệ con bình yên."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Câu nào sau đây mắc lỗi 'Lặp từ' (dư thừa từ) cần phải sửa?",
    "a": "Những bông hoa đẹp tuyệt vời.",
    "b": "Tôi rất thích đọc sách báo.",
    "c": "Ngày sinh nhật của em là ngày vui nhất.",
    "d": "Vẻ đẹp thẩm mỹ của bức tranh rất ấn tượng.",
    "correct": "Vẻ đẹp thẩm mỹ của bức tranh rất ấn tượng.",
    "explain": "'Thẩm mỹ' đã bao hàm nghĩa là 'vẻ đẹp' (cái đẹp). Viết 'Vẻ đẹp thẩm mỹ' là lặp thừa nghĩa (Vẻ đẹp vẻ đẹp). Nên sửa thành: 'Giá trị thẩm mỹ của bức tranh...' hoặc 'Vẻ đẹp của bức tranh...'."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Tại sao nói văn bản 'Hồ Chí Minh và Tuyên ngôn Độc lập' (Bùi Đình Phong) là văn bản nghị luận?",
    "a": "Vì nó kể lại quá trình Bác Hồ viết tuyên ngôn.",
    "b": "Vì nó dùng lý lẽ và dẫn chứng để làm sáng tỏ một vấn đề: Quá trình chuẩn bị và soạn thảo Tuyên ngôn Độc lập của Bác là rất công phu, nghiêm túc và trí tuệ.",
    "c": "Vì nó miêu tả vẻ đẹp của Bác Hồ.",
    "d": "Vì nó cung cấp thông tin ngày giờ.",
    "correct": "Vì nó dùng lý lẽ và dẫn chứng để làm sáng tỏ một vấn đề: Quá trình chuẩn bị và soạn thảo Tuyên ngôn Độc lập của Bác là rất công phu, nghiêm túc và trí tuệ.",
    "explain": "Đặc trưng của văn nghị luận là hệ thống luận điểm, luận cứ nhằm thuyết phục người đọc về một quan điểm/nhận định."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong bài thơ 'Những cánh buồm' (Hoàng Trung Thông), hình ảnh 'Cánh buồm' mang ý nghĩa biểu tượng gì?",
    "a": "Phương tiện đi lại trên biển.",
    "b": "Ước mơ, khát vọng khám phá những chân trời mới của con người qua các thế hệ (cha và con).",
    "c": "Vẻ đẹp của biển cả.",
    "d": "Sự vất vả của nghề chài lưới.",
    "correct": "Ước mơ, khát vọng khám phá những chân trời mới của con người qua các thế hệ (cha và con).",
    "explain": "Cánh buồm căng gió ra khơi là biểu tượng cho khát vọng vươn xa. 'Cha mượn cho con buồm trắng nhé' là sự tiếp nối ước mơ từ thế hệ này sang thế hệ khác."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyện 'Treo biển', chi tiết cuối cùng 'Cất nốt cái biển đi' phê phán điều gì mạnh mẽ nhất?",
    "a": "Sự lãng phí tiền bạc.",
    "b": "Sự thiếu chủ kiến, không có tư duy độc lập, ba phải, ai nói gì cũng nghe mà không suy xét đúng sai.",
    "c": "Sự dốt nát về ngôn ngữ.",
    "d": "Sự nhiệt tình thái quá của người qua đường.",
    "correct": "Sự thiếu chủ kiến, không có tư duy độc lập, ba phải, ai nói gì cũng nghe mà không suy xét đúng sai.",
    "explain": "Cái sai không nằm ở cái biển (nó vốn đầy đủ thông tin), cái sai nằm ở người chủ không hiểu mục đích của cái biển nên mới nghe theo những lời khuyên vô lý."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Câu 'Thấy một ông già đang ngồi ở vệ cỏ ven đường chờ xe' mắc lỗi ngữ pháp gì?",
    "a": "Thiếu Chủ ngữ.",
    "b": "Thiếu Vị ngữ.",
    "c": "Thiếu cả Chủ ngữ và Vị ngữ (Chỉ là một cụm Động từ).",
    "d": "Dùng từ sai nghĩa.",
    "correct": "Thiếu cả Chủ ngữ và Vị ngữ (Chỉ là một cụm Động từ).",
    "explain": "Đây mới chỉ là một cụm động từ mở đầu bằng 'Thấy...'. Chưa biết 'Ai thấy?' (CN) và 'Thấy thì làm sao?' (VN chính). Sửa: 'Tôi thấy một ông già...' (thêm CN) hoặc 'Thấy một ông già..., tôi liền dừng lại' (biến thành trạng ngữ)."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyện 'Con Rồng cháu Tiên', chi tiết bọc trăm trứng nở trăm con có ý nghĩa gì đối với sự đoàn kết dân tộc?",
    "a": "Giải thích sự đông đúc của dân số Việt Nam.",
    "b": "Khẳng định mọi người Việt Nam đều cùng một bọc sinh ra (Đồng bào), có chung dòng máu, chung nguồn cội, nên phải yêu thương giúp đỡ lẫn nhau.",
    "c": "Chứng tỏ người Việt rất khỏe mạnh.",
    "d": "Thể hiện sự kỳ diệu của Lạc Long Quân.",
    "correct": "Khẳng định mọi người Việt Nam đều cùng một bọc sinh ra (Đồng bào), có chung dòng máu, chung nguồn cội, nên phải yêu thương giúp đỡ lẫn nhau.",
    "explain": "Từ 'Đồng bào' (cùng bọc) bắt nguồn từ tích này. Đây là cơ sở cốt lõi cho tinh thần đại đoàn kết dân tộc Việt Nam suốt hàng ngàn năm."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong văn bản 'Tháng Giêng, mơ về trăng non rét ngọt' (Vũ Bằng), cụm từ 'rét ngọt' gợi tả cảm giác gì?",
    "a": "Cái rét cắt da cắt thịt.",
    "b": "Cái rét tê tái kèm theo mưa phùn.",
    "c": "Cái rét nhẹ nhàng, êm dịu, mang theo hơi xuân ấm áp và sức sống, khiến lòng người cảm thấy dễ chịu, ngọt ngào.",
    "d": "Cái rét buốt giá của mùa đông.",
    "correct": "Cái rét nhẹ nhàng, êm dịu, mang theo hơi xuân ấm áp và sức sống, khiến lòng người cảm thấy dễ chịu, ngọt ngào.",
    "explain": "Đây là cách dùng từ tinh tế của Vũ Bằng. 'Ngọt' là ẩn dụ chuyển đổi cảm giác, miêu tả cái lạnh không gây khó chịu mà gợi tình, gợi cảm giác sum vầy."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Tại sao trong truyện cổ tích, nhân vật xấu xí (Sọ Dừa) hoặc nghèo khổ (Chử Đồng Tử, Thạch Sanh) thường lấy được công chúa?",
    "a": "Vì may mắn.",
    "b": "Thể hiện ước mơ đổi đời và quan niệm dân chủ của nhân dân: Trong xã hội công bằng, người hiền lành, tài năng dù xuất thân thấp kém vẫn xứng đáng được hưởng hạnh phúc cao sang nhất.",
    "c": "Vì công chúa thường thích những điều lạ.",
    "d": "Vì vua cha ép buộc.",
    "correct": "Thể hiện ước mơ đổi đời và quan niệm dân chủ của nhân dân: Trong xã hội công bằng, người hiền lành, tài năng dù xuất thân thấp kém vẫn xứng đáng được hưởng hạnh phúc cao sang nhất.",
    "explain": "Hôn nhân không môn đăng hộ đối trong cổ tích là sự phá vỡ rào cản giai cấp của chế độ phong kiến, thể hiện khát vọng công bằng xã hội."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong bài thơ 'Gấu con chân vòng kiềng', phản ứng của mọi người và Gấu mẹ khác nhau như thế nào trước đôi chân của Gấu con?",
    "a": "Mọi người chê bai - Gấu mẹ cũng chê bai.",
    "b": "Mọi người trêu chọc ác ý - Gấu mẹ động viên, khen ngợi và chỉ ra những tấm gương thành công để con tự tin.",
    "c": "Mọi người khen ngợi - Gấu mẹ lo lắng.",
    "d": "Mọi người không quan tâm - Gấu mẹ buồn rầu.",
    "correct": "Mọi người trêu chọc ác ý - Gấu mẹ động viên, khen ngợi và chỉ ra những tấm gương thành công để con tự tin.",
    "explain": "Vai trò của người mẹ là điểm tựa tinh thần, giúp con vượt qua 'nạn body shaming' (miệt thị ngoại hình) để nhận ra giá trị bản thân."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong câu: 'Học quả là khó khăn, gian khổ.' (Thầy thuốc giỏi cốt nhất ở tấm lòng), từ 'quả' thuộc từ loại gì và có tác dụng gì?",
    "a": "Danh từ; chỉ quả cây.",
    "b": "Phó từ (trợ từ); dùng để nhấn mạnh mức độ, khẳng định tính chất khó khăn của việc học là sự thật.",
    "c": "Động từ; chỉ hành động.",
    "d": "Tính từ; chỉ tính chất.",
    "correct": "Phó từ (trợ từ); dùng để nhấn mạnh mức độ, khẳng định tính chất khó khăn của việc học là sự thật.",
    "explain": "'Quả' ở đây đồng nghĩa với 'quả thật', 'đúng là', dùng để tăng sức thuyết phục cho nhận định."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Văn bản 'Giọt sương đêm' (Trần Đức Tiến) gửi gắm thông điệp gì về cuộc sống hiện đại?",
    "a": "Hãy sống chậm lại để lắng nghe tiếng nói bên trong và trân trọng những giá trị cội nguồn (quê hương) mà đôi khi sự bận rộn làm ta lãng quên.",
    "b": "Không nên đi buôn bán xa nhà.",
    "c": "Nên ngủ ở khách sạn sang trọng.",
    "d": "Phải đề phòng kẻ gian vào ban đêm.",
    "correct": "Hãy sống chậm lại để lắng nghe tiếng nói bên trong và trân trọng những giá trị cội nguồn (quê hương) mà đôi khi sự bận rộn làm ta lãng quên.",
    "explain": "Bọ Dừa mải mê kiếm sống quên cả đường về. Chỉ một giọt sương lạnh buốt (biểu tượng của thiên nhiên/sự thức tỉnh) mới làm ông nhớ ra mình còn một quê nhà."
  },
  
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong câu kết của truyện 'Bức tranh của em gái tôi': 'Không phải con đâu. Đấy là tâm hồn và lòng nhân hậu của em con đấy', người anh đã nhận ra điều gì quan trọng nhất?",
    "a": "Bức tranh vẽ không giống mình.",
    "b": "Em gái vẽ đẹp hơn mình tưởng.",
    "c": "Sự tự nhận thức sâu sắc: Hình ảnh trong tranh là 'cái tôi' tốt đẹp mà người em kỳ vọng, đối lập hoàn toàn với 'cái tôi' thực tế đầy đố kỵ, hẹp hòi của người anh.",
    "d": "Người anh từ chối nhận bức tranh.",
    "correct": "Sự tự nhận thức sâu sắc: Hình ảnh trong tranh là 'cái tôi' tốt đẹp mà người em kỳ vọng, đối lập hoàn toàn với 'cái tôi' thực tế đầy đố kỵ, hẹp hòi của người anh.",
    "explain": "Câu nói thể hiện sự thức tỉnh lương tâm. Người anh không chỉ nhìn thấy bức tranh mà nhìn thấy 'tâm hồn' cao đẹp của em gái, thứ đã soi rọi và gột rửa tâm hồn vẩn đục của mình."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Tại sao trong truyện 'Cô bé bán diêm' (Andersen), những mộng tưởng của cô bé lại hiện ra lần lượt theo trình tự: Lò sưởi -> Ngỗng quay -> Cây thông Noel -> Bà?",
    "a": "Sắp xếp ngẫu nhiên.",
    "b": "Theo quy luật tâm lý của người đang khao khát tột độ: Từ nhu cầu vật chất cấp thiết nhất (ấm, no) đến nhu cầu tinh thần (vui vẻ) và cuối cùng là nhu cầu tình cảm thiêng liêng nhất (tình yêu thương).",
    "c": "Vì diêm cháy theo thứ tự đó.",
    "d": "Vì đó là những thứ cô bé nhìn thấy trên đường.",
    "correct": "Theo quy luật tâm lý của người đang khao khát tột độ: Từ nhu cầu vật chất cấp thiết nhất (ấm, no) đến nhu cầu tinh thần (vui vẻ) và cuối cùng là nhu cầu tình cảm thiêng liêng nhất (tình yêu thương).",
    "explain": "Andersen đã miêu tả cực kỳ logic diễn biến tâm lý của trẻ thơ trong hoàn cảnh khắc nghiệt. Nhu cầu sinh tồn (ấm/ăn) đến trước, nhu cầu tình cảm (bà) là điểm tựa cuối cùng để giải thoát."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong câu: 'Người ta là hoa đất', phép so sánh này có gì đặc biệt so với các phép so sánh thông thường (như 'Đẹp như hoa')?",
    "a": "So sánh người với vật.",
    "b": "So sánh ngược: Lấy con người làm chuẩn mực để định giá cho vẻ đẹp của thiên nhiên (đất), khẳng định con người là tinh hoa quý giá nhất của vũ trụ.",
    "c": "So sánh ngang bằng.",
    "d": "So sánh không ngang bằng.",
    "correct": "So sánh ngược: Lấy con người làm chuẩn mực để định giá cho vẻ đẹp của thiên nhiên (đất), khẳng định con người là tinh hoa quý giá nhất của vũ trụ.",
    "explain": "Thường người ta lấy thiên nhiên làm chuẩn (đẹp như hoa, nhanh như cắt). Ở đây, con người mới là chuẩn mực cao nhất ('hoa của đất'), thể hiện quan niệm nhân văn sâu sắc."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyện cười 'Lợn cưới, áo mới', yếu tố gây cười nằm ở sự mâu thuẫn nào trong hành động của hai nhân vật?",
    "a": "Hai người đều bị điếc.",
    "b": "Mâu thuẫn giữa mục đích giao tiếp (hỏi-đáp thông tin) và thói hay khoe của (làm méo mó thông tin để khoe khoang).",
    "c": "Mâu thuẫn giữa giàu và nghèo.",
    "d": "Hai người nói quá to.",
    "correct": "Mâu thuẫn giữa mục đích giao tiếp (hỏi-đáp thông tin) và thói hay khoe của (làm méo mó thông tin để khoe khoang).",
    "explain": "Thay vì hỏi 'Thấy con lợn chạy qua không?' và trả lời 'Không thấy', họ lại chèn thêm 'Lợn cưới', 'Áo mới' vào những chỗ thừa thãi, làm cuộc đối thoại trở nên lố bịch."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Xét về sắc thái biểu cảm, câu hỏi tu từ: 'Ai mà chẳng thích mùa xuân?' khác với câu nghi vấn: 'Bạn có thích mùa xuân không?' ở điểm nào?",
    "a": "Câu đầu là lời khẳng định (Mọi người đều thích), câu sau là thắc mắc cần câu trả lời.",
    "b": "Câu đầu là thắc mắc, câu sau là khẳng định.",
    "c": "Cả hai đều cần câu trả lời Có/Không.",
    "d": "Không có gì khác biệt.",
    "correct": "Câu đầu là lời khẳng định (Mọi người đều thích), câu sau là thắc mắc cần câu trả lời.",
    "explain": "Câu hỏi tu từ không dùng để hỏi mà dùng để khẳng định chân lý hoặc bộc lộ cảm xúc."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong văn bản 'Cây tre Việt Nam', nhịp điệu của câu văn: 'Gậy tre, chông tre chống lại sắt thép của quân thù. Tre xung phong vào xe tăng, đại bác.' có đặc điểm gì?",
    "a": "Nhịp điệu chậm rãi, buồn bã.",
    "b": "Nhịp điệu ngắt quãng, dồn dập, mạnh mẽ như hành khúc, mô phỏng khí thế chiến đấu quyết liệt.",
    "c": "Nhịp điệu êm ả như thơ lục bát.",
    "d": "Không có nhịp điệu.",
    "correct": "Nhịp điệu ngắt quãng, dồn dập, mạnh mẽ như hành khúc, mô phỏng khí thế chiến đấu quyết liệt.",
    "explain": "Văn xuôi của Thép Mới giàu chất nhạc (Văn chính luận trữ tình). Các câu ngắn, động từ mạnh tạo âm hưởng hào hùng."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Trong truyện 'Thạch Sanh', hành động tha chết cho quân sĩ 18 nước chư hầu và thết đãi cơm niêu thể hiện tư tưởng gì của cha ông ta?",
    "a": "Tư tưởng hiếu chiến.",
    "b": "Tư tưởng nhân nghĩa, yêu chuộng hòa bình, muốn chấm dứt chiến tranh bằng sự bao dung và no ấm chứ không phải bằng sự hận thù.",
    "c": "Tư tưởng khoe khoang sự giàu có.",
    "d": "Tư tưởng sợ hãi kẻ thù.",
    "correct": "Tư tưởng nhân nghĩa, yêu chuộng hòa bình, muốn chấm dứt chiến tranh bằng sự bao dung và no ấm chứ không phải bằng sự hận thù.",
    "explain": "Đây là tư tưởng 'Đại nghĩa thắng hung tàn' xuyên suốt lịch sử dân tộc. Thắng bằng vũ lực chỉ là hạ sách, thắng bằng lòng người (tâm phục khẩu phục) mới là thượng sách."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Từ 'chân' trong các trường hợp: 'Chân tường', 'Chân trời', 'Chân mây' được chuyển nghĩa theo phương thức nào?",
    "a": "Ẩn dụ (dựa trên nét tương đồng về vị trí thấp/tiếp xúc với nền).",
    "b": "Hoán dụ (dựa trên quan hệ đi kèm).",
    "c": "So sánh.",
    "d": "Nhân hóa.",
    "correct": "Ẩn dụ (dựa trên nét tương đồng về vị trí thấp/tiếp xúc với nền).",
    "explain": "Chân người (cơ sở, phần dưới cùng) -> Chân tường/Chân trời (phần dưới cùng, nơi tiếp giáp). Đây là ẩn dụ hình thức/vị trí."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Khi Maxim Gorky nói 'Văn học là Nhân học', ý nghĩa sâu xa nhất đối với người học Văn là gì?",
    "a": "Học Văn là học về cơ thể con người.",
    "b": "Học Văn là để biết nhiều chữ.",
    "c": "Học Văn là quá trình học cách làm Người, học cách thấu hiểu, yêu thương, chia sẻ và hoàn thiện nhân cách bản thân qua các tác phẩm.",
    "d": "Học Văn để trở thành nhà văn.",
    "correct": "Học Văn là quá trình học cách làm Người, học cách thấu hiểu, yêu thương, chia sẻ và hoàn thiện nhân cách bản thân qua các tác phẩm.",
    "explain": "Văn học không chỉ là câu chữ, đích đến cuối cùng của nó là con người. Tác phẩm văn học giúp ta sống 'người' hơn."
  },
  {
    "subject": "Ngữ Văn",
    "difficulty": "hard",
    "content": "Tại sao Dế Mèn (trong 'Dế Mèn phiêu lưu ký') lại chọn kể chuyện đời mình bằng ngôi thứ nhất ('Tôi')?",
    "a": "Vì Tô Hoài thích thế.",
    "b": "Để Dế Mèn dễ bề khoe khoang sức mạnh.",
    "c": "Để câu chuyện trở nên chân thực, đáng tin cậy (người trong cuộc kể lại), đồng thời dễ dàng bộc lộ nội tâm, sự ân hận và quá trình tự nhận thức trưởng thành của nhân vật.",
    "d": "Để che giấu những lỗi lầm của mình.",
    "correct": "Để câu chuyện trở nên chân thực, đáng tin cậy (người trong cuộc kể lại), đồng thời dễ dàng bộc lộ nội tâm, sự ân hận và quá trình tự nhận thức trưởng thành của nhân vật.",
    "explain": "Ngôi 'Tôi' cho phép nhân vật tự phán xét chính mình ('tôi ăn năn quá', 'tôi hối hận lắm'). Nếu dùng ngôi thứ 3, tính chất tự thú và bài học đường đời sẽ bớt đi sự thấm thía cá nhân."
  }
]
